/*
#############################################################################################
# BattleBorn (1.0.0.0) SDK
# Generated with the CodeRedGenerator v1.0.3
# ========================================================================================= #
# File: Core_parameters.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

/*
# ========================================================================================= #
# Parameters
# ========================================================================================= #
*/

// Function Core.Object.GetGlobalDebugTarget
// [0x00020401]  (iNative[16225])
struct UObject_execGetGlobalDebugTarget_Params
{
	class UObject*                                     ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SetGlobalDebugTarget
// [0x00020401]  (iNative[16548])
struct UObject_execSetGlobalDebugTarget_Params
{
	class UObject*                                     Target;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.LogContentDebug
// [0x00020401]  (iNative[16347])
struct UObject_execLogContentDebug_Params
{
	class FString                                      Message;                                          		// 0x0000 (0x0010) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
};

// Function Core.Object.GetWebLanguageCode
// [0x00022401]  (iNative[16243])
struct UObject_execGetWebLanguageCode_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.GetLanguage
// [0x00022401]  (iNative[16228])
struct UObject_execGetLanguage_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.GetRandomOptionSumFrequency
// [0x12420001] 
struct UObject_execGetRandomOptionSumFrequency_Params
{
	class TArray<float>                                FreqList;                                         		// 0x0000 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	int32_t                                            ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.IsShippingBuild
// [0x00020401]  (iNative[16319])
struct UObject_execIsShippingBuild_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetBuildChangelistNumber
// [0x00020401]  (iNative[16220])
struct UObject_execGetBuildChangelistNumber_Params
{
	int32_t                                            ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetEngineVersion
// [0x00020401]  (iNative[16222])
struct UObject_execGetEngineVersion_Params
{
	int32_t                                            ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetSystemTime
// [0x00420401]  (iNative[16240])
struct UObject_execGetSystemTime_Params
{
	int32_t                                            Year;                                             		// 0x0000 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Month;                                            		// 0x0004 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            DayOfWeek;                                        		// 0x0008 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Day;                                              		// 0x000C (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Hour;                                             		// 0x0010 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Min;                                              		// 0x0014 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            Sec;                                              		// 0x0018 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	int32_t                                            MSec;                                             		// 0x001C (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Core.Object.TimeStamp
// [0x00020401]  (iNative[16628])
struct UObject_execTimeStamp_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.TransformVectorByRotation
// [0x00024401]  (iNative[16634])
struct UObject_execTransformVectorByRotation_Params
{
	struct FRotator                                    SourceRotation;                                   		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     SourceVector;                                     		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bInverse : 1;                                     		// 0x0018 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	struct FVector                                     ReturnValue;                                      		// 0x001C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetPackageName
// [0x00020401]  (iNative[16230])
struct UObject_execGetPackageName_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.IsPendingKill
// [0x00020401]  (iNative[16317])
struct UObject_execIsPendingKill_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.ByteToFloat
// [0x12024101] 
struct UObject_execByteToFloat_Params
{
	uint8_t                                            inputByte;                                        		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bSigned : 1;                                      		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.FloatToByte
// [0x12024101] 
struct UObject_execFloatToByte_Params
{
	float                                              inputFloat;                                       		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bSigned : 1;                                      		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint8_t                                            ReturnValue;                                      		// 0x0008 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.UnwindHeading
// [0x12022101] 
struct UObject_execUnwindHeading_Params
{
	float                                              A;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.FindDeltaAngle
// [0x12022101] 
struct UObject_execFindDeltaAngle_Params
{
	float                                              A1;                                               		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              A2;                                               		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetHeadingAngle
// [0x12022101] 
struct UObject_execGetHeadingAngle_Params
{
	struct FVector                                     Dir;                                              		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetAngularDegreesFromRadians
// [0x12422101] 
struct UObject_execGetAngularDegreesFromRadians_Params
{
	struct FVector2D                                   OutFOV;                                           		// 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Core.Object.GetAngularFromDotDist
// [0x00422401]  (iNative[16216])
struct UObject_execGetAngularFromDotDist_Params
{
	struct FVector2D                                   OutAngDist;                                       		// 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector2D                                   DotDist;                                          		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.GetAngularDistance
// [0x00422401]  (iNative[16215])
struct UObject_execGetAngularDistance_Params
{
	struct FVector2D                                   OutAngularDist;                                   		// 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     Direction;                                        		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisX;                                            		// 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisY;                                            		// 0x0020 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisZ;                                            		// 0x002C (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0038 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetDotDistance
// [0x00422401]  (iNative[16221])
struct UObject_execGetDotDistance_Params
{
	struct FVector2D                                   OutDotDist;                                       		// 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     Direction;                                        		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisX;                                            		// 0x0014 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisY;                                            		// 0x0020 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AxisZ;                                            		// 0x002C (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0038 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.PointProjectToPlane
// [0x00022401]  (iNative[16492])
struct UObject_execPointProjectToPlane_Params
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     A;                                                		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     B;                                                		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     C;                                                		// 0x0024 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      		// 0x0030 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.PointDistToPlane
// [0x12424101] 
struct UObject_execPointDistToPlane_Params
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    Orientation;                                      		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Origin;                                           		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     out_ClosestPoint;                                 		// 0x0024 (0x000C) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
	float                                              ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.PointDistToSegment
// [0x00424401]  (iNative[16491])
struct UObject_execPointDistToSegment_Params
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     StartPoint;                                       		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     EndPoint;                                         		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     OutClosestPoint;                                  		// 0x0024 (0x000C) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
	float                                              ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.PointDistToLine
// [0x00424401]  (iNative[16489])
struct UObject_execPointDistToLine_Params
{
	struct FVector                                     Point;                                            		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Line;                                             		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Origin;                                           		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     OutClosestPoint;                                  		// 0x0024 (0x000C) [0x0000000000000190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm)
	float                                              ReturnValue;                                      		// 0x0030 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetPerObjectConfigSections
// [0x00426401]  (iNative[16231])
struct UObject_execGetPerObjectConfigSections_Params
{
	class UClass*                                      SearchClass;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class TArray<class FString>                        out_SectionNames;                                 		// 0x0008 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class UObject*                                     ObjectOuter;                                      		// 0x0018 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	int32_t                                            MaxResults;                                       		// 0x0020 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.StaticSaveConfig
// [0x00022401]  (iNative[16583])
struct UObject_execStaticSaveConfig_Params
{
};

// Function Core.Object.SaveConfig
// [0x21800020401]  (iNative[16536])
struct UObject_execSaveConfig_Params
{
};

// Function Core.Object.GetAttributeModiferDescriptor
// [0x00020401]  (iNative[16217])
struct UObject_execGetAttributeModiferDescriptor_Params
{
	struct FName                                       AttributeName;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class FString                                      ReturnValue;                                      		// 0x0008 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.GetAttributeValueByName
// [0x00020401]  (iNative[16218])
struct UObject_execGetAttributeValueByName_Params
{
	struct FName                                       AttributeName;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.RemoveModifier
// [0x00024401]  (iNative[16523])
struct UObject_execRemoveModifier_Params
{
	class UAttributeModifier*                          mod;                                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       AttributeName;                                    		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bSuppressNotify : 1;                              		// 0x0010 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.AddModifier
// [0x00024401]  (iNative[15992])
struct UObject_execAddModifier_Params
{
	class UAttributeModifier*                          mod;                                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       AttributeName;                                    		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bSuppressNotify : 1;                              		// 0x0010 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.FindObject
// [0x00022401]  (iNative[16195])
struct UObject_execFindObject_Params
{
	class FString                                      ObjectName;                                       		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UClass*                                      ObjectClass;                                      		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ReturnValue;                                      		// 0x0018 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.DynamicLoadObject
// [0x00026401]  (iNative[16151])
struct UObject_execDynamicLoadObject_Params
{
	class FString                                      ObjectName;                                       		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UClass*                                      ObjectClass;                                      		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           MayFail : 1;                                      		// 0x0018 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class UObject*                                     ReturnValue;                                      		// 0x0020 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetEnum
// [0x00022401]  (iNative[16223])
struct UObject_execGetEnum_Params
{
	class UObject*                                     E;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            i;                                                		// 0x0008 (0x0004) [0x0000000000000880] (CPF_Parm | CPF_CoerceParm)
	struct FName                                       ReturnValue;                                      		// 0x000C (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Disable
// [0x7600020401]  (iNative[16131])
struct UObject_execDisable_Params
{
	struct FName                                       ProbeFunc;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.Enable
// [0x7500020401]  (iNative[15619])
struct UObject_execEnable_Params
{
	struct FName                                       ProbeFunc;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.EndState
// [0x12020802] 
struct UObject_eventEndState_Params
{
	struct FName                                       NextStateName;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.BeginState
// [0x12020802] 
struct UObject_eventBeginState_Params
{
	struct FName                                       PreviousStateName;                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.StaticBreakPoint
// [0x00022401]  (iNative[16582])
struct UObject_execStaticBreakPoint_Params
{
};

// Function Core.Object.BreakPoint
// [0x00024401]  (iNative[16066])
struct UObject_execBreakPoint_Params
{
	class UObject*                                     SomeObject;                                       		// 0x0000 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.PrintScriptStack
// [0x00020401]  (iNative[16495])
struct UObject_execPrintScriptStack_Params
{
};

// Function Core.Object.DumpStateStack
// [0x00020401]  (iNative[16150])
struct UObject_execDumpStateStack_Params
{
};

// Function Core.Object.GetStateName
// [0x11C00020401]  (iNative[16238])
struct UObject_execGetStateName_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.IsChildState
// [0x00020401]  (iNative[16313])
struct UObject_execIsChildState_Params
{
	struct FName                                       TestState;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       TestParentState;                                  		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.IsInState
// [0x11900020401]  (iNative[16316])
struct UObject_execIsInState_Params
{
	struct FName                                       TestState;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GotoState
// [0x7100024401]  (iNative[16244])
struct UObject_execGotoState_Params
{
	struct FName                                       NewState;                                         		// 0x0000 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.IsUTracing
// [0x00022401]  (iNative[16321])
struct UObject_execIsUTracing_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SetUTracing
// [0x00022401]  (iNative[16550])
struct UObject_execSetUTracing_Params
{
	uint32_t                                           bShouldUTrace : 1;                                		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function Core.Object.GetFuncName
// [0x00022401]  (iNative[16224])
struct UObject_execGetFuncName_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.DebugBreak
// [0x00026401]  (iNative[16117])
struct UObject_execDebugBreak_Params
{
	int32_t                                            UserFlags;                                        		// 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint8_t                                            DebuggerType;                                     		// 0x0004 (0x0001) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.GetScriptTrace
// [0x00022401]  (iNative[16237])
struct UObject_execGetScriptTrace_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.ScriptTrace
// [0x00022401]  (iNative[16542])
struct UObject_execScriptTrace_Params
{
};

// Function Core.Object.ParseLocalizedPropertyPath
// [0x12022001] 
struct UObject_execParseLocalizedPropertyPath_Params
{
	class FString                                      PathName;                                         		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.Localize
// [0x00022400]  (iNative[16343])
struct UObject_execLocalize_Params
{
	class FString                                      SectionName;                                      		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      KeyName;                                          		// 0x0010 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      PackageName;                                      		// 0x0020 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      ReturnValue;                                      		// 0x0030 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.LogIndentedInternal
// [0x00026401]  (iNative[16349])
struct UObject_execLogIndentedInternal_Params
{
	class FString                                      S;                                                		// 0x0000 (0x0010) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	struct FName                                       LogTag;                                           		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            IndentationLevelChange;                           		// 0x0018 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.WarnInternal
// [0xE800022401]  (iNative[16668])
struct UObject_execWarnInternal_Params
{
	class FString                                      S;                                                		// 0x0000 (0x0010) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
};

// Function Core.Object.LogInternal
// [0xE700026401]  (iNative[16350])
struct UObject_execLogInternal_Params
{
	class FString                                      S;                                                		// 0x0000 (0x0010) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
	struct FName                                       Tag;                                              		// 0x0010 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.GetStringForNameBasedObjectPath
// [0x00022401]  (iNative[16239])
struct UObject_execGetStringForNameBasedObjectPath_Params
{
	struct FNameBasedObjectPath                        ObjectPath;                                       		// 0x0000 (0x0034) [0x0000000000000082] (CPF_Const | CPF_Parm)
	class FString                                      ReturnValue;                                      		// 0x0038 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.SetNameBasedObjectPath
// [0x00422401]  (iNative[16549])
struct UObject_execSetNameBasedObjectPath_Params
{
	struct FNameBasedObjectPath                        ObjectPath;                                       		// 0x0000 (0x0034) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	class UObject*                                     Object;                                           		// 0x0038 (0x0008) [0x0000000000000082] (CPF_Const | CPF_Parm)
};

// Function Core.Object.SmartVectTimeRemaining
// [0x00420401]  (iNative[16563])
struct UObject_execSmartVectTimeRemaining_Params
{
	struct FSmartVector                                theSV;                                            		// 0x0000 (0x001C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              ReturnValue;                                      		// 0x001C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SmartVectTimeSinceSet
// [0x00420401]  (iNative[16564])
struct UObject_execSmartVectTimeSinceSet_Params
{
	struct FSmartVector                                theSV;                                            		// 0x0000 (0x001C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              ReturnValue;                                      		// 0x001C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SmartVectGetVector
// [0x00420401]  (iNative[16557])
struct UObject_execSmartVectGetVector_Params
{
	struct FSmartVector                                theSV;                                            		// 0x0000 (0x001C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     OutVector;                                        		// 0x001C (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0028 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SmartVectIsSet
// [0x00420401]  (iNative[16558])
struct UObject_execSmartVectIsSet_Params
{
	struct FSmartVector                                theSV;                                            		// 0x0000 (0x001C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x001C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SmartVectSetVectorTimed
// [0x00420401]  (iNative[16562])
struct UObject_execSmartVectSetVectorTimed_Params
{
	struct FSmartVector                                theSV;                                            		// 0x0000 (0x001C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     InVector;                                         		// 0x001C (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              Duration;                                         		// 0x0028 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Core.Object.SmartVectValue
// [0x00420401]  (iNative[16565])
struct UObject_execSmartVectValue_Params
{
	struct FSmartVector                                theSV;                                            		// 0x0000 (0x001C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     ReturnValue;                                      		// 0x001C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SmartVectReset
// [0x00420401]  (iNative[16560])
struct UObject_execSmartVectReset_Params
{
	struct FSmartVector                                theSV;                                            		// 0x0000 (0x001C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Core.Object.SmartVectSetVector
// [0x00424401]  (iNative[16561])
struct UObject_execSmartVectSetVector_Params
{
	struct FSmartVector                                theSV;                                            		// 0x0000 (0x001C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     InVector;                                         		// 0x001C (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bUpdateTime : 1;                                  		// 0x0028 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function Core.Object.Subtract_LinearColorLinearColor
// [0x10023001] 
struct UObject_execSubtract_LinearColorLinearColor_Params
{
	struct FLinearColor                                A;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                B;                                                		// 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      		// 0x0020 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Multiply_LinearColorFloat
// [0x10023001] 
struct UObject_execMultiply_LinearColorFloat_Params
{
	struct FLinearColor                                LC;                                               		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	float                                              Mult;                                             		// 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      		// 0x0014 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.ColorToLinearColor
// [0x12022001] 
struct UObject_execColorToLinearColor_Params
{
	struct FColor                                      OldColor;                                         		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      		// 0x0004 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MakeLinearColor
// [0x12022001] 
struct UObject_execMakeLinearColor_Params
{
	float                                              R;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              G;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              B;                                                		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              A;                                                		// 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FLinearColor                                ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetHTMLColor
// [0x00422401]  (iNative[16227])
struct UObject_execGetHTMLColor_Params
{
	struct FColor                                      C;                                                		// 0x0000 (0x0004) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	class FString                                      ReturnValue;                                      		// 0x0008 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Core.Object.LerpColor
// [0x12022001] 
struct UObject_execLerpColor_Params
{
	struct FColor                                      A;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      B;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Alpha;                                            		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MakeColor
// [0x12026001] 
struct UObject_execMakeColor_Params
{
	uint8_t                                            R;                                                		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            G;                                                		// 0x0001 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            B;                                                		// 0x0002 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            A;                                                		// 0x0003 (0x0001) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FColor                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Add_ColorColor
// [0x10023001] 
struct UObject_execAdd_ColorColor_Params
{
	struct FColor                                      A;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      B;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Multiply_ColorFloat
// [0x10023001] 
struct UObject_execMultiply_ColorFloat_Params
{
	struct FColor                                      A;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              B;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Multiply_FloatColor
// [0x10023001] 
struct UObject_execMultiply_FloatColor_Params
{
	float                                              A;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      B;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Subtract_ColorColor
// [0x10023001] 
struct UObject_execSubtract_ColorColor_Params
{
	struct FColor                                      A;                                                		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      B;                                                		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FColor                                      ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.EvalInterpCurveVector2D
// [0x00020401]  (iNative[16187])
struct UObject_execEvalInterpCurveVector2D_Params
{
	struct FInterpCurveVector2D                        Vector2DCurve;                                    		// 0x0000 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	float                                              InVal;                                            		// 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      		// 0x001C (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.EvalInterpCurveVector
// [0x00020401]  (iNative[16186])
struct UObject_execEvalInterpCurveVector_Params
{
	struct FInterpCurveVector                          VectorCurve;                                      		// 0x0000 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	float                                              InVal;                                            		// 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      		// 0x001C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.EvalInterpCurveFloat
// [0x00020401]  (iNative[16185])
struct UObject_execEvalInterpCurveFloat_Params
{
	struct FInterpCurveFloat                           FloatCurve;                                       		// 0x0000 (0x0018) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	float                                              InVal;                                            		// 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x001C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.vect2d
// [0x12022001] 
struct UObject_execvect2d_Params
{
	float                                              InX;                                              		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              InY;                                              		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetMappedRangeValue
// [0x00022501]  (iNative[16229])
struct UObject_execGetMappedRangeValue_Params
{
	struct FVector2D                                   InputRange;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   OutputRange;                                      		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              Value;                                            		// 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0014 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetRangePctByValue
// [0x12022101] 
struct UObject_execGetRangePctByValue_Params
{
	struct FVector2D                                   Range;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              Value;                                            		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.GetRangeValueByPct
// [0x12022101] 
struct UObject_execGetRangeValueByPct_Params
{
	struct FVector2D                                   Range;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              Pct;                                              		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.SubtractEqual_Vector2DVector2D
// [0x00423401]  (iNative[15948])
struct UObject_execSubtractEqual_Vector2DVector2D_Params
{
	struct FVector2D                                   A;                                                		// 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector2D                                   B;                                                		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.AddEqual_Vector2DVector2D
// [0x00423401]  (iNative[15945])
struct UObject_execAddEqual_Vector2DVector2D_Params
{
	struct FVector2D                                   A;                                                		// 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector2D                                   B;                                                		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.DivideEqual_Vector2DFloat
// [0x00423401]  (iNative[15950])
struct UObject_execDivideEqual_Vector2DFloat_Params
{
	struct FVector2D                                   A;                                                		// 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              B;                                                		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      		// 0x000C (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MultiplyEqual_Vector2DFloat
// [0x00423401]  (iNative[15942])
struct UObject_execMultiplyEqual_Vector2DFloat_Params
{
	struct FVector2D                                   A;                                                		// 0x0000 (0x0008) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              B;                                                		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      		// 0x000C (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Divide_Vector2DFloat
// [0x00023401]  (iNative[15949])
struct UObject_execDivide_Vector2DFloat_Params
{
	struct FVector2D                                   A;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              B;                                                		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      		// 0x000C (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Multiply_Vector2DFloat
// [0x00023401]  (iNative[15940])
struct UObject_execMultiply_Vector2DFloat_Params
{
	struct FVector2D                                   A;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              B;                                                		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      		// 0x000C (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Subtract_Vector2DVector2D
// [0x00023401]  (iNative[15946])
struct UObject_execSubtract_Vector2DVector2D_Params
{
	struct FVector2D                                   A;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   B;                                                		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Add_Vector2DVector2D
// [0x00023401]  (iNative[15943])
struct UObject_execAdd_Vector2DVector2D_Params
{
	struct FVector2D                                   A;                                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   B;                                                		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector2D                                   ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Subtract_QuatQuat
// [0x10F00023401]  (iNative[15946])
struct UObject_execSubtract_QuatQuat_Params
{
	struct FQuat                                       A;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       B;                                                		// 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      		// 0x0020 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.Add_QuatQuat
// [0x10E00023401]  (iNative[15943])
struct UObject_execAdd_QuatQuat_Params
{
	struct FQuat                                       A;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       B;                                                		// 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      		// 0x0020 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatSlerp
// [0x00026401]  (iNative[16505])
struct UObject_execQuatSlerp_Params
{
	struct FQuat                                       A;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       B;                                                		// 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	float                                              Alpha;                                            		// 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bShortestPath : 1;                                		// 0x0024 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	struct FQuat                                       ReturnValue;                                      		// 0x0030 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatToRotator
// [0x00022401]  (iNative[16506])
struct UObject_execQuatToRotator_Params
{
	struct FQuat                                       A;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    ReturnValue;                                      		// 0x0010 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatFromRotator
// [0x00022401]  (iNative[16501])
struct UObject_execQuatFromRotator_Params
{
	struct FRotator                                    A;                                                		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatFromAxisAndAngle
// [0x00022401]  (iNative[16500])
struct UObject_execQuatFromAxisAndAngle_Params
{
	struct FVector                                     Axis;                                             		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              Angle;                                            		// 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatFindBetween
// [0x00022401]  (iNative[16499])
struct UObject_execQuatFindBetween_Params
{
	struct FVector                                     A;                                                		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     B;                                                		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      		// 0x0020 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatRotateVector
// [0x00022401]  (iNative[16504])
struct UObject_execQuatRotateVector_Params
{
	struct FQuat                                       A;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     B;                                                		// 0x0010 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      		// 0x001C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatInvert
// [0x00022401]  (iNative[16502])
struct UObject_execQuatInvert_Params
{
	struct FQuat                                       A;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      		// 0x0010 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatDot
// [0x00022401]  (iNative[16498])
struct UObject_execQuatDot_Params
{
	struct FQuat                                       A;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       B;                                                		// 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0020 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.QuatProduct
// [0x00022401]  (iNative[16503])
struct UObject_execQuatProduct_Params
{
	struct FQuat                                       A;                                                		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       B;                                                		// 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FQuat                                       ReturnValue;                                      		// 0x0020 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Core.Object.MatrixGetAxis
// [0x00022401]  (iNative[16367])
struct UObject_execMatrixGetAxis_Params
{
	struct FMatrix                                     TM;                                               		// 0x0000 (0x0040) [0x0000000000000080] (CPF_Parm)    
