/*
#############################################################################################
# BattleBorn (1.0.0.0) SDK
# Generated with the CodeRedGenerator v1.0.3
# ========================================================================================= #
# File: Engine_structs.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

/*
# ========================================================================================= #
# Structs
# ========================================================================================= #
*/

// ScriptStruct Engine.Actor.ResourcePoolReference
// 0x0018
struct FResourcePoolReference
{
	class AResourcePoolManager*                        PoolManager;                                   // 0x0000 (0x0008) [0x0000000000000000]               
	uint8_t                                            PoolIndexInManager;                            // 0x0008 (0x0001) [0x0000000000000000]               
	uint8_t                                            PoolGUID;                                      // 0x0009 (0x0001) [0x0000000000000000]               
	class UResourcePool*                               Data;                                          // 0x0010 (0x0008) [0x1000000000000000]               
};

// ScriptStruct Engine.Actor.PhysEffectInfo
// 0x0018
struct FPhysEffectInfo
{
	float                                              Threshold;                                     // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              ReFireDelay;                                   // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class UParticleSystem*                             Effect;                                        // 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UImpactDefinition*                           ImpactDefinition;                              // 0x0010 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct Engine.Actor.RigidBodyState
// 0x0039
struct FRigidBodyState
{
	struct FVector                                     Position;                                      // 0x0000 (0x000C) [0x0000000000000000]               
	struct FQuat                                       Quaternion;                                    // 0x0010 (0x0010) [0x0000000000000000]               
	struct FVector                                     LinVel;                                        // 0x0020 (0x000C) [0x0000000000000000]               
	struct FVector                                     AngVel;                                        // 0x002C (0x000C) [0x0000000000000000]               
	uint8_t                                            bNewData;                                      // 0x0038 (0x0001) [0x0000000000000000]               
};

// ScriptStruct Engine.Actor.AnimSlotDesc
// 0x000C
struct FAnimSlotDesc
{
	struct FName                                       SlotName;                                      // 0x0000 (0x0008) [0x0000000000100000]               
	int32_t                                            NumChannels;                                   // 0x0008 (0x0004) [0x0000000000100000]               
};

// ScriptStruct Engine.Actor.TimerData
// 0x0020
struct FTimerData
{
	uint32_t                                           bLoop : 1;                                     // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bPaused : 1;                                   // 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	struct FName                                       FuncName;                                      // 0x0004 (0x0008) [0x0000000000000000]               
	float                                              Rate;                                          // 0x000C (0x0004) [0x0000000000000000]               
	float                                              Count;                                         // 0x0010 (0x0004) [0x0000000000000000]               
	float                                              TimerTimeDilation;                             // 0x0014 (0x0004) [0x0000000000000000]               
	class UObject*                                     TimerObj;                                      // 0x0018 (0x0008) [0x0000000000000000]               
};

// ScriptStruct Engine.Actor.TraceHitInfo
// 0x0028
struct FTraceHitInfo
{
	class UMaterial*                                   Material;                                      // 0x0000 (0x0008) [0x0000000000100000]               
	class UPhysicalMaterial*                           PhysMaterial;                                  // 0x0008 (0x0008) [0x0000000000100000]               
	int32_t                                            Item;                                          // 0x0010 (0x0004) [0x0000000000100000]               
	int32_t                                            LevelIndex;                                    // 0x0014 (0x0004) [0x0000000000100000]               
	struct FName                                       BoneName;                                      // 0x0018 (0x0008) [0x0000000000100000]               
	class UPrimitiveComponent*                         HitComponent;                                  // 0x0020 (0x0008) [0x0000000004180008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
};

// ScriptStruct Engine.Actor.ImpactInfo
// 0x006C
struct FImpactInfo
{
	class AActor*                                      HitActor;                                      // 0x0000 (0x0008) [0x0000000000100000]               
	struct FVector                                     HitLocation;                                   // 0x0008 (0x000C) [0x0000000000100000]               
	struct FVector                                     HitNormal;                                     // 0x0014 (0x000C) [0x0000000000100000]               
	struct FVector                                     RayDir;                                        // 0x0020 (0x000C) [0x0000000000100000]               
	struct FVector                                     StartTrace;                                    // 0x002C (0x000C) [0x0000000000100000]               
	struct FTraceHitInfo                               HitInfo;                                       // 0x0038 (0x0028) [0x0000000000180000] (CPF_Component)
	struct FVector                                     EndTrace;                                      // 0x0060 (0x000C) [0x0000000000100000]               
};

// ScriptStruct Engine.Actor.AnimSlotInfo
// 0x0018
struct FAnimSlotInfo
{
	struct FName                                       SlotName;                                      // 0x0000 (0x0008) [0x0000000000100000]               
	class TArray<float>                                ChannelWeights;                                // 0x0008 (0x0010) [0x0000000000500000] (CPF_NeedCtorLink)
};

// ScriptStruct Engine.Actor.RigidBodyContactInfo
// 0x0048
struct FRigidBodyContactInfo
{
	struct FVector                                     ContactPosition;                               // 0x0000 (0x000C) [0x0000000000000000]               
	struct FVector                                     ContactNormal;                                 // 0x000C (0x000C) [0x0000000000000000]               
	float                                              ContactPenetration;                            // 0x0018 (0x0004) [0x0000000000000000]               
	struct FVector                                     ContactVelocity[0x2];                          // 0x001C (0x0018) [0x0000000000000000]               
	class UPhysicalMaterial*                           PhysMaterial[0x2];                             // 0x0038 (0x0010) [0x0000000000000000]               
};

// ScriptStruct Engine.Actor.CollisionImpactData
// 0x0028
struct FCollisionImpactData
{
	class TArray<struct FRigidBodyContactInfo>         ContactInfos;                                  // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FVector                                     TotalNormalForceVector;                        // 0x0010 (0x000C) [0x0000000000000000]               
	struct FVector                                     TotalFrictionForceVector;                      // 0x001C (0x000C) [0x0000000000000000]               
};

// ScriptStruct Engine.Actor.ActorReference
// 0x0018
struct FActorReference
{
	class AActor*                                      Actor;                                         // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FGuid                                       Guid;                                          // 0x0008 (0x0010) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
};

// ScriptStruct Engine.Actor.NavReference
// 0x0018
struct FNavReference
{
	class ANavigationPoint*                            Nav;                                           // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FGuid                                       Guid;                                          // 0x0008 (0x0010) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
};

// ScriptStruct Engine.Actor.BasedPosition
// 0x0038
struct FBasedPosition
{
	class AActor*                                      Base;                                          // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     Position;                                      // 0x0008 (0x000C) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     CachedBaseLocation;                            // 0x0014 (0x000C) [0x0000000000000000]               
	struct FRotator                                    CachedBaseRotation;                            // 0x0020 (0x000C) [0x0000000000000000]               
	struct FVector                                     CachedTransPosition;                           // 0x002C (0x000C) [0x0000000000000000]               
};

// ScriptStruct Engine.Actor.SkeletalThrottleData
// 0x0011
struct FSkeletalThrottleData
{
	uint32_t                                           bThrottled : 1;                                // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bForceUpdate : 1;                              // 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	float                                              LastCheck;                                     // 0x0004 (0x0004) [0x0000000000000000]               
	float                                              MissedTime;                                    // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              LastAddedTime;                                 // 0x000C (0x0004) [0x0000000000000000]               
	uint8_t                                            Type;                                          // 0x0010 (0x0001) [0x0000000000000000]               
};

// ScriptStruct Engine.AkEvent.AkPlayingInfo
// 0x000C
struct FAkPlayingInfo
{
	class UAkComponent*                                SourceComponent;                               // 0x0000 (0x0008) [0x0000000004082008] (CPF_ExportObject | CPF_Transient | CPF_Component | CPF_EditInline)
	int32_t                                            AkPlayingId;                                   // 0x0008 (0x0004) [0x0000000000002000] (CPF_Transient)
};

// ScriptStruct Engine.PawnAllegiance.OpinionData
// 0x0010
struct FOpinionData
{
	uint8_t                                            Opinion;                                       // 0x0000 (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class UPawnAllegiance*                             Allegiance;                                    // 0x0008 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct Engine.Info.KeyValuePair
// 0x0020
struct FKeyValuePair
{
	class FString                                      Key;                                           // 0x0000 (0x0010) [0x0000000000500001] (CPF_Edit | CPF_NeedCtorLink)
	class FString                                      Value;                                         // 0x0010 (0x0010) [0x0000000000500001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct Engine.Info.PlayerResponseLine
// 0x0038
struct FPlayerResponseLine
{
	int32_t                                            PlayerNum;                                     // 0x0000 (0x0004) [0x0000000000100001] (CPF_Edit)    
	int32_t                                            PlayerID;                                      // 0x0004 (0x0004) [0x0000000000100001] (CPF_Edit)    
	class FString                                      PlayerName;                                    // 0x0008 (0x0010) [0x0000000000500001] (CPF_Edit | CPF_NeedCtorLink)
	int32_t                                            Ping;                                          // 0x0018 (0x0004) [0x0000000000100001] (CPF_Edit)    
	int32_t                                            Score;                                         // 0x001C (0x0004) [0x0000000000100001] (CPF_Edit)    
	int32_t                                            StatsID;                                       // 0x0020 (0x0004) [0x0000000000100001] (CPF_Edit)    
	class TArray<struct FKeyValuePair>                 PlayerInfo;                                    // 0x0028 (0x0010) [0x0000000000500001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct Engine.Info.ServerResponseLine
// 0x0080
struct FServerResponseLine
{
	int32_t                                            ServerID;                                      // 0x0000 (0x0004) [0x0000000000100001] (CPF_Edit)    
	class FString                                      IP;                                            // 0x0008 (0x0010) [0x0000000000500001] (CPF_Edit | CPF_NeedCtorLink)
	int32_t                                            Port;                                          // 0x0018 (0x0004) [0x0000000000100001] (CPF_Edit)    
	int32_t                                            QueryPort;                                     // 0x001C (0x0004) [0x0000000000100001] (CPF_Edit)    
	class FString                                      ServerName;                                    // 0x0020 (0x0010) [0x0000000000500001] (CPF_Edit | CPF_NeedCtorLink)
	class FString                                      MapName;                                       // 0x0030 (0x0010) [0x0000000000500001] (CPF_Edit | CPF_NeedCtorLink)
	class FString                                      GameType;                                      // 0x0040 (0x0010) [0x0000000000500001] (CPF_Edit | CPF_NeedCtorLink)
	int32_t                                            CurrentPlayers;                                // 0x0050 (0x0004) [0x0000000000100001] (CPF_Edit)    
	int32_t                                            MaxPlayers;                                    // 0x0054 (0x0004) [0x0000000000100001] (CPF_Edit)    
	int32_t                                            Ping;                                          // 0x0058 (0x0004) [0x0000000000100001] (CPF_Edit)    
	class TArray<struct FKeyValuePair>                 ServerInfo;                                    // 0x0060 (0x0010) [0x0000000000500001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<struct FPlayerResponseLine>           PlayerInfo;                                    // 0x0070 (0x0010) [0x0000000000500001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct Engine.OnlineSubsystem.UniqueNetId
// 0x0014
struct FUniqueNetId
{
	uint8_t                                            RawId[0x10];                                   // 0x0000 (0x0010) [0x0000000000000000]               
	uint32_t                                           bHasValue : 1;                                 // 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct Engine.OnlineSubsystem.OnlineTitleFileHeader
// 0x0040
struct FOnlineTitleFileHeader
{
	int32_t                                            FileVersion;                                   // 0x0000 (0x0004) [0x0000000000000000]               
	class FString                                      BuildTimestamp;                                // 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      BuildAuthor;                                   // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      BuildMachineName;                              // 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            ChangeListNum;                                 // 0x0038 (0x0004) [0x0000000000000000]               
	int32_t                                            RevisionNum;                                   // 0x003C (0x0004) [0x0000000000000000]               
};

// ScriptStruct Engine.OnlineSubsystem.FeedEntity
// 0x0028
struct FFeedEntity
{
	class FString                                      Meta;                                          // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint8_t                                            Type;                                          // 0x0010 (0x0001) [0x0000000000000000]               
	class FString                                      AspectRatio;                                   // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct Engine.OnlineSubsystem.FeedStoryRequestData
// 0x0104
struct FFeedStoryRequestData
{
	class FString                                      Caption;                                       // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FFeedEntity>                   Targets;                                       // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      StoryComment;                                  // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      CaptionTemplate;                               // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FCaptionComponent>             CaptionComponents;                             // 0x0040 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      StoryId;                                       // 0x0050 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      StoryType;                                     // 0x0060 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            Subtype;                                       // 0x0070 (0x0004) [0x0000000000000000]               
	struct FFeedEntity                                 Source;                                        // 0x0078 (0x0028) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      SmallImageUrl;                                 // 0x00A0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      SmallImageAspectRatio;                         // 0x00B0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      LargeImageUrl;                                 // 0x00C0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Date;                                          // 0x00D0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            Relevancy;                                     // 0x00E0 (0x0004) [0x0000000000000000]               
	int32_t                                            CommentCount;                                  // 0x00E4 (0x0004) [0x0000000000000000]               
	int32_t                                            LikeCount;                                     // 0x00E8 (0x0004) [0x0000000000000000]               
	class FString                                      TitleId;                                       // 0x00F0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           bLiked : 1;                                    // 0x0100 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bReshareable : 1;                              // 0x0100 (0x0004) [0x0000000000000000] [0x00000002] 
};

// ScriptStruct Engine.OnlineSubsystem.CaptionComponent
// 0x0020
struct FCaptionComponent
{
	class FString                                      Key;                                           // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Value;                                         // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct Engine.OnlineSubsystem.FeedCaption
// 0x0020
struct FFeedCaption
{
	class FString                                      LanguageCode;                                  // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      CaptionString;                                 // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct Engine.OnlineSubsystem.OnlineRegistrant
// 0x0014
struct FOnlineRegistrant
{
	struct FUniqueNetId                                PlayerNetId;                                   // 0x0000 (0x0014) [0x0000000000000002] (CPF_Const)   
};

// ScriptStruct Engine.OnlineSubsystem.OnlineEntitlement
// 0x0018
struct FOnlineEntitlement
{
	class FString                                      EntitlementId;                                 // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           bConsumable : 1;                               // 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            ConsumableBalance;                             // 0x0014 (0x0004) [0x0000000000000000]               
};

// ScriptStruct Engine.OnlineSubsystem.FriendsQuery
// 0x0018
struct FFriendsQuery
{
	struct FUniqueNetId                                UniqueId;                                      // 0x0000 (0x0014) [0x0000000000000000]               
	uint32_t                                           bIsFriend : 1;                                 // 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct Engine.OnlineSubsystem.PlatformSessionData
// 0x0084
struct FPlatformSessionData
{
	uint8_t                                            RawData[0x80];                                 // 0x0000 (0x0080) [0x0000000000000000]               
	uint32_t                                           bHasValue : 1;                                 // 0x0080 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct Engine.OnlineSubsystem.PlatformUserId
// 0x0008
struct FPlatformUserId
{
	uint8_t                                            RawId[0x4];                                    // 0x0000 (0x0004) [0x0000000000000000]               
	uint32_t                                           bHasValue : 1;                                 // 0x0004 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct Engine.OnlineSubsystem.OnlineFriend
// 0x0058
struct FOnlineFriend
{
	struct FUniqueNetId                                UniqueId;                                      // 0x0000 (0x0014) [0x0000000000000002] (CPF_Const)   
	struct FQWord                                      SessionId;                                     // 0x0018 (0x0008) [0x0000000000000002] (CPF_Const)   
	class FString                                      SessionInfo;                                   // 0x0020 (0x0010) [0x0000000000400002] (CPF_Const | CPF_NeedCtorLink)
	class FString                                      NickName;                                      // 0x0030 (0x0010) [0x0000000000400002] (CPF_Const | CPF_NeedCtorLink)
	class FString                                      PresenceInfo;                                  // 0x0040 (0x0010) [0x0000000000400002] (CPF_Const | CPF_NeedCtorLink)
	uint8_t                                            FriendState;                                   // 0x0050 (0x0001) [0x0000000000000002] (CPF_Const)   
	uint32_t                                           bIsOnline : 1;                                 // 0x0054 (0x0004) [0x0000000000000002] [0x00000001] (CPF_Const)
	uint32_t                                           bIsPlaying : 1;                                // 0x0054 (0x0004) [0x0000000000000002] [0x00000002] (CPF_Const)
	uint32_t                                           bIsPlayingThisGame : 1;                        // 0x0054 (0x0004) [0x0000000000000002] [0x00000004] (CPF_Const)
	uint32_t                                           bIsJoinable : 1;                               // 0x0054 (0x0004) [0x0000000000000002] [0x00000008] (CPF_Const)
	uint32_t                                           bHaveInvited : 1;                              // 0x0054 (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           bHasInvitedYou : 1;                            // 0x0054 (0x0004) [0x0000000000000002] [0x00000020] (CPF_Const)
	uint32_t                                           bHaveRequested : 1;                            // 0x0054 (0x0004) [0x0000000000000002] [0x00000040] (CPF_Const)
	uint32_t                                           bHasRequestedYou : 1;                          // 0x0054 (0x0004) [0x0000000000000002] [0x00000080] (CPF_Const)
};

// ScriptStruct Engine.OnlineSubsystem.AppIdLicenseInfo
// 0x0014
struct FAppIdLicenseInfo
{
	class FString                                      AppID;                                         // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            LicenseMask;                                   // 0x0010 (0x0004) [0x0000000000000000]               
};

// ScriptStruct Engine.OnlineSubsystem.TOCInfo
// 0x0030
struct FTOCInfo
{
	class FString                                      TOC;                                           // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      RootPath;                                      // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Path;                                          // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct Engine.OnlineSubsystem.OnlineContent
// 0x00A0
struct FOnlineContent
{
	struct FPlatformUserId                             UserId;                                        // 0x0000 (0x0008) [0x0000000000000000]               
	uint32_t                                           bIsCorrupt : 1;                                // 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            LicenseMask;                                   // 0x000C (0x0004) [0x0000000000000000]               
	class FString                                      FriendlyName;                                  // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Filename;                                      // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      ContentPath;                                   // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<class FString>                        ContentPackages;                               // 0x0040 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<class FString>                        ContentFiles;                                  // 0x0050 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FAppIdLicenseInfo>             CachedAppIdInfo;                               // 0x0060 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FTOCInfo                                    TOCInfo;                                       // 0x0070 (0x0030) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct Engine.OnlineSubsystem.OnlineContentNameInfo
// 0x0024
struct FOnlineContentNameInfo
{
	class FString                                      ContentName;                                   // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            EngineVersion;                                 // 0x0010 (0x0004) [0x0000000000000000]               
	struct FGuid                                       CookedVersionID;                               // 0x0014 (0x0010) [0x0000000000000000]               
};

// ScriptStruct Engine.OnlineSubsystem.NamedOnlineContent
// 0x0029 (0x00A0 - 0x00C9)
struct FNamedOnlineContent : FOnlineContent
{
	struct FOnlineContentNameInfo                      NameInfo;                                      // 0x00A0 (0x0028) [0x0000000000400000] (CPF_NeedCtorLink)
	uint8_t                                            NamedContentType;                              // 0x00C8 (0x0001) [0x0000000000000000]               
};

// ScriptStruct Engine.OnlineSubsystem.CompatibilityOnlineContent
// 0x00E8
struct FCompatibilityOnlineContent
{
	int32_t                                            VersionNumber;                                 // 0x0000 (0x0004) [0x0000000000000000]               
	struct FNamedOnlineContent                         Container;                                     // 0x0008 (0x00D0) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FNamedOnlineContent>           Content;                                       // 0x00D8 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct Engine.OnlineSubsystem.MarketplaceContent
// 0x0040
struct FMarketplaceContent
{
	class FString                                      OfferId;                                       // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      OfferName;                                     // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      OfferDescription;                              // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      PriceText;                                     // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct Engine.OnlineSubsystem.OnlinePlayerScore
// 0x001C
struct FOnlinePlayerScore
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0014) [0x0000000000000000]               
	int32_t                                            TeamID;                                        // 0x0014 (0x0004) [0x0000000000000000]               
	int32_t                                            Score;                                         // 0x0018 (0x0004) [0x0000000000000000]               
};

// ScriptStruct Engine.OnlineSubsystem.OnlineFlag
// 0x0010
struct FOnlineFlag
{
	uint8_t                                            Value;                                         // 0x0000 (0x0001) [0x0000000000000000]               
	uint8_t                                            Raised;                                        // 0x0001 (0x0001) [0x0000000000000000]               
	uint8_t                                            Lowered;                                       // 0x0002 (0x0001) [0x0000000000000000]               
	uint8_t                                            Padding;                                       // 0x0003 (0x0001) [0x0000000000000000]               
	float                                              RaisedTime;                                    // 0x0004 (0x0004) [0x0000000000000000]               
	float                                              LoweredTime;                                   // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              Duration;                                      // 0x000C (0x0004) [0x0000000000000000]               
};

// ScriptStruct Engine.OnlineSubsystem.LocalTalker
// 0x001C
struct FLocalTalker
{
	struct FPlatformUserId                             UserId;                                        // 0x0000 (0x0008) [0x0000000000000000]               
	uint32_t                                           bHasVoice : 1;                                 // 0x0008 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bHasNetworkedVoice : 1;                        // 0x0008 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bWasTalking : 1;                               // 0x0008 (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bIsTalking : 1;                                // 0x0008 (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bIsRegistered : 1;                             // 0x0008 (0x0004) [0x0000000000000000] [0x00000010] 
	struct FOnlineFlag                                 TalkingFlag;                                   // 0x000C (0x0010) [0x0000000000000000]               
};

// ScriptStruct Engine.OnlineSubsystem.RemoteTalker
// 0x0018
struct FRemoteTalker
{
	struct FUniqueNetId                                TalkerId;                                      // 0x0000 (0x0014) [0x0000000000000000]               
	uint32_t                                           bIsRegistered : 1;                             // 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct Engine.OnlineSubsystem.NamedSession
// 0x0040
struct FNamedSession
{
	struct FName                                       SessionName;                                   // 0x0000 (0x0008) [0x0000000000000000]               
	struct FPlatformUserId                             OwningUserId;                                  // 0x0008 (0x0008) [0x0000000000000000]               
	struct FPointer                                    SessionInfo;                                   // 0x0010 (0x0008) [0x0000000000003002] (CPF_Const | CPF_Native | CPF_Transient)
	class UOnlineGameSettings*                         GameSettings;                                  // 0x0018 (0x0008) [0x0000000000000000]               
	class TArray<struct FOnlineRegistrant>             Registrants;                                   // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FUniqueNetId>                  PlayersMet;                                    // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct Engine.OnlineSubsystem.AchievementDetails
// 0x004C
struct FAchievementDetails
{
	int32_t                                            Id;                                            // 0x0000 (0x0004) [0x0000000000000002] (CPF_Const)   
	class FString                                      AchievementName;                               // 0x0008 (0x0010) [0x0000000000400002] (CPF_Const | CPF_NeedCtorLink)
	class FString                                      Description;                                   // 0x0018 (0x0010) [0x0000000000400002] (CPF_Const | CPF_NeedCtorLink)
	class FString                                      HowTo;                                         // 0x0028 (0x0010) [0x0000000000400002] (CPF_Const | CPF_NeedCtorLink)
	class USurface*                                    Image;                                         // 0x0038 (0x0008) [0x0000000000000000]               
	uint8_t                                            MonthEarned;                                   // 0x0040 (0x0001) [0x0000000000000002] (CPF_Const)   
	uint8_t                                            DayEarned;                                     // 0x0041 (0x0001) [0x0000000000000002] (CPF_Const)   
	uint8_t                                            YearEarned;                                    // 0x0042 (0x0001) [0x0000000000000002] (CPF_Const)   
	uint8_t                                            DayOfWeekEarned;                               // 0x0043 (0x0001) [0x0000000000000002] (CPF_Const)   
	int32_t                                            GamerPoints;                                   // 0x0044 (0x0004) [0x0000000000000002] (CPF_Const)   
	uint32_t                                           bIsSecret : 1;                                 // 0x0048 (0x0004) [0x0000000000000002] [0x00000001] (CPF_Const)
	uint32_t                                           bWasAchievedOnline : 1;                        // 0x0048 (0x0004) [0x0000000000000002] [0x00000002] (CPF_Const)
	uint32_t                                           bWasAchievedOffline : 1;                       // 0x0048 (0x0004) [0x0000000000000002] [0x00000004] (CPF_Const)
};

// ScriptStruct Engine.OnlineSubsystem.OnlinePartyMember
// 0x0034
struct FOnlinePartyMember
{
	struct FUniqueNetId                                UniqueId;                                      // 0x0000 (0x0014) [0x0000000000000002] (CPF_Const)   
	class FString                                      NickName;                                      // 0x0018 (0x0010) [0x0000000000400002] (CPF_Const | CPF_NeedCtorLink)
	struct FPlatformUserId                             UserId;                                        // 0x0028 (0x0008) [0x0000000000000002] (CPF_Const)   
	uint32_t                                           bIsLocal : 1;                                  // 0x0030 (0x0004) [0x0000000000000002] [0x00000001] (CPF_Const)
	uint32_t                                           bIsPlayingThisGame : 1;                        // 0x0030 (0x0004) [0x0000000000000002] [0x00000002] (CPF_Const)
};

// ScriptStruct Engine.OnlineSubsystem.FeedAction
// 0x0048
struct FFeedAction
{
	uint8_t                                            Type;                                          // 0x0000 (0x0001) [0x0000000000000000]               
	class FString                                      Uri;                                           // 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      StartArguments;                                // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FFeedCaption>                  ButtonCaptions;                                // 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      ImageUrl;                                      // 0x0038 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct Engine.OnlineSubsystem.FeedStoryData
// 0x0058
struct FFeedStoryData
{
	class TArray<struct FFeedCaption>                  Captions;                                      // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FFeedCaption>                  CondensedCaptions;                             // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      StoryComment;                                  // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FFeedAction>                   Actions;                                       // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            Subtype;                                       // 0x0040 (0x0004) [0x0000000000000000]               
	class TArray<struct FFeedEntity>                   Targets;                                       // 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct Engine.OnlineSubsystem.OnlinePlayerDisplayData
// 0x0038
struct FOnlinePlayerDisplayData
{
	struct FUniqueNetId                                PlayerID;                                      // 0x0000 (0x0014) [0x0000000000000000]               
	class FString                                      DisplayName;                                   // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      ProfileImageURL;                               // 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct Engine.PrimitiveComponent.RBCollisionChannelContainer
// 0x0004
struct FRBCollisionChannelContainer
{
	uint32_t                                           Default : 1;                                   // 0x0000 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	uint32_t                                           Nothing : 1;                                   // 0x0000 (0x0004) [0x0000000000000002] [0x00000002] (CPF_Const)
	uint32_t                                           Pawn : 1;                                      // 0x0000 (0x0004) [0x0000000000000003] [0x00000004] (CPF_Edit | CPF_Const)
	uint32_t                                           Vehicle : 1;                                   // 0x0000 (0x0004) [0x0000000000000003] [0x00000008] (CPF_Edit | CPF_Const)
	uint32_t                                           Water : 1;                                     // 0x0000 (0x0004) [0x0000000000000003] [0x00000010] (CPF_Edit | CPF_Const)
	uint32_t                                           GameplayPhysics : 1;                           // 0x0000 (0x0004) [0x0000000000000003] [0x00000020] (CPF_Edit | CPF_Const)
	uint32_t                                           EffectPhysics : 1;                             // 0x0000 (0x0004) [0x0000000000000003] [0x00000040] (CPF_Edit | CPF_Const)
	uint32_t                                           Untitled1 : 1;                                 // 0x0000 (0x0004) [0x0000000000000003] [0x00000080] (CPF_Edit | CPF_Const)
	uint32_t                                           Untitled2 : 1;                                 // 0x0000 (0x0004) [0x0000000000000003] [0x00000100] (CPF_Edit | CPF_Const)
	uint32_t                                           TossedItems : 1;                               // 0x0000 (0x0004) [0x0000000000000003] [0x00000200] (CPF_Edit | CPF_Const)
	uint32_t                                           TossedItemsPlayerVehicle : 1;                  // 0x0000 (0x0004) [0x0000000000000003] [0x00000400] (CPF_Edit | CPF_Const)
	uint32_t                                           Cloth : 1;                                     // 0x0000 (0x0004) [0x0000000000000003] [0x00000800] (CPF_Edit | CPF_Const)
	uint32_t                                           FluidDrain : 1;                                // 0x0000 (0x0004) [0x0000000000000003] [0x00001000] (CPF_Edit | CPF_Const)
	uint32_t                                           SoftBody : 1;                                  // 0x0000 (0x0004) [0x0000000000000003] [0x00002000] (CPF_Edit | CPF_Const)
	uint32_t                                           FracturedMeshPart : 1;                         // 0x0000 (0x0004) [0x0000000000000003] [0x00004000] (CPF_Edit | CPF_Const)
	uint32_t                                           BlockingVolume : 1;                            // 0x0000 (0x0004) [0x0000000000000003] [0x00008000] (CPF_Edit | CPF_Const)
	uint32_t                                           DeadPawn : 1;                                  // 0x0000 (0x0004) [0x0000000000000003] [0x00010000] (CPF_Edit | CPF_Const)
	uint32_t                                           Clothing : 1;                                  // 0x0000 (0x0004) [0x0000000000000003] [0x00020000] (CPF_Edit | CPF_Const)
	uint32_t                                           ClothingCollision : 1;                         // 0x0000 (0x0004) [0x0000000000000003] [0x00040000] (CPF_Edit | CPF_Const)
	uint32_t                                           TossedItemsEnemyVehicle : 1;                   // 0x0000 (0x0004) [0x0000000000000003] [0x00080000] (CPF_Edit | CPF_Const)
	uint32_t                                           PlayerVehicle : 1;                             // 0x0000 (0x0004) [0x0000000000000003] [0x00100000] (CPF_Edit | CPF_Const)
	uint32_t                                           EnemyVehicle : 1;                              // 0x0000 (0x0004) [0x0000000000000003] [0x00200000] (CPF_Edit | CPF_Const)
	uint32_t                                           PlayerVehicleEnemyVehicle : 1;                 // 0x0000 (0x0004) [0x0000000000000003] [0x00400000] (CPF_Edit | CPF_Const)
	uint32_t                                           TossedItemsPlayerVehicleEnemyVehicle : 1;      // 0x0000 (0x0004) [0x0000000000000003] [0x00800000] (CPF_Edit | CPF_Const)
	uint32_t                                           WillowPickup : 1;                              // 0x0000 (0x0004) [0x0000000000000003] [0x01000000] (CPF_Edit | CPF_Const)
};

// ScriptStruct Engine.PrimitiveComponent.OctreeArray_Mirror
// 0x0050
struct FOctreeArray_Mirror
{
	struct FPointer                                    InlineData[0x8];                               // 0x0000 (0x0040) [0x0000000000001002] (CPF_Const | CPF_Native)
	struct FPointer                                    Data;                                          // 0x0040 (0x0008) [0x0000000000001002] (CPF_Const | CPF_Native)
	int32_t                                            ArrayNum;                                      // 0x0048 (0x0004) [0x0000000000001002] (CPF_Const | CPF_Native)
	int32_t                                            ArrayMax;                                      // 0x004C (0x0004) [0x0000000000001002] (CPF_Const | CPF_Native)
};

// ScriptStruct Engine.PrimitiveComponent.MaterialViewRelevance
// 0x0004
struct FMaterialViewRelevance
{
	uint32_t                                           bOpaque : 1;                                   // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bTranslucent : 1;                              // 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bDistortion : 1;                               // 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bOneLayerDistortionRelevance : 1;              // 0x0000 (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bLit : 1;                                      // 0x0000 (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           bUsesSceneColor : 1;                           // 0x0000 (0x0004) [0x0000000000000000] [0x00000020] 
};

// ScriptStruct Engine.LightComponent.LightingChannelContainer
// 0x0004
struct FLightingChannelContainer
{
	uint32_t                                           bInitialized : 1;                              // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           BSP : 1;                                       // 0x0000 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           Static : 1;                                    // 0x0000 (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           Dynamic : 1;                                   // 0x0000 (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	uint32_t                                           CompositeDynamic : 1;                          // 0x0000 (0x0004) [0x0000000000000001] [0x00000010] (CPF_Edit)
	uint32_t                                           Skybox : 1;                                    // 0x0000 (0x0004) [0x0000000000000001] [0x00000020] (CPF_Edit)
	uint32_t                                           Unnamed : 1;                                   // 0x0000 (0x0004) [0x0000000000000001] [0x00000040] (CPF_Edit)
	uint32_t                                           Unnamed01 : 1;                                 // 0x0000 (0x0004) [0x0000000000000001] [0x00000080] (CPF_Edit)
	uint32_t                                           Unnamed02 : 1;                                 // 0x0000 (0x0004) [0x0000000000000001] [0x00000100] (CPF_Edit)
	uint32_t                                           Unnamed03 : 1;                                 // 0x0000 (0x0004) [0x0000000000000001] [0x00000200] (CPF_Edit)
	uint32_t                                           Unnamed04 : 1;                                 // 0x0000 (0x0004) [0x0000000000000001] [0x00000400] (CPF_Edit)
	uint32_t                                           Unnamed05 : 1;                                 // 0x0000 (0x0004) [0x0000000000000001] [0x00000800] (CPF_Edit)
	uint32_t                                           Cinematic : 1;                                 // 0x0000 (0x0004) [0x0000000000000001] [0x00001000] (CPF_Edit)
	uint32_t                                           Cinematic01 : 1;                               // 0x0000 (0x0004) [0x0000000000000001] [0x00002000] (CPF_Edit)
	uint32_t                                           Cinematic02 : 1;                               // 0x0000 (0x0004) [0x0000000000000001] [0x00004000] (CPF_Edit)
	uint32_t                                           Cinematic03 : 1;                               // 0x0000 (0x0004) [0x0000000000000001] [0x00008000] (CPF_Edit)
	uint32_t                                           Cinematic04 : 1;                               // 0x0000 (0x0004) [0x0000000000000001] [0x00010000] (CPF_Edit)
	uint32_t                                           Cinematic05 : 1;                               // 0x0000 (0x0004) [0x0000000000000001] [0x00020000] (CPF_Edit)
	uint32_t                                           Cinematic06 : 1;                               // 0x0000 (0x0004) [0x0000000000000001] [0x00040000] (CPF_Edit)
	uint32_t                                           Cinematic07 : 1;                               // 0x0000 (0x0004) [0x0000000000000001] [0x00080000] (CPF_Edit)
	uint32_t                                           Cinematic08 : 1;                               // 0x0000 (0x0004) [0x0000000000000001] [0x00100000] (CPF_Edit)
	uint32_t                                           Cinematic09 : 1;                               // 0x0000 (0x0004) [0x0000000000000001] [0x00200000] (CPF_Edit)
	uint32_t                                           Gameplay : 1;                                  // 0x0000 (0x0004) [0x0000000000000001] [0x00400000] (CPF_Edit)
	uint32_t                                           Gameplay01 : 1;                                // 0x0000 (0x0004) [0x0000000000000001] [0x00800000] (CPF_Edit)
	uint32_t                                           Gameplay02 : 1;                                // 0x0000 (0x0004) [0x0000000000000001] [0x01000000] (CPF_Edit)
	uint32_t                                           Gameplay03 : 1;                                // 0x0000 (0x0004) [0x0000000000000001] [0x02000000] (CPF_Edit)
	uint32_t                                           Crowd : 1;                                     // 0x0000 (0x0004) [0x0000000000000001] [0x04000000] (CPF_Edit)
	uint32_t                                           PhysX : 1;                                     // 0x0000 (0x0004) [0x0000000000000001] [0x08000000] (CPF_Edit)
};

// ScriptStruct Engine.Controller.VisiblePortalInfo
// 0x0010
struct FVisiblePortalInfo
{
	class AActor*                                      Source;                                        // 0x0000 (0x0008) [0x0000000000000000]               
	class AActor*                                      Destination;                                   // 0x0008 (0x0008) [0x0000000000000000]               
};

// ScriptStruct Engine.IInstanceData.InstanceDataCore2
// 0x003C
struct FInstanceDataCore2
{
	struct FVector                                     Vector;                                        // 0x0000 (0x000C) [0x0000000000000001] (CPF_Edit)    
	class UObject* Object;                                        // 0x0010 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UObject* InteractIcon;                                  // 0x0018 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UObject* SecondaryInteractIcon;                         // 0x0020 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FName                                       Name;                                          // 0x0028 (0x0008) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            Int;                                           // 0x0030 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                            Type;                                          // 0x0034 (0x0001) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                            CollisionType;                                 // 0x0035 (0x0001) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bDeleteByOwner : 1;                            // 0x0038 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bIsUsable : 1;                                 // 0x0038 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bIsSecondaryUsable : 1;                        // 0x0038 (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bIsSwitchChild : 1;                            // 0x0038 (0x0004) [0x0000000000000000] [0x00000008] 
};

// ScriptStruct Engine.IInstanceData.InstanceDataItem2
// 0x005D
struct FInstanceDataItem2
{
	struct FInstanceDataCore2                          Core;                                          // 0x0000 (0x0040) [0x0000000000000001] (CPF_Edit)    
	class FString                                      String;                                        // 0x0040 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	struct FPointer                                    SourceBodyComposition;                         // 0x0050 (0x0008) [0x0000000000001000] (CPF_Native)  
	int32_t                                            BodyCompositionIndex;                          // 0x0058 (0x0004) [0x0000000000000000]               
	uint8_t                                            ParentSlotUID;                                 // 0x005C (0x0001) [0x0000000000000000]               
};

// ScriptStruct Engine.IInstanceData.InstanceDataSet
// 0x0010
struct FInstanceDataSet
{
	class TArray<struct FInstanceDataUnion>            Data;                                          // 0x0000 (0x0010) [0x0000000020480001] (CPF_Edit | CPF_Component | CPF_NeedCtorLink | CPF_Deprecated)
};

// ScriptStruct Engine.IInstanceData.ComponentData
// 0x0030
struct FComponentData
{
	class UActorComponent* Component;                                     // 0x0000 (0x0008) [0x0000000004080009] (CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline)
	uint8_t                                            CollisionType;                                 // 0x0008 (0x0001) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bAttachToMesh : 1;                             // 0x000C (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bIsUsable : 1;                                 // 0x000C (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bIsSecondaryUsable : 1;                        // 0x000C (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	struct FName                                       MeshSocketName;                                // 0x0010 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UBaseHitRegionDefinition* HitRegionDefinition;                           // 0x0018 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UEngineInteractionIconDefinition* InteractIcon;                                  // 0x0020 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UEngineInteractionIconDefinition* SecondaryInteractIcon;                         // 0x0028 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct Engine.IInstanceData.InstanceDataUnion
// 0x0074
struct FInstanceDataUnion
{
	struct FName                                       Name;                                          // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                            Type;                                          // 0x0008 (0x0001) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                            Replication;                                   // 0x0009 (0x0001) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                            MaxSwitchValue;                                // 0x000A (0x0001) [0x0000000000000000]               
	uint8_t                                            BitsRequiredForMaxSwitchValue;                 // 0x000B (0x0001) [0x0000000000000000]               
	uint32_t                                           Bool : 1;                                      // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           DeleteByOwner : 1;                             // 0x000C (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	int32_t                                            Int;                                           // 0x0010 (0x0004) [0x0000000000000000]               
	float                                              Float;                                         // 0x0014 (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     Vector;                                        // 0x0018 (0x000C) [0x0000000000000000]               
	class UObject*                                     Object;                                        // 0x0028 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FComponentData                              ComponentData;                                 // 0x0030 (0x0030) [0x0000000000080001] (CPF_Edit | CPF_Component)
	class FString                                      String;                                        // 0x0060 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	int32_t                                            BodyCompositionIndex;                          // 0x0070 (0x0004) [0x0000000000000000]               
};

// ScriptStruct Engine.PlayerController.DebugTextInfo
// 0x0058
struct FDebugTextInfo
{
	class AActor*                                      SrcActor;                                      // 0x0000 (0x0008) [0x0000000000000000]               
	struct FVector                                     SrcActorOffset;                                // 0x0008 (0x000C) [0x0000000000000000]               
	struct FVector                                     SrcActorDesiredOffset;                         // 0x0014 (0x000C) [0x0000000000000000]               
	class FString                                      DebugText;                                     // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
