/*
#############################################################################################
# BattleBorn (1.0.0.0) SDK
# Generated with the CodeRedGenerator v1.0.3
# ========================================================================================= #
# File: Engine_parameters.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

/*
# ========================================================================================= #
# Parameters
# ========================================================================================= #
*/

// Function Engine.Actor.ClientDrawDebugLine
// [0xFFFF0000010205C0]  (iNative[14318])
struct AActor_execClientDrawDebugLine_Params
{
	struct FVector                                     Start;                                            		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     End;                                              		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            R;                                                		// 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            G;                                                		// 0x001C (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            B;                                                		// 0x0020 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           persistent : 1;                                   		// 0x0024 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	float                                              Lifetime;                                         		// 0x0028 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.GetActorSpriteComponent
// [0x00020400]  (iNative[23534])
struct AActor_execGetActorSpriteComponent_Params
{
	class USpriteComponent*                            ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000004000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline)
};

// Function Engine.Actor.SetSkelMeshDebugging
// [0x00022400]  (iNative[28976])
struct AActor_execSetSkelMeshDebugging_Params
{
	uint32_t                                           bNewDebugging : 1;                                		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function Engine.Actor.IsSkelMeshDebugging
// [0x00022400]  (iNative[24936])
struct AActor_execIsSkelMeshDebugging_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.IsWaterVolume
// [0x00020400]  (iNative[24956])
struct AActor_execIsWaterVolume_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.DamageResult_KilledNeutral
// [0x12020000] 
struct AActor_execDamageResult_KilledNeutral_Params
{
	class UObject*                                     KilledObject;                                     		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            DamageTags;                                       		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.DamageResult_KilledFriendly
// [0x12020000] 
struct AActor_execDamageResult_KilledFriendly_Params
{
	class UObject*                                     KilledObject;                                     		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            DamageTags;                                       		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.DamageResult_KilledEnemy
// [0x12020000] 
struct AActor_execDamageResult_KilledEnemy_Params
{
	class UObject*                                     KilledObject;                                     		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            DamageTags;                                       		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.DamageResult_DamagedNeutral
// [0x12020000] 
struct AActor_execDamageResult_DamagedNeutral_Params
{
	class UObject*                                     DamageTaker;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bWasCrit : 1;                                     		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	float                                              HealthDamage;                                     		// 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ShieldDamage;                                     		// 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            DamageTags;                                       		// 0x0014 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.DamageResult_DamagedFriendly
// [0x12020000] 
struct AActor_execDamageResult_DamagedFriendly_Params
{
	class UObject*                                     DamageTaker;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              DamageAmount;                                     		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            DamageTags;                                       		// 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.DamageResult_DamagedEnemy
// [0x12020000] 
struct AActor_execDamageResult_DamagedEnemy_Params
{
	class UObject*                                     DamageTaker;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bWasCrit : 1;                                     		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	float                                              HealthDamage;                                     		// 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ShieldDamage;                                     		// 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            DamageTags;                                       		// 0x0014 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.GetControllerResponsibleForDamage
// [0x00020400]  (iNative[23638])
struct AActor_execGetControllerResponsibleForDamage_Params
{
	class AController*                                 ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetInstigator
// [0x00020400]  (iNative[23752])
struct AActor_execGetInstigator_Params
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetInstigatorSelfDamageScale
// [0x00020400]  (iNative[23753])
struct AActor_execGetInstigatorSelfDamageScale_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetFireIntervalChanceModifier
// [0x00020400]  (iNative[23716])
struct AActor_execGetFireIntervalChanceModifier_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.WaitingForAttachmentBase
// [0x12020102] 
struct AActor_execWaitingForAttachmentBase_Params
{
};

// Function Engine.Actor.Behavior_ChangeScale3D
// [0x12020100] 
struct AActor_execBehavior_ChangeScale3D_Params
{
	struct FVector                                     InScale3D;                                        		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.Behavior_ChangeScale
// [0x12020100] 
struct AActor_execBehavior_ChangeScale_Params
{
	float                                              InScale;                                          		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.Behavior_ChangeVisibility
// [0x12020100] 
struct AActor_execBehavior_ChangeVisibility_Params
{
	uint32_t                                           bVisible : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function Engine.Actor.Behavior_ToggleVisibility
// [0x12020100] 
struct AActor_execBehavior_ToggleVisibility_Params
{
};

// Function Engine.Actor.Behavior_ChangeCollisionSize
// [0x12020100] 
struct AActor_execBehavior_ChangeCollisionSize_Params
{
	float                                              NewRadius;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              NewHeight;                                        		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.Behavior_ChangeCollision
// [0x12020100] 
struct AActor_execBehavior_ChangeCollision_Params
{
	uint8_t                                            NewCollisionType;                                 		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.GetDamageVector
// [0x12020000] 
struct AActor_execGetDamageVector_Params
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetRigidBodyMesh
// [0x12020000] 
struct AActor_execGetRigidBodyMesh_Params
{
	class UMeshComponent*                              ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000004000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline)
};

// Function Engine.Actor.ClientConsoleCommand
// [0xFFFF0000130201C0] 
struct AActor_execClientConsoleCommand_Params
{
	class FString                                      Command;                                          		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function Engine.Actor.Behavior_ClientConsoleCommand
// [0x12020000] 
struct AActor_execBehavior_ClientConsoleCommand_Params
{
	class FString                                      Command;                                          		// 0x0000 (0x0010) [0x0000000000400082] (CPF_Const | CPF_Parm | CPF_NeedCtorLink)
};

// Function Engine.Actor.Behavior_ConsoleCommand
// [0x12020000] 
struct AActor_execBehavior_ConsoleCommand_Params
{
	class FString                                      Command;                                          		// 0x0000 (0x0010) [0x0000000000400082] (CPF_Const | CPF_Parm | CPF_NeedCtorLink)
};

// Function Engine.Actor.Behavior_Destroy
// [0x12020100] 
struct AActor_execBehavior_Destroy_Params
{
};

// Function Engine.Actor.ClearResourcePoolReference
// [0x00422401]  (iNative[20619])
struct AActor_execClearResourcePoolReference_Params
{
	struct FResourcePoolReference                      PoolReference;                                    		// 0x0000 (0x0018) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Engine.Actor.GetResourcePoolCurrentValueOrDefault
// [0x00422401]  (iNative[23905])
struct AActor_execGetResourcePoolCurrentValueOrDefault_Params
{
	struct FResourcePoolReference                      PoolReference;                                    		// 0x0000 (0x0018) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              DefaultValue;                                     		// 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x001C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.IsResourcePoolValid
// [0x00422401]  (iNative[24930])
struct AActor_execIsResourcePoolValid_Params
{
	struct FResourcePoolReference                      PoolReference;                                    		// 0x0000 (0x0018) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.WorldBodyAttachComponent
// [0x00024401]  (iNative[30929])
struct AActor_execWorldBodyAttachComponent_Params
{
	class UActorComponent*                             Attachment;                                       		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	struct FVector                                     AttachmentRelativeLocation;                       		// 0x0008 (0x000C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FRotator                                    AttachmentRelativeRotation;                       		// 0x0014 (0x000C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FName                                       AttachmentPointName;                              		// 0x0020 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0028 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.WorldBodyAttachActor
// [0x00024401]  (iNative[30928])
struct AActor_execWorldBodyAttachActor_Params
{
	class AActor*                                      Attachment;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AttachmentRelativeLocation;                       		// 0x0008 (0x000C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FRotator                                    AttachmentRelativeRotation;                       		// 0x0014 (0x000C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FName                                       AttachmentPointName;                              		// 0x0020 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0028 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.WorldBodyAttachTo
// [0x00024401]  (iNative[30930])
struct AActor_execWorldBodyAttachTo_Params
{
	class UIWorldBody*                                 OtherWorldBody;                                   		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     AttachmentRelativeLocation;                       		// 0x0010 (0x000C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FRotator                                    AttachmentRelativeRotation;                       		// 0x001C (0x000C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FName                                       AttachmentPointName;                              		// 0x0028 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0030 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetWorldBodyFirstPersonAttachmentBase
// [0x00020401]  (iNative[24038])
struct AActor_execGetWorldBodyFirstPersonAttachmentBase_Params
{
	class UIWorldBody*                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetWorldBodyAttachmentBase
// [0x00020401]  (iNative[24033])
struct AActor_execGetWorldBodyAttachmentBase_Params
{
	class UIWorldBody*                                 ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetWorldBodyAttachmentBoneForComponent
// [0x00020401]  (iNative[24034])
struct AActor_execGetWorldBodyAttachmentBoneForComponent_Params
{
	class UActorComponent*                             AttachedComponent;                                		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	struct FName                                       ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetWorldBodyAttachmentLocationAndRotation
// [0x00420401]  (iNative[24036])
struct AActor_execGetWorldBodyAttachmentLocationAndRotation_Params
{
	struct FName                                       AttachmentPointName;                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     OutLocation;                                      		// 0x0008 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FRotator                                    OutRotation;                                      		// 0x0014 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetWorldBodyAttachmentRotation
// [0x00420401]  (iNative[24037])
struct AActor_execGetWorldBodyAttachmentRotation_Params
{
	struct FName                                       AttachmentPointName;                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FRotator                                    OutRotation;                                      		// 0x0008 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetWorldBodyAttachmentLocation
// [0x00420401]  (iNative[24035])
struct AActor_execGetWorldBodyAttachmentLocation_Params
{
	struct FName                                       AttachmentPointName;                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     OutLocation;                                      		// 0x0008 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetWorldBodyVelocity
// [0x00020401]  (iNative[24041])
struct AActor_execGetWorldBodyVelocity_Params
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetWorldBodyRotation
// [0x00020401]  (iNative[24040])
struct AActor_execGetWorldBodyRotation_Params
{
	struct FRotator                                    ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetWorldBodyLocation
// [0x00020401]  (iNative[24039])
struct AActor_execGetWorldBodyLocation_Params
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetSpawnOwner
// [0x12020000] 
struct AActor_execGetSpawnOwner_Params
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetActorMetrics
// [0x00020500]  (iNative[23532])
struct AActor_execGetActorMetrics_Params
{
	uint8_t                                            MetricsType;                                      		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.WillOverlap
// [0x00420401]  (iNative[30909])
struct AActor_execWillOverlap_Params
{
	struct FVector                                     PosA;                                             		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     VelA;                                             		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     PosB;                                             		// 0x0018 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     VelB;                                             		// 0x0024 (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              StepSize;                                         		// 0x0030 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Radius;                                           		// 0x0034 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Time;                                             		// 0x0038 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x003C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.ReplicationEnded
// [0x12020900] 
struct AActor_eventReplicationEnded_Params
{
};

// Function Engine.Actor.PostDemoRewind
// [0x12020900] 
struct AActor_eventPostDemoRewind_Params
{
};

// Function Engine.Actor.AnimTreeUpdated
// [0x12020900] 
struct AActor_eventAnimTreeUpdated_Params
{
	class USkeletalMeshComponent*                      SkelMesh;                                         		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function Engine.Actor.SupportsKismetModification
// [0x00420401]  (iNative[29678])
struct AActor_execSupportsKismetModification_Params
{
	class USequenceOp*                                 AskingOp;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class FString                                      Reason;                                           		// 0x0008 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.TrailsNotifyEnd
// [0x12020800] 
struct AActor_eventTrailsNotifyEnd_Params
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   		// 0x0000 (0x0008) [0x0000000000000082] (CPF_Const | CPF_Parm)
};

// Function Engine.Actor.TrailsNotifyTick
// [0x12020800] 
struct AActor_eventTrailsNotifyTick_Params
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   		// 0x0000 (0x0008) [0x0000000000000082] (CPF_Const | CPF_Parm)
};

// Function Engine.Actor.TrailsNotify
// [0x12020800] 
struct AActor_eventTrailsNotify_Params
{
	class UAnimNotify_Trails*                          AnimNotifyData;                                   		// 0x0000 (0x0008) [0x0000000000000082] (CPF_Const | CPF_Parm)
};

// Function Engine.Actor.CreateForceField
// [0x12020800] 
struct AActor_eventCreateForceField_Params
{
	class UAnimNotify_ForceField*                      AnimNotifyData;                                   		// 0x0000 (0x0008) [0x0000000000000082] (CPF_Const | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.PlayParticleEffect
// [0x12020800] 
struct AActor_eventPlayParticleEffect_Params
{
	class UAnimNotify_PlayParticleEffect*              AnimNotifyData;                                   		// 0x0000 (0x0008) [0x0000000000000082] (CPF_Const | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.IsInPersistentLevel
// [0x00024401]  (iNative[24889])
struct AActor_execIsInPersistentLevel_Params
{
	uint32_t                                           bIncludeLevelStreamingPersistent : 1;             		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.OnRigidBodySpringOverextension
// [0x12020900] 
struct AActor_eventOnRigidBodySpringOverextension_Params
{
	class URB_BodyInstance*                            BodyInstance;                                     		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.GetPackageGuid
// [0x00022401]  (iNative[23841])
struct AActor_execGetPackageGuid_Params
{
	struct FName                                       PackageName;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FGuid                                       ReturnValue;                                      		// 0x0008 (0x0010) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.PostInitAnimTree
// [0x12020800] 
struct AActor_eventPostInitAnimTree_Params
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function Engine.Actor.TraceTouch
// [0x12020800] 
struct AActor_eventTraceTouch_Params
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UComponent*                                  ComponentHit;                                     		// 0x0008 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	struct FVector                                     TouchLocation;                                    		// 0x0010 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     TouchNormal;                                      		// 0x001C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     End;                                              		// 0x0028 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Start;                                            		// 0x0034 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Extent;                                           		// 0x0040 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FQWord                                      TraceFlags;                                       		// 0x0050 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              TouchTime;                                        		// 0x0058 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.RootMotionExtracted
// [0x12420900] 
struct AActor_eventRootMotionExtracted_Params
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	struct FBoneAtom                                   ExtractedRootMotionDelta;                         		// 0x0010 (0x0020) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Engine.Actor.RootMotionProcessed
// [0x12020900] 
struct AActor_eventRootMotionProcessed_Params
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function Engine.Actor.RootMotionModeChanged
// [0x12020900] 
struct AActor_eventRootMotionModeChanged_Params
{
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function Engine.Actor.PostRenderFor
// [0x12020900] 
struct AActor_eventPostRenderFor_Params
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UCanvas*                                     Canvas;                                           		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraPosition;                                   		// 0x0010 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraDir;                                        		// 0x001C (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.NativePostRenderFor
// [0x00020500]  (iNative[26172])
struct AActor_execNativePostRenderFor_Params
{
	class APlayerController*                           PC;                                               		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UCanvas*                                     Canvas;                                           		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraPosition;                                   		// 0x0010 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     CameraDir;                                        		// 0x001C (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.SetHUDLocation
// [0x00020500]  (iNative[28843])
struct AActor_execSetHUDLocation_Params
{
	struct FVector                                     NewHUDLocation;                                   		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.OnRanOver
// [0x12020800] 
struct AActor_eventOnRanOver_Params
{
	class ASVehicle*                                   Vehicle;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UPrimitiveComponent*                         RunOverComponent;                                 		// 0x0008 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	int32_t                                            WheelIndex;                                       		// 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.RigidBodyCollision
// [0x12420800] 
struct AActor_eventRigidBodyCollision_Params
{
	class UPrimitiveComponent*                         HitComponent;                                     		// 0x0000 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	class UPrimitiveComponent*                         OtherComponent;                                   		// 0x0008 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	struct FCollisionImpactData                        RigidCollisionData;                               		// 0x0010 (0x0028) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	int32_t                                            ContactIndex;                                     		// 0x0038 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.InterpolationChanged
// [0x12020900] 
struct AActor_eventInterpolationChanged_Params
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.InterpolationFinished
// [0x12020900] 
struct AActor_eventInterpolationFinished_Params
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.InterpolationStarted
// [0x12020900] 
struct AActor_eventInterpolationStarted_Params
{
	class USeqAct_Interp*                              InterpAction;                                     		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UInterpGroupInst*                            GroupInst;                                        		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.SpawnedByKismet
// [0x12020800] 
struct AActor_eventSpawnedByKismet_Params
{
};

// Function Engine.Actor.GetTargetLocation
// [0x00024500]  (iNative[23977])
struct AActor_execGetTargetLocation_Params
{
	class AActor*                                      RequestedBy;                                      		// 0x0000 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bRequestAlternateLoc : 1;                         		// 0x0008 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	struct FVector                                     ReturnValue;                                      		// 0x000C (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.ScriptGetTeamNum
// [0x12020900] 
struct AActor_eventScriptGetTeamNum_Params
{
	uint8_t                                            ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetTeamNum
// [0x00020500]  (iNative[23984])
struct AActor_execGetTeamNum_Params
{
	uint8_t                                            ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.PawnBaseDied
// [0x12020000] 
struct AActor_execPawnBaseDied_Params
{
};

// Function Engine.Actor.IsPlayerOwned
// [0x00020500]  (iNative[24912])
struct AActor_execIsPlayerOwned_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetSpotOthersShouldLookAt
// [0x12020900] 
struct AActor_eventGetSpotOthersShouldLookAt_Params
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetActorEyesViewPoint
// [0x00420500]  (iNative[23531])
struct AActor_execGetActorEyesViewPoint_Params
{
	struct FVector                                     out_Location;                                     		// 0x0000 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FRotator                                    out_Rotation;                                     		// 0x000C (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function Engine.Actor.GetActorFaceFXAsset
// [0x12020800] 
struct AActor_eventGetActorFaceFXAsset_Params
{
	class UFaceFXAsset*                                ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.CanActorPlayFaceFXAnim
// [0x12020100] 
struct AActor_execCanActorPlayFaceFXAnim_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.IsActorPlayingFaceFXAnim
// [0x12020100] 
struct AActor_execIsActorPlayingFaceFXAnim_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.TickSkelControl
// [0x12020800] 
struct AActor_eventTickSkelControl_Params
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class USkeletalMeshComponent*                      SkelComp;                                         		// 0x0008 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	class USkelControlBase*                            SkelCtrl;                                         		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.SetSkelControlScale
// [0x12020800] 
struct AActor_eventSetSkelControlScale_Params
{
	struct FName                                       SkelControlName;                                  		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              Scale;                                            		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.SetMorphWeight
// [0x12020800] 
struct AActor_eventSetMorphWeight_Params
{
	struct FName                                       MorphNodeName;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              MorphWeight;                                      		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.StopActorFaceFXAnim
// [0x12020800] 
struct AActor_eventStopActorFaceFXAnim_Params
{
};

// Function Engine.Actor.PlayActorFaceFXAnim
// [0x12020800] 
struct AActor_eventPlayActorFaceFXAnim_Params
{
	class UFaceFXAnimSet*                              AnimSet;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class FString                                      GroupName;                                        		// 0x0008 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class FString                                      SeqName;                                          		// 0x0018 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UAkEvent*                                    AkEventToPlay;                                    		// 0x0028 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0030 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.FinishAnimControl
// [0x12020800] 
struct AActor_eventFinishAnimControl_Params
{
	class UInterpGroup*                                InInterpGroup;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.LastMatineeAnimFinished
// [0x00020400]  (iNative[25135])
struct AActor_execLastMatineeAnimFinished_Params
{
};

// Function Engine.Actor.SetAnimPosition
// [0x12020800] 
struct AActor_eventSetAnimPosition_Params
{
	struct FName                                       SlotName;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ChannelIndex;                                     		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       InAnimSeqName;                                    		// 0x000C (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              InPosition;                                       		// 0x0014 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bFireNotifies : 1;                                		// 0x0018 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bLooping : 1;                                     		// 0x001C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bEnableRootMotion : 1;                            		// 0x0020 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function Engine.Actor.BeginAnimControl
// [0x12020800] 
struct AActor_eventBeginAnimControl_Params
{
	class UInterpGroup*                                InInterpGroup;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.OnAnimPlay
// [0x12020800] 
struct AActor_eventOnAnimPlay_Params
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.OnAnimEnd
// [0x12020802] 
struct AActor_eventOnAnimEnd_Params
{
	class UAnimNodeSequence*                           SeqNode;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              PlayedTime;                                       		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ExcessTime;                                       		// 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.DoKismetAttachment
// [0x12020000] 
struct AActor_execDoKismetAttachment_Params
{
	class AActor*                                      Attachment;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class USeqAct_AttachToActor*                       Action;                                           		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.OnAttachToActor
// [0x12020002] 
struct AActor_execOnAttachToActor_Params
{
	class USeqAct_AttachToActor*                       Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.OnToggleHidden
// [0x12020102] 
struct AActor_execOnToggleHidden_Params
{
	class USeqAct_ToggleHidden*                        Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.OnChangeCollision
// [0x12020002] 
struct AActor_execOnChangeCollision_Params
{
	class USeqAct_ChangeCollision*                     Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.OnSetPhysics
// [0x12020102] 
struct AActor_execOnSetPhysics_Params
{
	class USeqAct_SetPhysics*                          Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.OnSetBlockRigidBody
// [0x12020102] 
struct AActor_execOnSetBlockRigidBody_Params
{
	class USeqAct_SetBlockRigidBody*                   Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.OnSetVelocity
// [0x12020102] 
struct AActor_execOnSetVelocity_Params
{
	class USeqAct_SetVelocity*                         Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.OnTeleport
// [0x12020102] 
struct AActor_execOnTeleport_Params
{
	class USeqAct_Teleport*                            Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.ModifyHealth
// [0x12020800] 
struct AActor_eventModifyHealth_Params
{
	uint32_t                                           bHeal : 1;                                        		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	float                                              DamageAmount;                                     		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AController*                                 EventInstigator;                                  		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitLocation;                                      		// 0x0010 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     Momentum;                                         		// 0x001C (0x000C) [0x0000000000000080] (CPF_Parm)    
	class UClass*                                      DamageType;                                       		// 0x0028 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UDamageTypeDefinition*                       DamageTypeDefinition;                             		// 0x0030 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UImpactDefinition*                           ImpactDefinition;                                 		// 0x0038 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.OnModifyHealth
// [0x12020102] 
struct AActor_execOnModifyHealth_Params
{
	class USeqAct_ModifyHealth*                        Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.PrestreamTextures
// [0x00020400]  (iNative[27656])
struct AActor_execPrestreamTextures_Params
{
	float                                              Seconds;                                          		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bEnableStreaming : 1;                             		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	struct FQWord                                      CinematicTextureGroups;                           		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.ShutDown
// [0x12020902] 
struct AActor_eventShutDown_Params
{
};

// Function Engine.Actor.SetNetUpdateTime
// [0x00020401]  (iNative[28898])
struct AActor_execSetNetUpdateTime_Params
{
	float                                              NewUpdateTime;                                    		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.ForceNetRelevant
// [0x12020800] 
struct AActor_eventForceNetRelevant_Params
{
};

// Function Engine.Actor.OnDestroy
// [0x12020102] 
struct AActor_execOnDestroy_Params
{
	class USeqAct_Destroy*                             Action;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.ClearLatentAction
// [0x12024101] 
struct AActor_execClearLatentAction_Params
{
	class UClass*                                      actionClass;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bAborted : 1;                                     		// 0x0008 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class USeqAct_Latent*                              exceptionAction;                                  		// 0x0010 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function Engine.Actor.FindEventsOfClass
// [0x12424101] 
struct AActor_execFindEventsOfClass_Params
{
	class UClass*                                      EventClass;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class TArray<class USequenceEvent*>                out_EventList;                                    		// 0x0008 (0x0010) [0x0000000000400190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           bIncludeDisabled : 1;                             		// 0x0018 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x001C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.ActivateEventClass
// [0x12424101] 
struct AActor_execActivateEventClass_Params
{
	class UClass*                                      InClass;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      InInstigator;                                     		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class TArray<class USequenceEvent*>                EventList;                                        		// 0x0010 (0x0010) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class TArray<int32_t>                              ActivateIndices;                                  		// 0x0020 (0x0010) [0x0000000000400192] (CPF_Const | CPF_OptionalParm | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           bTest : 1;                                        		// 0x0030 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class TArray<class USequenceEvent*>                ActivatedEvents;                                  		// 0x0038 (0x0010) [0x0000000000400190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0048 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.TriggerGlobalEventClass
// [0x12024100] 
struct AActor_execTriggerGlobalEventClass_Params
{
	class UClass*                                      InEventClass;                                     		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      InInstigator;                                     		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ActivateIndex;                                    		// 0x0010 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.ReceivedNewEvent
// [0x12020900] 
struct AActor_eventReceivedNewEvent_Params
{
	class USequenceEvent*                              Evt;                                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function Engine.Actor.TriggerEventClass
// [0x12424100] 
struct AActor_execTriggerEventClass_Params
{
	class UClass*                                      InEventClass;                                     		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      InInstigator;                                     		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            ActivateIndex;                                    		// 0x0010 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bTest : 1;                                        		// 0x0014 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class TArray<class USequenceEvent*>                ActivatedEvents;                                  		// 0x0018 (0x0010) [0x0000000000400190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0028 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.DebugMessagePlayer
// [0x12020801] 
struct AActor_eventDebugMessagePlayer_Params
{
	class FString                                      msg;                                              		// 0x0000 (0x0010) [0x0000000000400880] (CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink)
};

// Function Engine.Actor.ImpactEffectIsRelevant
// [0x00024500]  (iNative[24386])
struct AActor_execImpactEffectIsRelevant_Params
{
	class APawn*                                       EffectInstigator;                                 		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     SpawnLocation;                                    		// 0x0008 (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bForceDedicated : 1;                              		// 0x0014 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	float                                              VisibleCullDistance;                              		// 0x0018 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	float                                              HiddenCullDistance;                               		// 0x001C (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bSkipLOSCheck : 1;                                		// 0x0020 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      HitActor;                                         		// 0x0028 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0030 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.ActorEffectIsRelevant
// [0x00024500]  (iNative[16999])
struct AActor_execActorEffectIsRelevant_Params
{
	class APawn*                                       EffectInstigator;                                 		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bForceDedicated : 1;                              		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	float                                              VisibleCullDistance;                              		// 0x000C (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	float                                              HiddenCullDistance;                               		// 0x0010 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.EffectIsRelevant
// [0x12024100] 
struct AActor_execEffectIsRelevant_Params
{
	struct FVector                                     SpawnLocation;                                    		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bForceDedicated : 1;                              		// 0x000C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	float                                              VisibleCullDistance;                              		// 0x0010 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	float                                              HiddenCullDistance;                               		// 0x0014 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class AActor*                                      HitActor;                                         		// 0x0018 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetTraceImpact
// [0x00020500]  (iNative[24001])
struct AActor_execGetTraceImpact_Params
{
	class UImpactDefinition*                           ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetUntouchImpact
// [0x00020500]  (iNative[24015])
struct AActor_execGetUntouchImpact_Params
{
	class UImpactDefinition*                           ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.GetTouchImpact
// [0x00020500]  (iNative[24000])
struct AActor_execGetTouchImpact_Params
{
	class UImpactDefinition*                           ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.CanSplash
// [0x12020100] 
struct AActor_execCanSplash_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function Engine.Actor.PlayTeleportEffect
// [0x12020000] 
struct AActor_execPlayTeleportEffect_Params
{
	uint32_t                                           bOut : 1;                                         		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bSound : 1;                                       		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function Engine.Actor.Reset
// [0x12020802] 
struct AActor_eventReset_Params
{
};

// Function Engine.Actor.GetPhysicsName
// [0x12020100] 
struct AActor_execGetPhysicsName_Params
{
	class FString                                      ReturnValue;                                      		// 0x0000 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function Engine.Actor.SwitchDisplayDebugPage
// [0x12020100] 
struct AActor_execSwitchDisplayDebugPage_Params
{
	struct FName                                       ActiveDebugCategory;                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
