/*
#############################################################################################
# BattleBorn (1.0.0.0) SDK
# Generated with the CodeRedGenerator v1.0.3
# ========================================================================================= #
# File: GearboxFramework_structs.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

/*
# ========================================================================================= #
# Structs
# ========================================================================================= #
*/

// ScriptStruct GearboxFramework.ActionSequence.LatentStateData
// 0x0020
struct FLatentStateData
{
	struct FName                                       StateName;                                     // 0x0000 (0x0008) [0x0000000000000002] (CPF_Const)   
	struct FName                                       NextStateName;                                 // 0x0008 (0x0008) [0x0000000000000002] (CPF_Const)   
	int32_t                                            LatentValue;                                   // 0x0010 (0x0004) [0x0000000000000002] (CPF_Const)   
	uint32_t                                           bFirstLatent : 1;                              // 0x0014 (0x0004) [0x0000000000000002] [0x00000001] (CPF_Const)
	struct FPointer                                    LatentString;                                  // 0x0018 (0x0008) [0x0000000000001002] (CPF_Const | CPF_Native)
};

struct FGBXNavMeshPath {
	char UnknownData[0x18];
};

// ScriptStruct GearboxFramework.GearboxNavigationHandle.PathFindData
// 0x0080
struct FPathFindData
{
	struct FGBXNavMeshPath                             Path;                                          // 0x0000 (0x0018) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FBasedPosition                              FinalDest;                                     // 0x0018 (0x0038) [0x0000000000000000]               
	float                                              ReachTolerance;                                // 0x0050 (0x0004) [0x0000000000000000]               
	struct FGBXNavMeshPolyRef                          AnchorPoly;                                    // 0x0058 (0x0010) [0x0000000000000000]               
	uint8_t                                            Type;                                          // 0x0068 (0x0001) [0x0000000000000000]               
	uint32_t                                           bBestPath : 1;                                 // 0x006C (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            Counter;                                       // 0x0070 (0x0004) [0x0000000000000000]               
	class UActionSequencePawn* Action;                                        // 0x0078 (0x0008) [0x0000000000000000]               
};

// ScriptStruct GearboxFramework.GearboxNavigationHandle.PathRequestData
// 0x0170
struct FPathRequestData
{
	int32_t                                            RequestNum;                                    // 0x0000 (0x0004) [0x0000000000000000]               
	struct FVector                                     GoalLoc;                                       // 0x0004 (0x000C) [0x0000000000000000]               
	class AActor*                                      GoalActor;                                     // 0x0010 (0x0008) [0x0000000000000000]               
	struct FVector                                     GoalOffset;                                    // 0x0018 (0x000C) [0x0000000000000000]               
	uint32_t                                           bTryDirect : 1;                                // 0x0024 (0x0004) [0x0000000000000000] [0x00000001] 
	uint8_t                                            Type;                                          // 0x0028 (0x0001) [0x0000000000000000]               
	struct FPathFindData                               PathData;                                      // 0x0030 (0x0080) [0x0000000000400000] (CPF_NeedCtorLink)
	float                                              ReachTolerance;                                // 0x00B0 (0x0004) [0x0000000000000000]               
	struct FVector                                     StartLocation;                                 // 0x00B4 (0x000C) [0x0000000000000000]               
	struct FVector                                     PawnStartLocation;                             // 0x00C0 (0x000C) [0x0000000000000000]               
	uint32_t                                           bUseBestResult : 1;                            // 0x00CC (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              OverrideWidth;                                 // 0x00D0 (0x0004) [0x0000000000000000]               
	class UMindTargetInfo*                             TargetRec;                                     // 0x00D8 (0x0008) [0x0000000000000000]               
	uint32_t                                           bDisableFailureDebugMessages : 1;              // 0x00E0 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bStartAtGoal : 1;                              // 0x00E0 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bForcePathFind : 1;                            // 0x00E0 (0x0004) [0x0000000000000000] [0x00000004] 
	float                                              LastConstrainedScore;                          // 0x00E4 (0x0004) [0x0000000000000000]               
	struct FPointer                                    Constraints;                                   // 0x00E8 (0x0008) [0x0000000000001000] (CPF_Native)  
	struct FPointer                                    CostModifiers;                                 // 0x00F0 (0x0008) [0x0000000000001000] (CPF_Native)  
	struct FVector                                     FailedSelfLoc;                                 // 0x00F8 (0x000C) [0x0000000000000000]               
	struct FVector                                     FailedGoalLoc;                                 // 0x0104 (0x000C) [0x0000000000000000]               
	struct FNavMeshPathParams                          FailedPathParams;                              // 0x0110 (0x0060) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct GearboxFramework.GearboxNavigationHandle.GBXNavMeshPathPoint
// 0x0038
struct FGBXNavMeshPathPoint
{
	struct FVector                                     Location;                                      // 0x0000 (0x000C) [0x0000000000000000]               
	int32_t                                            SpecialMoveId;                                 // 0x000C (0x0004) [0x0000000000000000]               
	struct FGBXNavMeshPolyRef                          Poly;                                          // 0x0010 (0x0010) [0x0000000000000000]               
	float                                              NextPathObjectDistance;                        // 0x0020 (0x0004) [0x0000000000000000]               
	class TArray<struct FIGBXNavMeshObstaclePointer>   CrossedObstacles;                              // 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct GearboxFramework.GearboxNavigationHandle.IGBXNavMeshObstaclePointer
// 0x0008
struct FIGBXNavMeshObstaclePointer
{
	struct FPointer                                    Dummy;                                         // 0x0000 (0x0008) [0x0000000000001002] (CPF_Const | CPF_Native)
};

// ScriptStruct GearboxFramework.GearboxGlobals.GearboxViewShakeInfo
// 0x0044
struct FGearboxViewShakeInfo
{
	struct FVector                                     OffsetMag;                                     // 0x0000 (0x000C) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     OffsetRate;                                    // 0x000C (0x000C) [0x0000000000000001] (CPF_Edit)    
	float                                              OffsetTime;                                    // 0x0018 (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     RotMag;                                        // 0x001C (0x000C) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     RotRate;                                       // 0x0028 (0x000C) [0x0000000000000001] (CPF_Edit)    
	float                                              RotTime;                                       // 0x0034 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              FOVMag;                                        // 0x0038 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              FOVRate;                                       // 0x003C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              FOVTime;                                       // 0x0040 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct GearboxFramework.GearboxGlobals.ObjectKey
// 0x0010
struct FObjectKey
{
	struct FName                                       ObjectName;                                    // 0x0000 (0x0008) [0x0000000000100000]               
	struct FName                                       AdditionalKey;                                 // 0x0008 (0x0008) [0x0000000000100000]               
};

// ScriptStruct GearboxFramework.GearboxGlobals.LevelStateRecord
// 0x0020
struct FLevelStateRecord
{
	struct FName                                       LevelName;                                     // 0x0000 (0x0008) [0x0000000000100000]               
	uint8_t                                            LevelLoaded;                                   // 0x0008 (0x0001) [0x0000000000100000]               
	class TArray<struct FObjectKey>                    ObjectKeys;                                    // 0x0010 (0x0010) [0x0000000000500000] (CPF_NeedCtorLink)
};

// ScriptStruct GearboxFramework.GearboxGlobals.ValidNameRange
// 0x0008
struct FValidNameRange
{
	int32_t                                            Start;                                         // 0x0000 (0x0004) [0x0000000000100000]               
	int32_t                                            End;                                           // 0x0004 (0x0004) [0x0000000000100000]               
};

// ScriptStruct GearboxFramework.GearboxGlobals.LocationInfo
// 0x0010
struct FLocationInfo
{
	struct FVector                                     Location;                                      // 0x0000 (0x000C) [0x0000000000000000]               
	uint32_t                                           IsPlayerInfo : 1;                              // 0x000C (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct GearboxFramework.GearboxGlobals.SpawnActorData
// 0x004C
struct FSpawnActorData
{
	class USpawnFactory*                               SpawnFactory;                                  // 0x0000 (0x0008) [0x0000000004000003] (CPF_Edit | CPF_Const | CPF_EditInline)
	struct FAttributeInitializationData                Probability;                                   // 0x0008 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                MaxActiveAtOneTime;                            // 0x0028 (0x0020) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           TestVisibility : 1;                            // 0x0048 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	uint32_t                                           TestFOV : 1;                                   // 0x0048 (0x0004) [0x0000000000000003] [0x00000002] (CPF_Edit | CPF_Const)
};

// ScriptStruct GearboxFramework.GearboxGlobals.SubarrayData_Mirror
// 0x0004
struct FSubarrayData_Mirror
{
	int32_t                                            ArrayIndexAndLength;                           // 0x0000 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct GearboxFramework.GearboxGlobals.AIRange
// 0x0008
struct FAIRange
{
	float                                              MinVal;                                        // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxVal;                                        // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct GearboxFramework.GearboxGlobals.TQPOV
// 0x0024
struct FTQPOV
{
	struct FVector                                     Location;                                      // 0x0000 (0x000C) [0x0000000000000001] (CPF_Edit)    
	struct FQuat                                       Rotation;                                      // 0x0010 (0x0010) [0x0000000000000001] (CPF_Edit)    
	float                                              FOV;                                           // 0x0020 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct GearboxFramework.IBehaviorConsumer.BehaviorConsumerHandle
// 0x0004
struct FBehaviorConsumerHandle
{
	int32_t                                            PID;                                           // 0x0000 (0x0004) [0x0000000000000000]               
};

// ScriptStruct GearboxFramework.BehaviorHelpers.RelativeDirectionData
// 0x0034
struct FRelativeDirectionData
{
	uint8_t                                            Direction;                                     // 0x0000 (0x0001) [0x0000000000000001] (CPF_Edit)    
	struct FAttributeInitializationData                ConeAroundDirection;                           // 0x0008 (0x0020) [0x0000000000000001] (CPF_Edit)    
	struct FRotator                                    AdditionalRotation;                            // 0x0028 (0x000C) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct GearboxFramework.BehaviorHelpers.BehaviorEventUserData
// 0x0020
struct FBehaviorEventUserData
{
	struct FName                                       EventName;                                     // 0x0000 (0x0008) [0x0000000000000000]               
	int32_t                                            MaxTriggerCount;                               // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              ReTriggerDelay;                                // 0x000C (0x0004) [0x0000000000000000]               
	uint32_t                                           bEnabled : 1;                                  // 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bReplicate : 1;                                // 0x0010 (0x0004) [0x0000000000000000] [0x00000002] 
	class UObject*                                     FilterObject;                                  // 0x0018 (0x0008) [0x0000000020000000]  CPF_Deprecated)
};

// ScriptStruct GearboxFramework.AIComponent.TrajectoryData
// 0x0024
struct FTrajectoryData
{
	uint32_t                                           bAutoGenerate : 1;                             // 0x0000 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	float                                              Speed;                                         // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AnglePct;                                      // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              Angle;                                         // 0x000C (0x0004) [0x0000000000000000]               
	float                                              Error;                                         // 0x0010 (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     Offset;                                        // 0x0014 (0x000C) [0x0000000000000001] (CPF_Edit)    
	float                                              PredictDistMax;                                // 0x0020 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct GearboxFramework.AIComponent.InvalidPointData
// 0x0018
struct FInvalidPointData
{
	float                                              EndTime;                                       // 0x0000 (0x0004) [0x0000000000000000]               
	struct FInfluencePointRef                          Point;                                         // 0x0008 (0x0010) [0x0000000000000000]               
};

// ScriptStruct GearboxFramework.AIComponent.AIScriptedActionParams
// 0x003C
struct FAIScriptedActionParams
{
	class FString                                      DisplayName;                                   // 0x0000 (0x0010) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class UActionSequence*                             Action;                                        // 0x0010 (0x0008) [0x0000000004000003] (CPF_Edit | CPF_Const | CPF_EditInline)
	class AActor*                                      Target;                                        // 0x0018 (0x0008) [0x0000000000000002] (CPF_Const)   
	class UExpressionEvaluator*                        SucceedIf;                                     // 0x0020 (0x0008) [0x0000000004000003] (CPF_Edit | CPF_Const | CPF_EditInline)
	float                                              SucceedTime;                                   // 0x0028 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class UExpressionEvaluator*                        FailIf;                                        // 0x0030 (0x0008) [0x0000000004000003] (CPF_Edit | CPF_Const | CPF_EditInline)
	float                                              FailTime;                                      // 0x0038 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct GearboxFramework.AIComponent.PriorityData
// 0x0018
struct FPriorityData
{
	class FString                                      Description;                                   // 0x0000 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class UExpressionEvaluator*                        Condition;                                     // 0x0010 (0x0008) [0x0000000004000001] (CPF_Edit | CPF_EditInline)
};

// ScriptStruct GearboxFramework.AIComponent.AISequenceResultData
// 0x0003
struct FAISequenceResultData
{
	uint8_t                                            OnSuccess;                                     // 0x0000 (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint8_t                                            OnFailure;                                     // 0x0001 (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint8_t                                            OnCannotRun;                                   // 0x0002 (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct GearboxFramework.AIComponent.AITreeData
// 0x0139
struct FAITreeData
{
	uint8_t                                            Type;                                          // 0x0000 (0x0001) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
	struct FName                                       BehaviorName;                                  // 0x0004 (0x0008) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
	class TArray<int32_t>                              Children;                                      // 0x0010 (0x0010) [0x0000000000420003] (CPF_Edit | CPF_Const | CPF_EditConst | CPF_NeedCtorLink)
	class UAIResource*                                 Resource;                                      // 0x0020 (0x0008) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
	uint32_t                                           bStopWhenCanRunIfFails : 1;                    // 0x0028 (0x0004) [0x0000000000020003] [0x00000001] (CPF_Edit | CPF_Const | CPF_EditConst)
	class UExpressionEvaluator*                        CanRunIf;                                      // 0x0030 (0x0008) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
	class UExpressionEvaluator*                        ShouldStopIf;                                  // 0x0038 (0x0008) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
	class UExpressionEvaluator*                        ShouldStopIfSuccess;                           // 0x0040 (0x0008) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
	struct FAIRange                                    FailTimer;                                     // 0x0048 (0x0008) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
	struct FAIRange                                    SuccessTimer;                                  // 0x0050 (0x0008) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
	struct FAIRange                                    StartTimer;                                    // 0x0058 (0x0008) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
	struct FAIRange                                    NewTargetTimer;                                // 0x0060 (0x0008) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
	struct FAIRange                                    CombatStartTimer;                              // 0x0068 (0x0008) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
	struct FAIRange                                    FailureCooldown;                               // 0x0070 (0x0008) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
	struct FAIRange                                    SuccessCooldown;                               // 0x0078 (0x0008) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
	uint32_t                                           bStopIfCannotRun : 1;                          // 0x0080 (0x0004) [0x0000000000020003] [0x00000001] (CPF_Edit | CPF_Const | CPF_EditConst)
	struct FAIRange                                    TimedStart;                                    // 0x0084 (0x0008) [0x0000000000000002] (CPF_Const)   
	struct FAIRange                                    TimedReset;                                    // 0x008C (0x0008) [0x0000000000000002] (CPF_Const)   
	struct FAIRange                                    TimedFail;                                     // 0x0094 (0x0008) [0x0000000000000002] (CPF_Const)   
	struct FUInt64                                     ActionTagMask;                                 // 0x00A0 (0x0008) [0x0000000000000002] (CPF_Const)   
	struct FUInt64                                     ChildActionTagMask;                            // 0x00A8 (0x0008) [0x0000000000000002] (CPF_Const)   
	class UActionSequence*                             Action;                                        // 0x00B0 (0x0008) [0x000000000442000B] (CPF_Edit | CPF_Const | CPF_ExportObject | CPF_EditConst | CPF_NeedCtorLink | CPF_EditInline)
	class UActionSequencePawn*                         PawnAction;                                    // 0x00B8 (0x0008) [0x0000000000022003] (CPF_Edit | CPF_Const | CPF_Transient | CPF_EditConst)
	class TArray<float>                                Weights;                                       // 0x00C0 (0x0010) [0x0000000000420003] (CPF_Edit | CPF_Const | CPF_EditConst | CPF_NeedCtorLink)
	class TArray<int32_t>                              LoopCountMax;                                  // 0x00D0 (0x0010) [0x0000000000420003] (CPF_Edit | CPF_Const | CPF_EditConst | CPF_NeedCtorLink)
	uint32_t                                           bInterrupt : 1;                                // 0x00E0 (0x0004) [0x0000000000020003] [0x00000001] (CPF_Edit | CPF_Const | CPF_EditConst)
	class TArray<class UExpressionEvaluator*>          Conditions;                                    // 0x00E8 (0x0010) [0x0000000000420003] (CPF_Edit | CPF_Const | CPF_EditConst | CPF_NeedCtorLink)
	struct FAISequenceResultData                       SequenceData;                                  // 0x00F8 (0x0003) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class TArray<struct FAISequenceResultData>         PerNodeSequenceData;                           // 0x0100 (0x0010) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class UUtilityDefinition*                          UtilityDef;                                    // 0x0110 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	int32_t                                            PosX;                                          // 0x0118 (0x0004) [0x0000000000000002] (CPF_Const)   
	int32_t                                            PosY;                                          // 0x011C (0x0004) [0x0000000000000002] (CPF_Const)   
	class FString                                      NodeName;                                      // 0x0120 (0x0010) [0x0000000000400002] (CPF_Const | CPF_NeedCtorLink)
	struct FName                                       ActionFailName;                                // 0x0130 (0x0008) [0x0000000000000002] (CPF_Const)   
	uint8_t                                            FailReason;                                    // 0x0138 (0x0001) [0x0000000000000002] (CPF_Const)   
};


// ScriptStruct GearboxFramework.AIComponent.AIHoldData
// 0x0010
struct FAIHoldData
{
	struct FName                                       HoldName;                                      // 0x0000 (0x0008) [0x0000000000000000]               
	class UObject*                                     HoldTag;                                       // 0x0008 (0x0008) [0x0000000000000000]               
};

// ScriptStruct GearboxFramework.AIComponent.AITreeState
// 0x0050
struct FAITreeState
{
	struct FRef_Mirror                                 Data;                                          // 0x0000 (0x0008) [0x0000000000001000] (CPF_Native)  
	float                                              LastFailTime;                                  // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              NextTimedRun;                                  // 0x000C (0x0004) [0x0000000000000000]               
	float                                              NextTimedFail;                                 // 0x0010 (0x0004) [0x0000000000000000]               
	float                                              NextTimedSuccess;                              // 0x0014 (0x0004) [0x0000000000000000]               
	struct FName                                       FailReason;                                    // 0x0018 (0x0008) [0x0000000000000000]               
	int32_t                                            ActiveChildIdx;                                // 0x0020 (0x0004) [0x0000000000000000]               
	int32_t                                            NextActiveChildIdx;                            // 0x0024 (0x0004) [0x0000000000000000]               
	uint32_t                                           bStoppedByResource : 1;                        // 0x0028 (0x0004) [0x0000000000000000] [0x00000001] 
	class UActionSequence*                             Action;                                        // 0x0030 (0x0008) [0x0000000000000000]               
	int32_t                                            LoopCount;                                     // 0x0038 (0x0004) [0x0000000000000000]               
	int32_t                                            LastRandomChild;                               // 0x003C (0x0004) [0x0000000000000000]               
	int32_t                                            NextSequentialChildIdx;                        // 0x0040 (0x0004) [0x0000000000000000]               
	uint32_t                                           bIsDisabled : 1;                               // 0x0044 (0x0004) [0x0000000000000002] [0x00000001] (CPF_Const)
	float                                              LargestSizeX;                                  // 0x0048 (0x0004) [0x0000000000000000]               
	float                                              LargestSizeY;                                  // 0x004C (0x0004) [0x0000000000000000]               
};

// ScriptStruct GearboxFramework.AIComponent.AIResourceState
// 0x0038
struct FAIResourceState
{
	class UAIResource*                                 Resource;                                      // 0x0000 (0x0008) [0x0000000000000000]               
	float                                              NextTimedFail;                                 // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              NextTimedSuccess;                              // 0x000C (0x0004) [0x0000000000000000]               
	float                                              NextAvailableTime;                             // 0x0010 (0x0004) [0x0000000000000000]               
	class TArray<class UAIComponent*>                  IsRunning;                                     // 0x0018 (0x0010) [0x0000000004480008] (CPF_ExportObject | CPF_Component | CPF_NeedCtorLink | CPF_EditInline)
	class TArray<class UAIComponent*>                  WantsToRun;                                    // 0x0028 (0x0010) [0x0000000004480008] (CPF_ExportObject | CPF_Component | CPF_NeedCtorLink | CPF_EditInline)
};

// ScriptStruct GearboxFramework.TerritoryComponent.TerritoryData
// 0x0028
struct FTerritoryData
{
	uint32_t                                           bEverywhere : 1;                               // 0x0000 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	float                                              Height;                                        // 0x0004 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              Radius;                                        // 0x0008 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class TArray<class AVolume*>                       Volumes;                                       // 0x0010 (0x0010) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class AVolume*                                     Volume;                                        // 0x0020 (0x0008) [0x0000000000000000]               
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.BehaviorSequenceData
// 0x0018
struct FBehaviorSequenceData
{
	struct FName                                       BehaviorSequenceName;                          // 0x0000 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           bEnabledOnSpawn : 1;                           // 0x0008 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	uint32_t                                           bSequenceEnabledMutex : 1;                     // 0x0008 (0x0004) [0x0000000000000003] [0x00000002] (CPF_Edit | CPF_Const)
	class UBehaviorSequenceCustomEnableCondition*      CustomEnableCondition;                         // 0x0010 (0x0008) [0x0000000004000003] (CPF_Edit | CPF_Const | CPF_EditInline)
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.BehaviorVariableValue
// 0x002D
struct FBehaviorVariableValue
{
	class TArray<class UObject*>                       ObjectArrayValue;                              // 0x0000 (0x0010) [0x0000000000500000] (CPF_NeedCtorLink)
	class UObject*                                     ObjectValue;                                   // 0x0010 (0x0008) [0x0000000000000000]               
	struct FVector                                     VectorValue;                                   // 0x0018 (0x000C) [0x0000000000000000]               
	int32_t                                            IntValue;                                      // 0x0024 (0x0004) [0x0000000000000000]               
	float                                              FloatValue;                                    // 0x0028 (0x0004) [0x0000000000000000]               
	uint8_t                                            VariableType;                                  // 0x002C (0x0001) [0x0000000000000000]               
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.UserBehaviorSequence
// 0x0020
struct FUserBehaviorSequence
{
	struct FName                                       BehaviorSequenceName;                          // 0x0000 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           bEnabledOnSpawn : 1;                           // 0x0008 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	uint32_t                                           bSequenceEnabledMutex : 1;                     // 0x0008 (0x0004) [0x0000000000000003] [0x00000002] (CPF_Edit | CPF_Const)
	class UBehaviorSequenceCustomEnableCondition*      CustomEnableCondition;                         // 0x0010 (0x0008) [0x0000000004000003] (CPF_Edit | CPF_Const | CPF_EditInline)
	class UObject*                                     Sequence;                                      // 0x0018 (0x0008) [0x000000000440000A] (CPF_Const | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline)
};

// ScriptStruct GearboxFramework.BehaviorProviderDefinition.CompiledBehaviorProvider
// 0x0040
struct FCompiledBehaviorProvider
{
	struct FArray_Mirror                               BehaviorSequences;                             // 0x0000 (0x0010) [0x0000000000201000] (CPF_Native)  
	struct FArray_Mirror                               AccessorData;                                  // 0x0010 (0x0010) [0x0000000000201000] (CPF_Native)  
	struct FArray_Mirror                               BehaviorData;                                  // 0x0020 (0x0010) [0x0000000000201000] (CPF_Native)  
	struct FArray_Mirror                               ReferenceData;                                 // 0x0030 (0x0010) [0x0000000000201000] (CPF_Native)  
};

// ScriptStruct GearboxFramework.AIDebugCamera.DebugListItem
// 0x005D
struct FDebugListItem
{
	uint8_t                                            DisplayType;                                   // 0x0000 (0x0001) [0x0000000000100000]               
	struct FVector                                     Location;                                      // 0x0004 (0x000C) [0x0000000000100000]               
	struct FVector                                     Location2;                                     // 0x0010 (0x000C) [0x0000000000100000]               
	struct FVector                                     Location3;                                     // 0x001C (0x000C) [0x0000000000100000]               
	class UTexture2D*                                  Texture;                                       // 0x0028 (0x0008) [0x0000000000100000]               
	float                                              U;                                             // 0x0030 (0x0004) [0x0000000000100000]               
	float                                              V;                                             // 0x0034 (0x0004) [0x0000000000100000]               
	float                                              UL;                                            // 0x0038 (0x0004) [0x0000000000100000]               
	float                                              VL;                                            // 0x003C (0x0004) [0x0000000000100000]               
	float                                              Scale;                                         // 0x0040 (0x0004) [0x0000000000100000]               
	class FString                                      TextString;                                    // 0x0048 (0x0010) [0x0000000000500000] (CPF_NeedCtorLink)
	struct FColor                                      TextColor;                                     // 0x0058 (0x0004) [0x0000000000100000]               
	uint8_t                                            Alignment;                                     // 0x005C (0x0001) [0x0000000000100000]               
};

// ScriptStruct GearboxFramework.GearboxAIMoveNode.NodeData
// 0x000C
struct FNodeData
{
	class AGearboxAIMoveNode*                          Node;                                          // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              Weight;                                        // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct GearboxFramework.AIResource.AIResourceRestriction
// 0x0010
struct FAIResourceRestriction
{
	int32_t                                            MaxUsers;                                      // 0x0000 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	int32_t                                            MinUsers;                                      // 0x0004 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class UAIResource*                                 Resource;                                      // 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct GearboxFramework.AnimNode_DirectionSet.AnimDirectionSetChildData
// 0x0020
struct FAnimDirectionSetChildData
{
	class TArray<struct FName>                         NodeNames;                                     // 0x0000 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<class UAnimNode_Crossfade*>           Nodes;                                         // 0x0010 (0x0010) [0x0000000000602002] (CPF_Const | CPF_Transient | CPF_NeedCtorLink)
};

// ScriptStruct GearboxFramework.AnimNode_MasterMovement.AnimMovementChildData
// 0x0020
struct FAnimMovementChildData
{
	class TArray<float>                                AnimSpeeds;                                    // 0x0000 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<float>                                AnimRates;                                     // 0x0010 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct GearboxFramework.AnimNode_SpeedCrossfade.AnimSpeedCrossfadeChildData
// 0x0008
struct FAnimSpeedCrossfadeChildData
{
	float                                              Speed;                                         // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AnimLength;                                    // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct GearboxFramework.AnimNode_StanceTransition.StanceTransitionPair
// 0x0010
struct FStanceTransitionPair
{
	class UStanceDefinition*                           FromStance;                                    // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UStanceDefinition*                           ToStance;                                      // 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct GearboxFramework.SpecialMoveInterface.SpecialMoveData
// 0x0038
struct FSpecialMoveData
{
	class UObject* Data;                                          // 0x0000 (0x0008) [0x0000000000000000]               
	float                                              PlayRateScale;                                 // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              Duration;                                      // 0x000C (0x0004) [0x0000000000000000]               
	uint32_t                                           bSendCallbackAtEndOfSequence : 1;              // 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bStartOfSequence : 1;                          // 0x0010 (0x0004) [0x0000000000000000] [0x00000002] 
	struct FName                                       CallbackName;                                  // 0x0014 (0x0008) [0x0000000000000000]               
	class UObject* CallbackObject;                                // 0x0020 (0x0008) [0x0000000000000000]               
	class USpecialMoveDefinition* SMD;                                           // 0x0028 (0x0008) [0x0000000000000000]               
	uint32_t                                           bHasBlendInOverrideTime : 1;                   // 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              BlendInOverrideTime;                           // 0x0034 (0x0004) [0x0000000000000000]               
};

// ScriptStruct GearboxFramework.AnimNodeSpecialMoveBlend.SlotAnimParameters
// 0x0074
struct FSlotAnimParameters
{
	struct FSpecialMoveData                            SMData;                                        // 0x0000 (0x0038) [0x0000000000000000]               
	class UGearboxAnimDefinition*                      CustomAnimDef;                                 // 0x0038 (0x0008) [0x0000000000000000]               
	struct FName                                       CustomAnimName;                                // 0x0040 (0x0008) [0x0000000000000000]               
	class TArray<float>                                PerBoneWeights;                                // 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<uint8_t>                              TransformReqBone;                              // 0x0058 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            TransformReqBoneIndex;                         // 0x0068 (0x0004) [0x0000000000000000]               
	float                                              StartTime;                                     // 0x006C (0x0004) [0x0000000000000000]               
	uint32_t                                           bDisableNotifies : 1;                          // 0x0070 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct GearboxFramework.Spawner.SpawnerCleanupParameters
// 0x0008
struct FSpawnerCleanupParameters
{
	uint32_t                                           bCleanupActorsWhenIrrelevant : 1;              // 0x0000 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	float                                              ActorIrrelvantDistance;                        // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct GearboxFramework.Spawner.SpawnerSavedState
// 0x0010
struct FSpawnerSavedState
{
	int32_t                                            SelectedSpawnIdx;                              // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            NumTotalActors;                                // 0x0004 (0x0004) [0x0000000000000000]               
	uint8_t                                            MaxActiveActors;                               // 0x0008 (0x0001) [0x0000000000000000]               
	uint8_t                                            NumActiveActors;                               // 0x0009 (0x0001) [0x0000000000000000]               
	float                                              NextSpawnTime;                                 // 0x000C (0x0004) [0x0000000000000000]               
};

// ScriptStruct GearboxFramework.AreaSpawner.AreaSpawnerOptionData
// 0x0018
struct FAreaSpawnerOptionData
{
	class UExpressionEvaluatorDefinition*              ExpressionDef;                                 // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class TArray<struct FAreaSpawnerSpawnDefData>      SpawnDefinitions;                              // 0x0008 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct GearboxFramework.AreaSpawner.AreaSpawnerSpawnDefData
// 0x0070
struct FAreaSpawnerSpawnDefData
{
	class USpawnDefinition*                            SpawnDef;                                      // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FAttributeInitializationData                MaxTotalActorsFormula;                         // 0x0008 (0x0020) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            MaxTotalActors;                                // 0x0028 (0x0004) [0x0000000000000000]               
	int32_t                                            MaxActiveActors;                               // 0x002C (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FAttributeInitializationData                RespawnDelay;                                  // 0x0030 (0x0020) [0x0000000000000001] (CPF_Edit)    
	struct FAttributeInitializationData                RespawnDelayAfterDeath;                        // 0x0050 (0x0020) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct GearboxFramework.AreaSpawner.AreaSpawnerData
// 0x0010
struct FAreaSpawnerData
{
	class TArray<struct FAreaSpawnerSpawnDefStateData> Data;                                          // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct GearboxFramework.AreaSpawner.AreaSpawnerSpawnDefStateData
// 0x001C
struct FAreaSpawnerSpawnDefStateData
{
	class FString                                      SpawnDefName;                                  // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            NumTotalActors;                                // 0x0010 (0x0004) [0x0000000000000000]               
	int32_t                                            NumActiveActors;                               // 0x0014 (0x0004) [0x0000000000000000]               
	float                                              NextSpawnTime;                                 // 0x0018 (0x0004) [0x0000000000000000]               
};

// ScriptStruct GearboxFramework.IGFxUIManager.GFxUIActionParam
// 0x0018
struct FGFxUIActionParam
{
	int32_t                                            IntValue;                                      // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              FloatValue;                                    // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           BoolValue : 1;                                 // 0x0008 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	class UObject*                                     ObjectValue;                                   // 0x0010 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct GearboxFramework.IBehaviorProvider.SpecializedBehaviorEvent
// 0x0008
struct FSpecializedBehaviorEvent
{
	struct FName                                       EventName;                                     // 0x0000 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct GearboxFramework.ITimerBehavior.TimerEventReactionData
// 0x0018
struct FTimerEventReactionData
{
	uint8_t                                            EventType;                                     // 0x0000 (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class TArray<class UBehaviorBase*>                 Behaviors;                                     // 0x0008 (0x0010) [0x0000000004400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink | CPF_EditInline)
};

// ScriptStruct GearboxFramework.ITimerBehavior.TimerEventReactionDataSpecialized
// 0x0000 (0x0008 - 0x0008)
struct FTimerEventReactionDataSpecialized : FSpecializedBehaviorEvent
{
};

// ScriptStruct GearboxFramework.ITimerBehavior.BehaviorTimerState
// 0x000C
struct FBehaviorTimerState
{
	uint32_t                                           bIsRunning : 1;                                // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              Delay;                                         // 0x0004 (0x0004) [0x0000000000000000]               
	float                                              EventTime;                                     // 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct GearboxFramework.ITimerBehavior.TimerBehaviorUserState
// 0x0024
struct FTimerBehaviorUserState
{
	struct FBehaviorTimerState                         Timers[0x3];                                   // 0x0000 (0x0024) [0x0000000000000000]               
};

// ScriptStruct GearboxFramework.BehaviorHelpers.AttachmentLocationData
// 0x0028
struct FAttachmentLocationData
{
	struct FVector                                     Location;                                      // 0x0000 (0x000C) [0x0000000000000001] (CPF_Edit)    
	class UIWorldBody*                                 AttachmentBase_Object;                         // 0x0010 (0x0010) [0x0000000000000000] 
	class UIWorldBody*                                 AttachmentBase_Interface;                      // 0x0010 (0x0010) [0x0000000000000000]               
	struct FName                                       AttachmentName;                                // 0x0020 (0x0008) [0x0000000000000000]               
};

// ScriptStruct GearboxFramework.DamageReceiverComponent.DamageInstanceDataState
// 0x0008
struct FDamageInstanceDataState
{
	struct FRef_Mirror                                 Data;                                          // 0x0000 (0x0008) [0x0000000000001000] (CPF_Native)  
};

// ScriptStruct GearboxFramework.DamageReceiverComponent.DamageEventState
// 0x0018
struct FDamageEventState
{
	int32_t                                            TriggerCount;                                  // 0x0000 (0x0004) [0x0000000000000000]               
	float                                              LastTriggerTime;                               // 0x0004 (0x0004) [0x0000000000000000]               
	float                                              DamageApplied;                                 // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              DamageAppliedTime;                             // 0x000C (0x0004) [0x0000000000000000]               
	struct FRef_Mirror                                 Data;                                          // 0x0010 (0x0008) [0x0000000000001000] (CPF_Native)  
};

// ScriptStruct GearboxFramework.DamageReceiverComponent.DamageModeState
// 0x0020
struct FDamageModeState
{
	float                                              MinHealth;                                     // 0x0000 (0x0004) [0x0000000000000000]               
	class TArray<struct FDamageEventState>             Events;                                        // 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FRef_Mirror                                 Data;                                          // 0x0018 (0x0008) [0x0000000000001000] (CPF_Native)  
};

// ScriptStruct GearboxFramework.DamageReceiverComponent.DamageReceiverDebugData
// 0x0010
struct FDamageReceiverDebugData
{
	float                                              Time;                                          // 0x0000 (0x0004) [0x0000000000000000]               
	float                                              TakeDamage;                                    // 0x0004 (0x0004) [0x0000000000000000]               
	float                                              PassDamage;                                    // 0x0008 (0x0004) [0x0000000000000000]               
	int32_t                                            StartNodeIdx;                                  // 0x000C (0x0004) [0x0000000000000000]               
};

// ScriptStruct GearboxFramework.DamageReceiverComponent.DamageNodeState
// 0x0038
struct FDamageNodeState
{
	int32_t                                            ModeIdx;                                       // 0x0000 (0x0004) [0x0000000000000000]               
	float                                              Health;                                        // 0x0004 (0x0004) [0x0000000000000000]               
	float                                              MaxHealth;                                     // 0x0008 (0x0004) [0x0000000000000000]               
	class TArray<struct FDamageModeState>              Modes;                                         // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FDamageEventState>             Events;                                        // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FRef_Mirror                                 Data;                                          // 0x0030 (0x0008) [0x0000000000001000] (CPF_Native)  
};

// ScriptStruct GearboxFramework.FlagDefinition.FlagDefinitionInitialization
// 0x0048
struct FFlagDefinitionInitialization
{
	class UFlagDefinition*                             FlagToSet;                                     // 0x0000 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                ChanceTrue;                                    // 0x0008 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                Duration;                                      // 0x0028 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct GearboxFramework.DialogSystem.DialogParameters
// 0x0035
struct FDialogParameters
{
	uint32_t                                           bOverride_ComfortableNoiseLevel : 1;           // 0x0000 (0x0004) [0x0000000000000002] [0x00000001] (CPF_Const)
	float                                              ComfortableNoiseLevel;                         // 0x0004 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           bOverride_bNonSocial : 1;                      // 0x0008 (0x0004) [0x0000000000000002] [0x00000001] (CPF_Const)
	uint32_t                                           bNonSocial : 1;                                // 0x0008 (0x0004) [0x0000000000000003] [0x00000002] (CPF_Edit | CPF_Const)
	uint32_t                                           bOverride_CaresAbout : 1;                      // 0x0008 (0x0004) [0x0000000000000002] [0x00000004] (CPF_Const)
	uint8_t                                            CaresAbout;                                    // 0x000C (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           bOverride_bInterruptSamePriority : 1;          // 0x0010 (0x0004) [0x0000000000000002] [0x00000001] (CPF_Const)
	uint32_t                                           bInterruptSamePriority : 1;                    // 0x0010 (0x0004) [0x0000000000000003] [0x00000002] (CPF_Edit | CPF_Const)
	uint32_t                                           bOverride_InterruptMethod : 1;                 // 0x0010 (0x0004) [0x0000000000000002] [0x00000004] (CPF_Const)
	uint8_t                                            InterruptMethod;                               // 0x0014 (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           bOverride_Priority : 1;                        // 0x0018 (0x0004) [0x0000000000000002] [0x00000001] (CPF_Const)
	int32_t                                            Priority;                                      // 0x001C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           bOverride_SubtitlePriority : 1;                // 0x0020 (0x0004) [0x0000000000000002] [0x00000001] (CPF_Const)
	uint8_t                                            SubtitlePriority;                              // 0x0024 (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           bOverride_MaxWaitTime : 1;                     // 0x0028 (0x0004) [0x0000000000000002] [0x00000001] (CPF_Const)
	float                                              MaxWaitTime;                                   // 0x002C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           bOverride_SpeakableWhenDead : 1;               // 0x0030 (0x0004) [0x0000000000000002] [0x00000001] (CPF_Const)
	uint32_t                                           bSpeakableWhenDead : 1;                        // 0x0030 (0x0004) [0x0000000000000003] [0x00000002] (CPF_Edit | CPF_Const)
	uint32_t                                           bOverride_SpeakableWhenStealthed : 1;          // 0x0030 (0x0004) [0x0000000000000002] [0x00000004] (CPF_Const)
	uint32_t                                           bSpeakableWhenStealthed : 1;                   // 0x0030 (0x0004) [0x0000000000000003] [0x00000008] (CPF_Edit | CPF_Const)
	uint32_t                                           bOverride_ListenerFilter : 1;                  // 0x0030 (0x0004) [0x0000000000000002] [0x00000010] (CPF_Const)
	uint8_t                                            ListenerFilter;                                // 0x0034 (0x0001) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct GearboxFramework.DialogSystem.DialogContextData
// 0x0018
struct FDialogContextData
{
	class UObject*                                     Subject;                                       // 0x0000 (0x0008) [0x0000000000000000]               
	class UObject*                                     Target;                                        // 0x0008 (0x0008) [0x0000000000000000]               
	class UObject*                                     Instigator;                                    // 0x0010 (0x0008) [0x0000000000000000]               
};

// ScriptStruct GearboxFramework.DialogSystem.DialogEventAndResponse
// 0x0028
struct FDialogEventAndResponse
{
	class UDialogEvent*                                Event;                                         // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UDialogEventCondition*                       Expression;                                    // 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bOverride_ChanceToUseSpecialization : 1;       // 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              ChanceToUseSpecialization;                     // 0x0014 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class UIDialogResponse*                            Response_Object;                               // 0x0018 (0x0010) [0x0000000000000001] (CPF_Edit)
	class UIDialogResponse*                            Response_Interface;                            // 0x0018 (0x0010) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct GearboxFramework.BehaviorKernel.ProviderRecord
// 0x000C
struct FProviderRecord
{
	class UBehaviorProviderDefinition*                 ProviderDefinition;                            // 0x0000 (0x0008) [0x0000000000000000]               
	int32_t                                            ReferenceCount;                                // 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct GearboxFramework.BehaviorKernel.ProviderRemovalRequest
// 0x0008
struct FProviderRemovalRequest
{
	struct FBehaviorConsumerHandle                     ConsumerHandle;                                // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            ProvidersIndex;                                // 0x0004 (0x0004) [0x0000000000000000]               
};

// ScriptStruct GearboxFramework.IBehaviorConsumer.ReplicatedBehaviorConsumerState
// 0x000C
struct FReplicatedBehaviorConsumerState
{
	uint32_t                                           bIsProcessSuspended : 1;                       // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            BehaviorSequenceEnabledFlags;                  // 0x0004 (0x0004) [0x0000000000000000]               
	uint32_t                                           bNeedToApplyThisState : 1;                     // 0x0008 (0x0004) [0x1000000000000000] [0x00000001] 
};

// ScriptStruct GearboxFramework.IBehaviorConsumer.ReplicatedBehaviorEvent
// 0x0010
struct FReplicatedBehaviorEvent
{
