/*
#############################################################################################
# BattleBorn (1.0.0.0) SDK
# Generated with the CodeRedGenerator v1.0.3
# ========================================================================================= #
# File: GearboxFramework_parameters.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

/*
# ========================================================================================= #
# Parameters
# ========================================================================================= #
*/

// Function GearboxFramework.ActionSequence.TriggerBehavior
// [0x00020401]  (iNative[36571])
struct UActionSequence_execTriggerBehavior_Params
{
	struct FName                                       OutputName;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.ActionSequence.CanRun
// [0x00020C00]  (iNative[14806])
struct UActionSequence_eventCanRun_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequence.ActivateEvent
// [0x00020C02]  (iNative[2481])
struct UActionSequence_eventActivateEvent_Params
{
	struct FName                                       EventName;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.ActionSequence.Update
// [0x00020C02]  (iNative[2482])
struct UActionSequence_eventUpdate_Params
{
};

// Function GearboxFramework.ActionSequence.Init
// [0x00020C00]  (iNative[762])
struct UActionSequence_eventInit_Params
{
};

// Function GearboxFramework.ActionSequence.Stop
// [0x00020C00]  (iNative[623])
struct UActionSequence_eventStop_Params
{
};

// Function GearboxFramework.ActionSequence.Start
// [0x00020C00]  (iNative[14797])
struct UActionSequence_eventStart_Params
{
};

// Function GearboxFramework.ActionSequence.Sleep
// [0x00020409]  (iNative[29170])
struct UActionSequence_execSleep_Params
{
	float                                              Seconds;                                          		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequence.InterruptLatentAction
// [0x00020401]  (iNative[34622])
struct UActionSequence_execInterruptLatentAction_Params
{
};

// Function GearboxFramework.ActionSequence.IsAtomic
// [0x00020401]  (iNative[34647])
struct UActionSequence_execIsAtomic_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequence.StopAtomic
// [0x00020401]  (iNative[36300])
struct UActionSequence_execStopAtomic_Params
{
};

// Function GearboxFramework.ActionSequence.StartAtomic
// [0x00020401]  (iNative[36249])
struct UActionSequence_execStartAtomic_Params
{
};

// Function GearboxFramework.ActionSequencePawn.IsValidTeleportLocation
// [0x00020401]  (iNative[34701])
struct UActionSequencePawn_execIsValidTeleportLocation_Params
{
	struct FVector                                     TestLoc;                                          		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bCheckStaticCollision : 1;                        		// 0x000C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.Teleport
// [0x00020401]  (iNative[1365])
struct UActionSequencePawn_execTeleport_Params
{
	struct FVector                                     TeleportLoc;                                      		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bCheckWorldCollision : 1;                         		// 0x000C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.SetPawnMovementSpeed
// [0x00020400]  (iNative[35917])
struct UActionSequencePawn_execSetPawnMovementSpeed_Params
{
	uint8_t                                            NewPawnMovementSpeed;                             		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.ActionSequencePawn.SetDefaultStanceName
// [0x00020401]  (iNative[35894])
struct UActionSequencePawn_execSetDefaultStanceName_Params
{
	struct FName                                       InDefaultStanceName;                              		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.ActionSequencePawn.GetMoveStyle
// [0x00020401]  (iNative[34134])
struct UActionSequencePawn_execGetMoveStyle_Params
{
	EMoveStyle                                         ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.SetCloakOverride
// [0x00024401]  (iNative[35890])
struct UActionSequencePawn_execSetCloakOverride_Params
{
	uint8_t                                            InOverride;                                       		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bImmediate : 1;                                   		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function GearboxFramework.ActionSequencePawn.CheckCloaked
// [0x00024408]  (iNative[32725])
struct UActionSequencePawn_execCheckCloaked_Params
{
	struct FName                                       CloakState;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bOnlyWaitForAnims : 1;                            		// 0x0008 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.PlaySpecialMove
// [0x00024408]  (iNative[35481])
struct UActionSequencePawn_execPlaySpecialMove_Params
{
	class USpecialMoveDefinition*                      SpecialMove;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              PlayRateScale;                                    		// 0x0008 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	float                                              Duration;                                         		// 0x000C (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FName                                       CallbackName;                                     		// 0x0010 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class UObject*                                     CallbackObject;                                   		// 0x0018 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class UObject*                                     Data;                                             		// 0x0020 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0028 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.WaitForPawnToStop
// [0x00020409]  (iNative[36725])
struct UActionSequencePawn_execWaitForPawnToStop_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.StopMovement
// [0x00020400]  (iNative[36306])
struct UActionSequencePawn_execStopMovement_Params
{
};

// Function GearboxFramework.ActionSequencePawn.FinishedPathFollowing
// [0x00020C02]  (iNative[2483])
struct UActionSequencePawn_eventFinishedPathFollowing_Params
{
};

// Function GearboxFramework.ActionSequencePawn.FinishedPathFinding
// [0x00020C02]  (iNative[2484])
struct UActionSequencePawn_eventFinishedPathFinding_Params
{
};

// Function GearboxFramework.ActionSequencePawn.CreateCustomPath
// [0x00420C02]  (iNative[2485])
struct UActionSequencePawn_eventCreateCustomPath_Params
{
	struct FPathRequestData                            Request;                                          		// 0x0000 (0x0170) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	ECustomPathResult                                  ReturnValue;                                      		// 0x0170 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.PathRequestCustom
// [0x00020401]  (iNative[35378])
struct UActionSequencePawn_execPathRequestCustom_Params
{
};

// Function GearboxFramework.ActionSequencePawn.PathToCustom
// [0x00020408]  (iNative[35383])
struct UActionSequencePawn_execPathToCustom_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.BuildPathCostModifiers
// [0x00020400]  (iNative[32552])
struct UActionSequencePawn_execBuildPathCostModifiers_Params
{
};

// Function GearboxFramework.ActionSequencePawn.PathRequestConstrained
// [0x00424401]  (iNative[35377])
struct UActionSequencePawn_execPathRequestConstrained_Params
{
	uint32_t                                           bSearch : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	class TArray<class UGBXPathConstraint*>            Constraints;                                      		// 0x0008 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class AActor*                                      GoalActor;                                        		// 0x0018 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FVector                                     GoalLoc;                                          		// 0x0020 (0x000C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function GearboxFramework.ActionSequencePawn.PathToConstrained
// [0x00424408]  (iNative[35382])
struct UActionSequencePawn_execPathToConstrained_Params
{
	uint32_t                                           bSearch : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	class TArray<class UGBXPathConstraint*>            Constraints;                                      		// 0x0008 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class AActor*                                      GoalActor;                                        		// 0x0018 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FVector                                     GoalLoc;                                          		// 0x0020 (0x000C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x002C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.PathRequestLocation
// [0x00024401]  (iNative[35380])
struct UActionSequencePawn_execPathRequestLocation_Params
{
	struct FVector                                     GoalLoc;                                          		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              ReachTolerance;                                   		// 0x000C (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function GearboxFramework.ActionSequencePawn.PathToLocation
// [0x00024408]  (iNative[35384])
struct UActionSequencePawn_execPathToLocation_Params
{
	struct FVector                                     GoalLoc;                                          		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	float                                              ReachTolerance;                                   		// 0x000C (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.PathRequestActor
// [0x00024401]  (iNative[35375])
struct UActionSequencePawn_execPathRequestActor_Params
{
	class AActor*                                      GoalActor;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              ReachTolerance;                                   		// 0x0008 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function GearboxFramework.ActionSequencePawn.PathToActor
// [0x00024408]  (iNative[35381])
struct UActionSequencePawn_execPathToActor_Params
{
	class AActor*                                      GoalActor;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              ReachTolerance;                                   		// 0x0008 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.SetPathing
// [0x00020401]  (iNative[35915])
struct UActionSequencePawn_execSetPathing_Params
{
	uint32_t                                           bIsPathing : 1;                                   		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function GearboxFramework.ActionSequencePawn.PathRequestClear
// [0x00020401]  (iNative[35376])
struct UActionSequencePawn_execPathRequestClear_Params
{
};

// Function GearboxFramework.ActionSequencePawn.IsPathing
// [0x00020401]  (iNative[34678])
struct UActionSequencePawn_execIsPathing_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.Path
// [0x00020408]  (iNative[27184])
struct UActionSequencePawn_execPath_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.LocationReachedPathRequest
// [0x00024400]  (iNative[34858])
struct UActionSequencePawn_execLocationReachedPathRequest_Params
{
	struct FVector                                     TestLoc;                                          		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FInfluencePointRef                          InfPoint;                                         		// 0x0010 (0x0010) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0020 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.ReachedPathRequest
// [0x00020400]  (iNative[35606])
struct UActionSequencePawn_execReachedPathRequest_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.PathIsValid
// [0x00424400]  (iNative[35368])
struct UActionSequencePawn_execPathIsValid_Params
{
	struct FPathRequestData                            Request;                                          		// 0x0000 (0x0170) [0x0000000000400190] (CPF_OptionalParm | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0170 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.SetPathRequestGoal
// [0x00424401]  (iNative[35916])
struct UActionSequencePawn_execSetPathRequestGoal_Params
{
	struct FPathRequestData                            Request;                                          		// 0x0000 (0x0170) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	class AActor*                                      GoalActor;                                        		// 0x0170 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FVector                                     GoalLocation;                                     		// 0x0178 (0x000C) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function GearboxFramework.ActionSequencePawn.GetPathDestination
// [0x00020400]  (iNative[34168])
struct UActionSequencePawn_execGetPathDestination_Params
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.GetPathRequestGoal
// [0x00020400]  (iNative[34169])
struct UActionSequencePawn_execGetPathRequestGoal_Params
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActionSequencePawn.Stop
// [0x00020C00]  (iNative[623])
struct UActionSequencePawn_eventStop_Params
{
};

// Function GearboxFramework.ActionSequencePawn.Start
// [0x00020C00]  (iNative[14797])
struct UActionSequencePawn_eventStart_Params
{
};

// Function GearboxFramework.ActionSequencePawn.Init
// [0x00020C00]  (iNative[762])
struct UActionSequencePawn_eventInit_Params
{
};

// Function GearboxFramework.Action_Companion.GoToTeleportState
// [0x00020402]  (iNative[2452])
struct UAction_Companion_execGoToTeleportState_Params
{
};

// Function GearboxFramework.Action_Companion.CheckState
// [0x00020402]  (iNative[2453])
struct UAction_Companion_execCheckState_Params
{
};

// Function GearboxFramework.Action_Dodge.IsDodging
// [0x00020401]  (iNative[34657])
struct UAction_Dodge_execIsDodging_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.Action_Dodge.Start
// [0x00020C00]  (iNative[14797])
struct UAction_Dodge_eventStart_Params
{
};

// Function GearboxFramework.Action_Dodge.CanRun
// [0x00020C00]  (iNative[14806])
struct UAction_Dodge_eventCanRun_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.Action_Dodge.Init
// [0x00020C00]  (iNative[762])
struct UAction_Dodge_eventInit_Params
{
};

// Function GearboxFramework.Action_FollowMoveNodes.InterruptMoveNode
// [0x12020000] 
struct UAction_FollowMoveNodes_execInterruptMoveNode_Params
{
};

// Function GearboxFramework.Action_FollowMoveNodes.InterruptPath
// [0x12020000] 
struct UAction_FollowMoveNodes_execInterruptPath_Params
{
};

// Function GearboxFramework.Action_FollowMoveNodes.ShouldFaceNodeDirection
// [0x12020000] 
struct UAction_FollowMoveNodes_execShouldFaceNodeDirection_Params
{
	class AGearboxAIMoveNode*                          TestNode;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.Action_FollowMoveNodes.SetMoveNode
// [0x12020002] 
struct UAction_FollowMoveNodes_execSetMoveNode_Params
{
	class AGearboxAIMoveNode*                          NewMoveNode;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.Action_FollowMoveNodes.GetFollowNodesCloakName
// [0x12020000] 
struct UAction_FollowMoveNodes_execGetFollowNodesCloakName_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.Action_FollowMoveNodes.GetMoveNode
// [0x12020002] 
struct UAction_FollowMoveNodes_execGetMoveNode_Params
{
	class AGearboxAIMoveNode*                          ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.Action_FollowMoveNodes.CheckStateTransition
// [0x12020002] 
struct UAction_FollowMoveNodes_execCheckStateTransition_Params
{
};

// Function GearboxFramework.Action_FollowMoveNodes.SetMoveFacingPolicy
// [0x12020000] 
struct UAction_FollowMoveNodes_execSetMoveFacingPolicy_Params
{
};

// Function GearboxFramework.Action_FollowMoveNodes.SetMoveNodeSpeed
// [0x12020000] 
struct UAction_FollowMoveNodes_execSetMoveNodeSpeed_Params
{
};

// Function GearboxFramework.Action_Patrol.FindMyPerch
// [0x12020000] 
struct UAction_Patrol_execFindMyPerch_Params
{
};

// Function GearboxFramework.Action_Patrol.GetPatrolWaitTime
// [0x12020000] 
struct UAction_Patrol_execGetPatrolWaitTime_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.Action_Patrol.GetFollowNodesCloakName
// [0x12020000] 
struct UAction_Patrol_execGetFollowNodesCloakName_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.Action_Patrol.SetMoveNode
// [0x16020000] 
struct UAction_Patrol_execSetMoveNode_Params
{
	class AGearboxAIMoveNode*                          NewNode;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.Action_Patrol.GetMoveNode
// [0x16020000] 
struct UAction_Patrol_execGetMoveNode_Params
{
	class AGearboxAIMoveNode*                          ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.Action_Patrol.SetMoveNodeSpeed
// [0x12020000] 
struct UAction_Patrol_execSetMoveNodeSpeed_Params
{
};

// Function GearboxFramework.Action_Patrol.SetMoveFacingPolicy
// [0x12020000] 
struct UAction_Patrol_execSetMoveFacingPolicy_Params
{
};

// Function GearboxFramework.Action_Perch.ShouldFaceNodeDirection
// [0x12020000] 
struct UAction_Perch_execShouldFaceNodeDirection_Params
{
	class AGearboxAIMoveNode*                          TestNode;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.Action_Perch.SetMoveFacingPolicy
// [0x12020000] 
struct UAction_Perch_execSetMoveFacingPolicy_Params
{
};

// Function GearboxFramework.Action_Perch.Start
// [0x12020800] 
struct UAction_Perch_eventStart_Params
{
};

// Function GearboxFramework.Action_Perch.CanRun
// [0x12020800] 
struct UAction_Perch_eventCanRun_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.Action_Scripted.SetMoveNode
// [0x12020000] 
struct UAction_Scripted_execSetMoveNode_Params
{
	class AGearboxAIMoveNode*                          NewNode;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.Action_Scripted.GetMoveNode
// [0x12020000] 
struct UAction_Scripted_execGetMoveNode_Params
{
	class AGearboxAIMoveNode*                          ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.Action_Scripted.SetMoveNodeSpeed
// [0x12020000] 
struct UAction_Scripted_execSetMoveNodeSpeed_Params
{
};

// Function GearboxFramework.Action_Scripted.SetMoveFacingPolicy
// [0x12020000] 
struct UAction_Scripted_execSetMoveFacingPolicy_Params
{
};

// Function GearboxFramework.Action_Scripted.ScriptedAnimFinished
// [0x12020002] 
struct UAction_Scripted_execScriptedAnimFinished_Params
{
	uint32_t                                           bInterrupted : 1;                                 		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function GearboxFramework.Action_Scripted.ScriptedActionEnded
// [0x16020002] 
struct UAction_Scripted_execScriptedActionEnded_Params
{
};

// Function GearboxFramework.Action_Scripted.ScriptedActionStarted
// [0x16020002] 
struct UAction_Scripted_execScriptedActionStarted_Params
{
};

// Function GearboxFramework.Action_Scripted.CheckStateTransition
// [0x12020002] 
struct UAction_Scripted_execCheckStateTransition_Params
{
};

// Function GearboxFramework.Action_Scripted.GetDesiredStateName
// [0x12020000] 
struct UAction_Scripted_execGetDesiredStateName_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.Action_Scripted.Start
// [0x12020800] 
struct UAction_Scripted_eventStart_Params
{
};

// Function GearboxFramework.Action_Scripted.CanRun
// [0x12020800] 
struct UAction_Scripted_eventCanRun_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.Action_MoveTo.GetMoveLocation
// [0x12020000] 
struct UAction_MoveTo_execGetMoveLocation_Params
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.Action_MoveTo.Start
// [0x12020800] 
struct UAction_MoveTo_eventStart_Params
{
};

// Function GearboxFramework.Action_Search.SetSearchLocation
// [0x12020000] 
struct UAction_Search_execSetSearchLocation_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.Action_Search.FinishedLooking
// [0x12020002] 
struct UAction_Search_execFinishedLooking_Params
{
};

// Function GearboxFramework.Action_Search.FinishedSearching
// [0x12020000] 
struct UAction_Search_execFinishedSearching_Params
{
};

// Function GearboxFramework.Action_Search.CheckStateTransition
// [0x12020002] 
struct UAction_Search_execCheckStateTransition_Params
{
};

// Function GearboxFramework.Action_Search.UpdateSearchInfo
// [0x12020002] 
struct UAction_Search_execUpdateSearchInfo_Params
{
};

// Function GearboxFramework.Action_Search.Stop
// [0x12020800] 
struct UAction_Search_eventStop_Params
{
};

// Function GearboxFramework.Action_Search.Start
// [0x12020800] 
struct UAction_Search_eventStart_Params
{
};

// Function GearboxFramework.Action_Search.ActivateEvent
// [0x12020800] 
struct UAction_Search_eventActivateEvent_Params
{
	struct FName                                       EventName;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.Action_Search.CanRun
// [0x12020800] 
struct UAction_Search_eventCanRun_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.ActorAttributeContextResolver.GetAttributeContext
// [0x12020000] 
struct UActorAttributeContextResolver_execGetAttributeContext_Params
{
	class UAttributeDefinitionBase*                    Attribute;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     AttributeContextSource;                           		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.GetAIRangeTime
// [0x00022400]  (iNative[34039])
struct UAIComponent_execGetAIRangeTime_Params
{
	struct FAIRange                                    InRange;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.DecrementConstraintDebugIndex
// [0x00022400]  (iNative[33096])
struct UAIComponent_execDecrementConstraintDebugIndex_Params
{
};

// Function GearboxFramework.AIComponent.IncrementConstraintDebugIndex
// [0x00022400]  (iNative[34517])
struct UAIComponent_execIncrementConstraintDebugIndex_Params
{
};

// Function GearboxFramework.AIComponent.GetPointScore
// [0x00424401]  (iNative[34182])
struct UAIComponent_execGetPointScore_Params
{
	struct FPathRequestData                            Request;                                          		// 0x0000 (0x0170) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	struct FVector                                     TestLoc;                                          		// 0x0170 (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	uint32_t                                           bRanged : 1;                                      		// 0x017C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	struct FInfluencePointRef                          InfPoint;                                         		// 0x0180 (0x0010) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      Target;                                           		// 0x0190 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bInitialize : 1;                                  		// 0x0198 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	float                                              ReturnValue;                                      		// 0x019C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.GetLocationScore
// [0x00424401]  (iNative[34129])
struct UAIComponent_execGetLocationScore_Params
{
	struct FPathRequestData                            Request;                                          		// 0x0000 (0x0170) [0x0000000000400182] (CPF_Const | CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	struct FVector                                     TestLoc;                                          		// 0x0170 (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	uint32_t                                           bRanged : 1;                                      		// 0x017C (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	class AActor*                                      Target;                                           		// 0x0180 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           bInitialize : 1;                                  		// 0x0188 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	float                                              ReturnValue;                                      		// 0x018C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.WithinValidSpace
// [0x00420400]  (iNative[36751])
struct UAIComponent_execWithinValidSpace_Params
{
	struct FVector                                     TestLoc;                                          		// 0x0000 (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	struct FInfluencePointRef                          InfPoint;                                         		// 0x0010 (0x0010) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bRanged : 1;                                      		// 0x0020 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0024 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.SetMaxInfluencePointTime
// [0x00020401]  (iNative[35904])
struct UAIComponent_execSetMaxInfluencePointTime_Params
{
	float                                              MaxTime;                                          		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.GetInfluenceMap
// [0x00020401]  (iNative[34112])
struct UAIComponent_execGetInfluenceMap_Params
{
	class AGBXInfluenceMap*                            ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.UpdateInfluencePoint
// [0x00020401]  (iNative[36616])
struct UAIComponent_execUpdateInfluencePoint_Params
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.InvalidateInfluencePoint
// [0x00024401]  (iNative[34635])
struct UAIComponent_execInvalidateInfluencePoint_Params
{
	float                                              InvalidTime;                                      		// 0x0000 (0x0004) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function GearboxFramework.AIComponent.MarkCurrentInfluencePoint
// [0x00020401]  (iNative[34882])
struct UAIComponent_execMarkCurrentInfluencePoint_Params
{
};

// Function GearboxFramework.AIComponent.CalcBestTrajectoryParams
// [0x00422400]  (iNative[32645])
struct UAIComponent_execCalcBestTrajectoryParams_Params
{
	struct FVector                                     StartLoc;                                         		// 0x0000 (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	struct FVector                                     EndLoc;                                           		// 0x000C (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	float                                              LeapGravity;                                      		// 0x0018 (0x0004) [0x0000000000000082] (CPF_Const | CPF_Parm)
	float                                              OutSpeed;                                         		// 0x001C (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              OutAngle;                                         		// 0x0020 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function GearboxFramework.AIComponent.CalcTrajectoryByTime
// [0x00422400]  (iNative[32649])
struct UAIComponent_execCalcTrajectoryByTime_Params
{
	struct FVector                                     StartLoc;                                         		// 0x0000 (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	struct FVector                                     EndLoc;                                           		// 0x000C (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	float                                              LeapTime;                                         		// 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              LeapGravity;                                      		// 0x001C (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     OutVelocity;                                      		// 0x0020 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function GearboxFramework.AIComponent.CalcTrajectoryAtActor
// [0x00422400]  (iNative[32648])
struct UAIComponent_execCalcTrajectoryAtActor_Params
{
	class AActor*                                      Source;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      Target;                                           		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FTrajectoryData                             Data;                                             		// 0x0010 (0x0024) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	float                                              OutTime;                                          		// 0x0034 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              OutGravity;                                       		// 0x0038 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     OutVelocity;                                      		// 0x003C (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function GearboxFramework.AIComponent.CalcTrajectory
// [0x00422400]  (iNative[32647])
struct UAIComponent_execCalcTrajectory_Params
{
	struct FVector                                     StartLoc;                                         		// 0x0000 (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	struct FVector                                     EndLoc;                                           		// 0x000C (0x000C) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	float                                              LeapSpeed;                                        		// 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              LeapAngle;                                        		// 0x001C (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              OutTime;                                          		// 0x0020 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	float                                              OutGravity;                                       		// 0x0024 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	struct FVector                                     OutVelocity;                                      		// 0x0028 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function GearboxFramework.AIComponent.GetTrajectoryOffset
// [0x00022400]  (iNative[34249])
struct UAIComponent_execGetTrajectoryOffset_Params
{
	float                                              OffsetTime;                                       		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              TotalTime;                                        		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              Gravity;                                          		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     StartVelocity;                                    		// 0x000C (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     ReturnValue;                                      		// 0x0018 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.LogDemigodHolds
// [0x12020000] 
struct UAIComponent_execLogDemigodHolds_Params
{
};

// Function GearboxFramework.AIComponent.ReleaseDialog
// [0x00020400]  (iNative[35648])
struct UAIComponent_execReleaseDialog_Params
{
	struct FName                                       HoldName;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Tag;                                              		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.HoldDialog
// [0x00020400]  (iNative[34458])
struct UAIComponent_execHoldDialog_Params
{
	struct FName                                       HoldName;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Tag;                                              		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.DialogOnHold
// [0x00020400]  (iNative[33219])
struct UAIComponent_execDialogOnHold_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.ReleaseGod
// [0x00020400]  (iNative[35649])
struct UAIComponent_execReleaseGod_Params
{
	struct FName                                       HoldName;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Tag;                                              		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.HoldGod
// [0x00020400]  (iNative[34460])
struct UAIComponent_execHoldGod_Params
{
	struct FName                                       HoldName;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Tag;                                              		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.GodOnHold
// [0x00020400]  (iNative[34274])
struct UAIComponent_execGodOnHold_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.ReleaseDemigod
// [0x00020400]  (iNative[35647])
struct UAIComponent_execReleaseDemigod_Params
{
	struct FName                                       HoldName;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Tag;                                              		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.HoldDemigod
// [0x00020400]  (iNative[34457])
struct UAIComponent_execHoldDemigod_Params
{
	struct FName                                       HoldName;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Tag;                                              		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.DemigodOnHold
// [0x00020400]  (iNative[33175])
struct UAIComponent_execDemigodOnHold_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.ReleaseMovement
// [0x00020400]  (iNative[35650])
struct UAIComponent_execReleaseMovement_Params
{
	struct FName                                       HoldName;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Tag;                                              		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.HoldMovement
// [0x00020400]  (iNative[34461])
struct UAIComponent_execHoldMovement_Params
{
	struct FName                                       HoldName;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Tag;                                              		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.MovementOnHold
// [0x00020400]  (iNative[35000])
struct UAIComponent_execMovementOnHold_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.ReleaseTarget
// [0x00020400]  (iNative[35651])
struct UAIComponent_execReleaseTarget_Params
{
	struct FName                                       HoldName;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Tag;                                              		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.HoldTarget
// [0x00020400]  (iNative[34466])
struct UAIComponent_execHoldTarget_Params
{
	struct FName                                       HoldName;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Tag;                                              		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.TargetOnHold
// [0x00020400]  (iNative[36396])
struct UAIComponent_execTargetOnHold_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.ReleaseType
// [0x00020400]  (iNative[35652])
struct UAIComponent_execReleaseType_Params
{
	uint8_t                                            HoldType;                                         		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       HoldName;                                         		// 0x0004 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Tag;                                              		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.HoldType
// [0x00020400]  (iNative[34468])
struct UAIComponent_execHoldType_Params
{
	uint8_t                                            HoldType;                                         		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       HoldName;                                         		// 0x0004 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Tag;                                              		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.Release
// [0x00020400]  (iNative[35646])
struct UAIComponent_execRelease_Params
{
	struct FName                                       HoldName;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Tag;                                              		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.Hold
// [0x00020400]  (iNative[34456])
struct UAIComponent_execHold_Params
{
	struct FName                                       HoldName;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     Tag;                                              		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.OnHold
// [0x00020400]  (iNative[35277])
struct UAIComponent_execOnHold_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.GetSoundSenseModifier
// [0x00020401]  (iNative[34213])
struct UAIComponent_execGetSoundSenseModifier_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.GetSightSenseModifier
// [0x00020401]  (iNative[34207])
struct UAIComponent_execGetSightSenseModifier_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.GetAwarenessMeter
// [0x00020401]  (iNative[34048])
struct UAIComponent_execGetAwarenessMeter_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.GetAwareness
// [0x00020401]  (iNative[34047])
struct UAIComponent_execGetAwareness_Params
{
	EAwareness                                         ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.UpdateAwareness
// [0x00020401]  (iNative[36609])
struct UAIComponent_execUpdateAwareness_Params
{
};

// Function GearboxFramework.AIComponent.GetNumValidHumanTargets
// [0x00020401]  (iNative[34156])
struct UAIComponent_execGetNumValidHumanTargets_Params
{
	int32_t                                            ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.GetTargetRecordFor
// [0x00024400]  (iNative[34239])
struct UAIComponent_execGetTargetRecordFor_Params
{
	class AActor*                                      Target;                                           		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bTryParent : 1;                                   		// 0x0008 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class UMindTargetInfo*                             ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.GetTargetRecord
// [0x00024400]  (iNative[34238])
struct UAIComponent_execGetTargetRecord_Params
{
	uint32_t                                           bTryParent : 1;                                   		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	class UMindTargetInfo*                             ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.IsTarget
// [0x00020400]  (iNative[34697])
struct UAIComponent_execIsTarget_Params
{
	class AActor*                                      TestTarget;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.GetNumValidTargets
// [0x00020400]  (iNative[34157])
struct UAIComponent_execGetNumValidTargets_Params
{
	int32_t                                            ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.GetTarget
// [0x00020400]  (iNative[34236])
struct UAIComponent_execGetTarget_Params
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.HasTarget
// [0x00020402]  (iNative[2486])
struct UAIComponent_execHasTarget_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.NotifyAttackedBy
// [0x00020400]  (iNative[35182])
struct UAIComponent_execNotifyAttackedBy_Params
{
	class AActor*                                      Attacker;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.SetScriptedNode
// [0x00020401]  (iNative[35930])
struct UAIComponent_execSetScriptedNode_Params
{
	class AGearboxAIMoveNode*                          InScriptedNode;                                   		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.GetScriptedNode
// [0x00020401]  (iNative[34202])
struct UAIComponent_execGetScriptedNode_Params
{
	class AGearboxAIMoveNode*                          ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.HasScriptedNode
// [0x00020401]  (iNative[34324])
struct UAIComponent_execHasScriptedNode_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.SetScriptedAction
// [0x00020401]  (iNative[35929])
struct UAIComponent_execSetScriptedAction_Params
{
	class USeqAct_AIScripted*                          InScriptedAction;                                 		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function GearboxFramework.AIComponent.ClearScriptedAction
// [0x00024401]  (iNative[32758])
struct UAIComponent_execClearScriptedAction_Params
{
	uint32_t                                           bInterrupted : 1;                                 		// 0x0000 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
};

// Function GearboxFramework.AIComponent.GetScriptedAction
// [0x00020401]  (iNative[34201])
struct UAIComponent_execGetScriptedAction_Params
{
	class USeqAct_AIScripted*                          ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.HasScriptedAction
// [0x00020401]  (iNative[34323])
struct UAIComponent_execHasScriptedAction_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponent.GetParentComponent
// [0x00020401]  (iNative[34166])
struct UAIComponent_execGetParentComponent_Params
{
	class UAIComponent*                                ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000004000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_EditInline)
};

// Function GearboxFramework.AIComponent.GetAllegiance
// [0x00020400]  (iNative[34040])
struct UAIComponent_execGetAllegiance_Params
{
	class UPawnAllegiance*                             ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIComponentAttributeContextResolver.GetAttributeContext
// [0x12020000] 
struct UAIComponentAttributeContextResolver_execGetAttributeContext_Params
{
	class UAttributeDefinitionBase*                    Attribute;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     AttributeContextSource;                           		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ReturnValue;                                      		// 0x0010 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AICostExpressionEvaluator.Evaluate
// [0x00020400]  (iNative[22809])
struct UAICostExpressionEvaluator_execEvaluate_Params
{
	class UObject*                                     ContextSource;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function GearboxFramework.AIDebugCamera.GetDebugMind
// [0x00022400]  (iNative[34076])
