/*
#############################################################################################
# BattleBorn (1.0.0.0) SDK
# Generated with the CodeRedGenerator v1.0.3
# ========================================================================================= #
# File: PoplarGame_structs.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

/*
# ========================================================================================= #
# Structs
# ========================================================================================= #
*/

// ScriptStruct PoplarGame.Action_BotUseActionSkill.BotUseActionSkillSecondaryActionSkillData
// 0x0011
struct FBotUseActionSkillSecondaryActionSkillData
{
	float                                              RunAfter;                                      // 0x0000 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class UExpressionEvaluator*                        RunIf;                                         // 0x0008 (0x0008) [0x0000000004000003] (CPF_Edit | CPF_Const | CPF_EditInline)
	uint8_t                                            Context;                                       // 0x0010 (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct PoplarGame.AssistModifiersDefinition.AssistStreakTier
// 0x0004
struct FAssistStreakTier
{
	int32_t                                            Threshold;                                     // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct PoplarGame.AssistModifiersDefinition.AssistModifier
// 0x00C8
struct FAssistModifier
{
	uint8_t                                            Type;                                          // 0x0000 (0x0001) [0x0000000000000001] (CPF_Edit)    
	struct FAttributeInitializationData                XPModifier;                                    // 0x0008 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                ScoreAwarded;                                  // 0x0028 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                AssistStatScoreModifier;                       // 0x0048 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                AssistStatXPModifier;                          // 0x0068 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class FString                                      Title;                                         // 0x0088 (0x0010) [0x0000000000408003] (CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink)
	class FString                                      FlashFrameName;                                // 0x0098 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	int32_t                                            Priority;                                      // 0x00A8 (0x0004) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
	int32_t                                            AssistModifiersArrayIndex;                     // 0x00AC (0x0004) [0x0000000000000000]               
	uint32_t                                           bTrackForPostMatchAwards : 1;                  // 0x00B0 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	class UStatDefinition*                             AssistModifierStat;                            // 0x00B8 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class USwfMovie*                                   DisplayIcon;                                   // 0x00C0 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct PoplarGame.AssistModifiersDefinition.AssistCombo
// 0x00B4
struct FAssistCombo
{
	class TArray<uint8_t>                              AssistModifiers;                               // 0x0000 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	struct FAttributeInitializationData                XPModifier;                                    // 0x0010 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                ScoreAwarded;                                  // 0x0030 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                AssistStatScoreModifier;                       // 0x0050 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                AssistStatXPModifier;                          // 0x0070 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class FString                                      Title;                                         // 0x0090 (0x0010) [0x0000000000408003] (CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink)
	class TArray<class FString>                        IconFrameNames;                                // 0x00A0 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	int32_t                                            AssistCombosArrayIndex;                        // 0x00B0 (0x0004) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.AssistModifiersDefinition.AssistModAwardData
// 0x0018
struct FAssistModAwardData
{
	class APoplarPlayerReplicationInfo*                PPRI;                                          // 0x0000 (0x0008) [0x0000000000000000]               
	float                                              XPModifierToAward;                             // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              ScoreToAward;                                  // 0x000C (0x0004) [0x0000000000000000]               
	float                                              AssistStatXPModifierToAward;                   // 0x0010 (0x0004) [0x0000000000000000]               
	float                                              AssistStatScoreModifierToAward;                // 0x0014 (0x0004) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.IAttackSequence.AttackMovementActions
// 0x0004
struct FAttackMovementActions
{
	uint32_t                                           bForward : 1;                                  // 0x0000 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bBack : 1;                                     // 0x0000 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bLeft : 1;                                     // 0x0000 (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bRight : 1;                                    // 0x0000 (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
	uint32_t                                           bNotMoving : 1;                                // 0x0000 (0x0004) [0x0000000000000001] [0x00000010] (CPF_Edit)
	uint32_t                                           bInAir : 1;                                    // 0x0000 (0x0004) [0x0000000000000001] [0x00000020] (CPF_Edit)
	uint32_t                                           bSprinting : 1;                                // 0x0000 (0x0004) [0x0000000000000001] [0x00000040] (CPF_Edit)
	uint32_t                                           bJumping : 1;                                  // 0x0000 (0x0004) [0x0000000000000001] [0x00000080] (CPF_Edit)
};

// ScriptStruct PoplarGame.AttackSeqNode.AttackActionOutputLinkDescriptionData
// 0x0004
struct FAttackActionOutputLinkDescriptionData
{
	int32_t                                            LinkId;                                        // 0x0000 (0x0004) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.AttackSequenceDefinition.AttackStateData
// 0x0004
struct FAttackStateData
{
	int32_t                                            OutputLinks;                                   // 0x0000 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct PoplarGame.AttackSequenceDefinition.AttackActionOutputLinkData
// 0x0004
struct FAttackActionOutputLinkData
{
	int32_t                                            LinkIdAndLinkedAction;                         // 0x0000 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct PoplarGame.AttackSequenceDefinition.AttackSequenceActionData
// 0x000C (0x0004 - 0x0010)
struct FAttackSequenceActionData : FAttackStateData
{
	class UAttackSeqNode*                              Action;                                        // 0x0008 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct PoplarGame.ICreditsProvider.TeamCreditsTypeRewardFormula
// 0x0050
struct FTeamCreditsTypeRewardFormula
{
	uint32_t                                           bUseSharesSystem : 1;                          // 0x0000 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	float                                              NumberOfSharesForKiller;                       // 0x0004 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              NumberOfSharesForNonKiller;                    // 0x0008 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                CreditsPercentageAwardedToKillerFormula;       // 0x0010 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                CreditsPercentageAwardedToNonKillerFormula;    // 0x0030 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct PoplarGame.ICreditsProvider.CreditsProviderData
// 0x0028
struct FCreditsProviderData
{
	uint32_t                                           bDenyCreditsRewardIfKillerIsStationaryUnit : 1;// 0x0000 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint8_t                                            DeathShouldRewardCreditsToTeam;                // 0x0004 (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                CreditsToAwardOnDeathFormula;                  // 0x0008 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct PoplarGame.PoplarTypes.ChallengePatchData
// 0x0010
struct FChallengePatchData
{
	class UPoplarChallengeDefinition*                  ChallengeDef;                                  // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            ChallengeLevel;                                // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	int32_t                                            OldValue;                                      // 0x000C (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct PoplarGame.PoplarTypes.PoplarMetaReward
// 0x0038
struct FPoplarMetaReward
{
	int32_t                                            PlayerExperience;                              // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            CharacterExperience;                           // 0x0004 (0x0004) [0x0000000000000000]               
	int32_t                                            EarnedCurrency;                                // 0x0008 (0x0004) [0x0000000000000000]               
	int32_t                                            PremiumCurrency;                               // 0x000C (0x0004) [0x0000000000000000]               
	class UPoplarMetaItemDefinition* MetaItemDefinition;                            // 0x0010 (0x0008) [0x0000000000000000]               
	class UPoplarPerkFunction* PerkItemDefinition;                            // 0x0018 (0x0008) [0x0000000000000000]               
	class UUnlockDefinition* AssociatedUnlock;                              // 0x0020 (0x0008) [0x0000000000000000]               
	class FString                                      ApolloJSON;                                    // 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct PoplarGame.PoplarTypes.ChallengeUpdate
// 0x0070
struct FChallengeUpdate
{
	uint32_t                                           bComplete : 1;                                 // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	class UPoplarChallengeDefinition*                  ChallengeDefinition;                           // 0x0008 (0x0008) [0x0000000000000000]               
	int32_t                                            LevelIndex;                                    // 0x0010 (0x0004) [0x0000000000000000]               
	int32_t                                            TargetSum;                                     // 0x0014 (0x0004) [0x0000000000000000]               
	int32_t                                            ProgressSum;                                   // 0x0018 (0x0004) [0x0000000000000000]               
	class FString                                      ChallengeAssetTrackerKey;                      // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           bHasMetaReward : 1;                            // 0x0030 (0x0004) [0x0000000000000000] [0x00000001] 
	struct FPoplarMetaReward                           MetaReward;                                    // 0x0038 (0x0038) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct PoplarGame.PoplarTypes.CharacterStat
// 0x0029
struct FCharacterStat
{
	class UStatDefinition*                             StatDef;                                       // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class FString                                      DisplayString;                                 // 0x0008 (0x0010) [0x0000000000408003] (CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink)
	class USwfMovie*                                   DisplayIcon;                                   // 0x0018 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UMarkupAttributePresentationDefinition*      StatPresentatonDef;                            // 0x0020 (0x0008) [0x0000000004000003] (CPF_Edit | CPF_Const | CPF_EditInline)
	uint8_t                                            UIPosition;                                    // 0x0028 (0x0001) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct PoplarGame.PoplarTypes.PoplarScoreboardPlayerSelectList
// 0x0014
struct FPoplarScoreboardPlayerSelectList
{
	class TArray<struct FPoplarScoreboardPlayerSelectPlayer> SelectablePlayerOrdering;                      // 0x0000 (0x0010) [0x0000000000402000] (CPF_Transient | CPF_NeedCtorLink)
	int32_t                                            SelectedIndex;                                 // 0x0010 (0x0004) [0x0000000000002000] (CPF_Transient)
};

// ScriptStruct PoplarGame.PoplarTypes.PoplarScoreboardPlayerSelectPlayer
// 0x0008
struct FPoplarScoreboardPlayerSelectPlayer
{
	int32_t                                            TeamIndex;                                     // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            PlayerIndex;                                   // 0x0004 (0x0004) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.PoplarTypes.TeammateCompareStat
// 0x0021
struct FTeammateCompareStat
{
	class FString                                      StatName;                                      // 0x0000 (0x0010) [0x0000000000500000] (CPF_NeedCtorLink)
	class TArray<struct FTeammateStatCompareEntry>     Entries;                                       // 0x0010 (0x0010) [0x0000000000500000] (CPF_NeedCtorLink)
	uint8_t                                            PlayerOrdering;                                // 0x0020 (0x0001) [0x0000000000100000]               
};

// ScriptStruct PoplarGame.PoplarTypes.TeammateStatCompareEntry
// 0x0008
struct FTeammateStatCompareEntry
{
	int32_t                                            PlayerTeamIndex;                               // 0x0000 (0x0004) [0x0000000000100000]               
	int32_t                                            PlayerStat;                                    // 0x0004 (0x0004) [0x0000000000100000]               
};

// ScriptStruct PoplarGame.PoplarTypes.PlayerMatchResultData
// 0x0138
struct FPlayerMatchResultData
{
	uint8_t                                            Outcome;                                       // 0x0000 (0x0001) [0x0000000000000000]               
	int32_t                                            PreviousEarnedCurrency;                        // 0x0004 (0x0004) [0x0000000000000000]               
	int32_t                                            CurrentEarnedCurrency;                         // 0x0008 (0x0004) [0x0000000000000000]               
	int32_t                                            PreviousCharacterTokens;                       // 0x000C (0x0004) [0x0000000000000000]               
	int32_t                                            CurrentCharacterTokens;                        // 0x0010 (0x0004) [0x0000000000000000]               
	class TArray<struct FCharacterTokenPair>           RefundedCharacterTokens;                       // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            BaseMetaXP;                                    // 0x0028 (0x0004) [0x0000000000000000]               
	int32_t                                            BonusMetaXP;                                   // 0x002C (0x0004) [0x0000000000000000]               
	int32_t                                            RewardsMetaXP;                                 // 0x0030 (0x0004) [0x0000000000000000]               
	int32_t                                            RewardsBonusMetaXP;                            // 0x0034 (0x0004) [0x0000000000000000]               
	int32_t                                            BaseEarnedCurrency;                            // 0x0038 (0x0004) [0x0000000000000000]               
	int32_t                                            BonusEarnedCurrency;                           // 0x003C (0x0004) [0x0000000000000000]               
	int32_t                                            RewardsEC;                                     // 0x0040 (0x0004) [0x0000000000000000]               
	int32_t                                            RewardsBonusEC;                                // 0x0044 (0x0004) [0x0000000000000000]               
	int32_t                                            BaseCharacterXP;                               // 0x0048 (0x0004) [0x0000000000000000]               
	int32_t                                            BonusAndRewardsCharacterXP;                    // 0x004C (0x0004) [0x0000000000000000]               
	int32_t                                            PreviousMetaXP;                                // 0x0050 (0x0004) [0x0000000000000000]               
	int32_t                                            CurrentMetaXP;                                 // 0x0054 (0x0004) [0x0000000000000000]               
	int32_t                                            MetaLevel;                                     // 0x0058 (0x0004) [0x0000000000000000]               
	int32_t                                            PreviousMetaLevel;                             // 0x005C (0x0004) [0x0000000000000000]               
	int32_t                                            MaxMetaLevel;                                  // 0x0060 (0x0004) [0x0000000000000000]               
	class FString                                      CharacterId;                                   // 0x0068 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      CharacterSkinID;                               // 0x0078 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            PreviousCharacterXP;                           // 0x0088 (0x0004) [0x0000000000000000]               
	int32_t                                            CurrentCharacterXP;                            // 0x008C (0x0004) [0x0000000000000000]               
	int32_t                                            CharacterLevel;                                // 0x0090 (0x0004) [0x0000000000000000]               
	int32_t                                            MaxCharacterLevel;                             // 0x0094 (0x0004) [0x0000000000000000]               
	int32_t                                            PreviousCharacterLevel;                        // 0x0098 (0x0004) [0x0000000000000000]               
	class TArray<struct FMatchResultDataRewardModifier> RewardModifiers;                               // 0x00A0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<class FString>                        CharacterMatchRewardIds;                       // 0x00B0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<class FString>                        ProfileMatchRewardIds;                         // 0x00C0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<class FString>                        MatchRewardIds;                                // 0x00D0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FLevelXPThreshold>             MetaLevelXPThresholds;                         // 0x00E0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FLevelXPThreshold>             CharacterLevelXPThresholds;                    // 0x00F0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	struct FUniqueNetId                                PlayerUniqueId;                                // 0x0100 (0x0014) [0x0000000000000000]               
	struct FPlatformUserId                             PlayerID;                                      // 0x0114 (0x0008) [0x0000000000000000]               
	class FString                                      JobGuid;                                       // 0x0120 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            ServiceResult;                                 // 0x0130 (0x0004) [0x0000000000000000]               
	int32_t                                            NumMatchResultRetrievalAttempts;               // 0x0134 (0x0004) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.PoplarTypes.CharacterTokenPair
// 0x0014
struct FCharacterTokenPair
{
	class FString                                      CharacterId;                                   // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            NumTokens;                                     // 0x0010 (0x0004) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.PoplarTypes.MatchResultDataRewardModifier
// 0x0015
struct FMatchResultDataRewardModifier
{
	class FString                                      Id;                                            // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            Modifier;                                      // 0x0010 (0x0004) [0x0000000000000000]               
	uint8_t                                            Type;                                          // 0x0014 (0x0001) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.PoplarTypes.LevelXPThreshold
// 0x0008
struct FLevelXPThreshold
{
	int32_t                                            Level;                                         // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            XPRequiredForLevel;                            // 0x0004 (0x0004) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.PoplarTypes.BuffStateInfo
// 0x0028
struct FBuffStateInfo
{
	class UPoplarBuffDefinition*                       BuffDefinition;                                // 0x0000 (0x0008) [0x0000000000000000]               
	class APoplarPlayerReplicationInfo*                InstigatingPRI;                                // 0x0008 (0x0008) [0x0000000000000000]               
	float                                              TimeStarted;                                   // 0x0010 (0x0004) [0x0000000000000000]               
	float                                              TimeRemaining;                                 // 0x0014 (0x0004) [0x0000000000000000]               
	float                                              Duration;                                      // 0x0018 (0x0004) [0x0000000000000000]               
	int32_t                                            Stacks;                                        // 0x001C (0x0004) [0x0000000000000000]               
	uint8_t                                            FlashCount;                                    // 0x0020 (0x0001) [0x0000000000000000]               
	int32_t                                            SourcePerkIndex;                               // 0x0024 (0x0004) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.PoplarTypes.WeakUPtr_map
// 0x0008
struct FWeakUPtr_map
{
	int32_t                                            ObjectIndex;                                   // 0x0000 (0x0004) [0x0000000000002000] (CPF_Transient)
	int32_t                                            ObjectSerialNumber;                            // 0x0004 (0x0004) [0x0000000000002000] (CPF_Transient)
};

// ScriptStruct PoplarGame.PoplarTypes.CombatModifierAchievedData
// 0x0044
struct FCombatModifierAchievedData
{
	uint32_t                                           bIsKillMod : 1;                                // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	class FString                                      Title;                                         // 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Description;                                   // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            NumTimesAchieved;                              // 0x0028 (0x0004) [0x0000000000000000]               
	class FString                                      IconPath;                                      // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            Priority;                                      // 0x0040 (0x0004) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.PoplarTypes.sMatchInfo
// 0x00BC
struct FsMatchInfo
{
	class FString                                      MatchDate;                                     // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      MapName;                                       // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      GameMode;                                      // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      MapDifficultyMode;                             // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      MapHardcoreMode;                               // 0x0040 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      TeamSizeDim;                                   // 0x0050 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      GameModeDim;                                   // 0x0060 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      LevelDim;                                      // 0x0070 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           IsPvE : 1;                                     // 0x0080 (0x0004) [0x0000000000000000] [0x00000001] 
	int32_t                                            MatchTime;                                     // 0x0084 (0x0004) [0x0000000000000000]               
	class FString                                      MatchDateUTC;                                  // 0x0088 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            Result;                                        // 0x0098 (0x0004) [0x0000000000000000]               
	class FString                                      MatchEndReason;                                // 0x00A0 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            TeamAScore;                                    // 0x00B0 (0x0004) [0x0000000000000000]               
	int32_t                                            TeamBScore;                                    // 0x00B4 (0x0004) [0x0000000000000000]               
	int32_t                                            TeamModeBonus;                                 // 0x00B8 (0x0004) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.PoplarTypes.sStatInfo
// 0x004D
struct FsStatInfo
{
	class FString                                      StatName;                                      // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            UIPosition;                                    // 0x0010 (0x0004) [0x0000000000000000]               
	int32_t                                            StatValue;                                     // 0x0014 (0x0004) [0x0000000000000000]               
	int32_t                                            StatStartingValue;                             // 0x0018 (0x0004) [0x0000000000000000]               
	class FString                                      StatValueString;                               // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            PersonalBest;                                  // 0x0030 (0x0004) [0x0000000000000000]               
	uint32_t                                           bNewPersonalBest : 1;                          // 0x0034 (0x0004) [0x0000000000000000] [0x00000001] 
	class FString                                      StatIconPath;                                  // 0x0038 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           bTeamBest : 1;                                 // 0x0048 (0x0004) [0x0000000000000000] [0x00000001] 
	uint8_t                                            PlayerOrdering;                                // 0x004C (0x0001) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.PoplarTypes.sChallengeInfo
// 0x00C8
struct FsChallengeInfo
{
	class FString                                      RawName;                                       // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      Name;                                          // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      RankString;                                    // 0x0020 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      DisplayValue;                                  // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            CurrentValue;                                  // 0x0040 (0x0004) [0x0000000000000000]               
	int32_t                                            TargetValue;                                   // 0x0044 (0x0004) [0x0000000000000000]               
	int32_t                                            Progress;                                      // 0x0048 (0x0004) [0x0000000000000000]               
	int32_t                                            Level;                                         // 0x004C (0x0004) [0x0000000000000000]               
	class FString                                      Description;                                   // 0x0050 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class UPoplarChallengeDefinition*                  ChallengeDef;                                  // 0x0060 (0x0008) [0x0000000000000000]               
	class FString                                      RewardName0;                                   // 0x0068 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      RewardName1;                                   // 0x0078 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      RewardName2;                                   // 0x0088 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      RewardIconPath0;                               // 0x0098 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      RewardIconPath1;                               // 0x00A8 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      RewardIconPath2;                               // 0x00B8 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct PoplarGame.PoplarTypes.sGearInfo
// 0x0018
struct FsGearInfo
{
	class FString                                      ApolloJSON;                                    // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            ItemLevel;                                     // 0x0010 (0x0004) [0x0000000000000000]               
	uint32_t                                           bActivated : 1;                                // 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct PoplarGame.PoplarTypes.sPlayerInfo
// 0x00C8
struct FsPlayerInfo
{
	struct FUniqueNetId                                UniqueId;                                      // 0x0000 (0x0014) [0x0000000000000000]               
	uint32_t                                           bIsBot : 1;                                    // 0x0014 (0x0004) [0x0000000000000000] [0x00000001] 
	class FString                                      PlayerName;                                    // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            PlayerLevel;                                   // 0x0028 (0x0004) [0x0000000000000000]               
	class FString                                      CharacterId;                                   // 0x0030 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      CharacterSkin;                                 // 0x0040 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           IsPrimary : 1;                                 // 0x0050 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           IsSecondary : 1;                               // 0x0050 (0x0004) [0x0000000000000000] [0x00000002] 
	class TArray<struct FsStatInfo>                    PrimaryStats;                                  // 0x0058 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FsStatInfo>                    CharacterStats;                                // 0x0068 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FsStatInfo>                    RawStats;                                      // 0x0078 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FsChallengeInfo>               CompletedChallenges;                           // 0x0088 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FCombatModifierAchievedData>   CombatModifiersAchieved;                       // 0x0098 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<class FString>                        PostMatchEntitlements;                         // 0x00A8 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FsGearInfo>                    GearInfos;                                     // 0x00B8 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct PoplarGame.PoplarTypes.sTeamInfo
// 0x0028
struct FsTeamInfo
{
	int32_t                                            TeamIndex;                                     // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            TeamScore;                                     // 0x0004 (0x0004) [0x0000000000000000]               
	class TArray<struct FsPlayerInfo>                  Players;                                       // 0x0008 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class TArray<struct FsStatInfo>                    TotalStats;                                    // 0x0018 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct PoplarGame.PoplarTypes.sPostMatchData
// 0x0370
struct FsPostMatchData
{
	class FString                                      MatchId;                                       // 0x0000 (0x0010) [0x0000000000500000] (CPF_NeedCtorLink)
	struct FPlatformUserId                             PlayerID;                                      // 0x0010 (0x0008) [0x0000000000100000]               
	struct FsMatchInfo                                 MatchInfo;                                     // 0x0018 (0x00C0) [0x0000000000500000] (CPF_NeedCtorLink)
	class TArray<struct FsTeamInfo>                    Teams;                                         // 0x00D8 (0x0010) [0x0000000000500000] (CPF_NeedCtorLink)
	int32_t                                            PrimaryPlayerTeamIndex;                        // 0x00E8 (0x0004) [0x0000000000100000]               
	uint32_t                                           IsPrimaryPlayerSpectator : 1;                  // 0x00EC (0x0004) [0x0000000000100000] [0x00000001] 
	class TArray<struct FTeammateCompareStat>          TeammateComparisonStats;                       // 0x00F0 (0x0010) [0x0000000000500000] (CPF_NeedCtorLink)
	struct FPlayerMatchResultData                      MatchResultData;                               // 0x0100 (0x0138) [0x0000000000500000] (CPF_NeedCtorLink)
	struct FPlayerMatchResultData                      SplitScreenMatchResultData;                    // 0x0238 (0x0138) [0x0000000000500000] (CPF_NeedCtorLink)
};

// ScriptStruct PoplarGame.PoplarTypes.PoplarMatchHistoryEntry
// 0x005C
struct FPoplarMatchHistoryEntry
{
	class FString                                      MatchId;                                       // 0x0000 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      GameModeName;                                  // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	int32_t                                            MatchResult;                                   // 0x0020 (0x0004) [0x0000000000000000]               
	class FString                                      MatchDateUTC;                                  // 0x0028 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      MapName;                                       // 0x0038 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	class FString                                      CharacterName;                                 // 0x0048 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
	uint32_t                                           bSpectator : 1;                                // 0x0058 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct PoplarGame.PoplarTypes.MatchHistoryEntrySet
// 0x0020
struct FMatchHistoryEntrySet
{
	struct FPlatformUserId                             PlayerID;                                      // 0x0000 (0x0008) [0x0000000000000000]               
	int32_t                                            StartIndex;                                    // 0x0008 (0x0004) [0x0000000000000000]               
	int32_t                                            EndIndex;                                      // 0x000C (0x0004) [0x0000000000000000]               
	class TArray<struct FPoplarMatchHistoryEntry>      Entries;                                       // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct PoplarGame.PoplarTypes.DurangoHeroProgressStruct
// 0x0020
struct FDurangoHeroProgressStruct
{
	int32_t                                            ProgressPercent_Server;                        // 0x0000 (0x0004) [0x0000000000000000]               
	int32_t                                            ProgressCommandRank_Server;                    // 0x0004 (0x0004) [0x0000000000000000]               
	int32_t                                            ProgressCharacterRank_Server;                  // 0x0008 (0x0004) [0x0000000000000000]               
	class FString                                      ProgressCharacterId_Server;                    // 0x0010 (0x0010) [0x0000000000400000] (CPF_NeedCtorLink)
};

// ScriptStruct PoplarGame.PoplarTypes.TrainingData
// 0x0010
struct FTrainingData
{
	class APoplarPlayerController*                     PCOwner;                                       // 0x0000 (0x0008) [0x0000000000000000]               
	class UPoplarTrainingMessageDefinition*            TrainingDefinition;                            // 0x0008 (0x0008) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.PoplarTypes.BotPlayerStatsData
// 0x000C
struct FBotPlayerStatsData
{
	class UStatDefinition*                             StatDef;                                       // 0x0000 (0x0008) [0x0000000000000000]               
	int32_t                                            StatValue;                                     // 0x0008 (0x0004) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.PoplarTypes.BroadcastMessageData
// 0x0048
struct FBroadcastMessageData
{
	uint8_t                                            Filter;                                        // 0x0000 (0x0001) [0x0000000000000000]               
	uint8_t                                            ClientSideFilter;                              // 0x0001 (0x0001) [0x0000000000000000]               
	class UPoplarTeamDefinition*                       InstigatingTeam;                               // 0x0008 (0x0008) [0x0000000000000000]               
	class UPoplarTeamDefinition*                       OpposingTeam;                                  // 0x0010 (0x0008) [0x0000000000000000]               
	class AActor*                                      InstigatingPlayer;                             // 0x0018 (0x0008) [0x0000000000000000]               
	class AActor*                                      OpposingPlayer;                                // 0x0020 (0x0008) [0x0000000000000000]               
	class UPoplarLaneDefinition*                       LaneDef;                                       // 0x0028 (0x0008) [0x0000000000000000]               
	class UPoplarSkillDefinition*                      SkillDef;                                      // 0x0030 (0x0008) [0x0000000000000000]               
	class UPoplarTrainingMessageDefinition*            TrainingDef;                                   // 0x0038 (0x0008) [0x0000000000000000]               
	class UObject*                                     OtherParticipant;                              // 0x0040 (0x0008) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.PoplarTypes.PoplarSkinRepData
// 0x0010
struct FPoplarSkinRepData
{
	uint8_t                                            RepIndex;                                      // 0x0000 (0x0001) [0x0000000000000000]               
	class UPoplarContentSkinDefinition*                SkinDef;                                       // 0x0008 (0x0008) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.PoplarTypes.DamageTags
// 0x0004
struct FDamageTags
{
	uint32_t                                           bStandardAttackAny : 1;                        // 0x0000 (0x0004) [0x0000000000800001] [0x00000001] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bStandardAttack01 : 1;                         // 0x0000 (0x0004) [0x0000000000800001] [0x00000002] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bStandardAttack02 : 1;                         // 0x0000 (0x0004) [0x0000000000800001] [0x00000004] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bActionAbilityAny : 1;                         // 0x0000 (0x0004) [0x0000000000800001] [0x00000008] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bActionAbility01 : 1;                          // 0x0000 (0x0004) [0x0000000000800001] [0x00000010] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bActionAbility02 : 1;                          // 0x0000 (0x0004) [0x0000000000800001] [0x00000020] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bCCAny : 1;                                    // 0x0000 (0x0004) [0x0000000000800001] [0x00000040] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bCCStun : 1;                                   // 0x0000 (0x0004) [0x0000000000800001] [0x00000080] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bCCBlind : 1;                                  // 0x0000 (0x0004) [0x0000000000800001] [0x00000100] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bCCSlow : 1;                                   // 0x0000 (0x0004) [0x0000000000800001] [0x00000200] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bCCForcedMove : 1;                             // 0x0000 (0x0004) [0x0000000000800001] [0x00000400] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bBuffSkill : 1;                                // 0x0000 (0x0004) [0x0000000000800001] [0x00000800] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bDebuffSkill : 1;                              // 0x0000 (0x0004) [0x0000000000800001] [0x00001000] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bUlt : 1;                                      // 0x0000 (0x0004) [0x0000000000800001] [0x00002000] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bDot : 1;                                      // 0x0000 (0x0004) [0x0000000000800001] [0x00004000] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bHeal : 1;                                     // 0x0000 (0x0004) [0x0000000000800001] [0x00008000] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bShieldHeal : 1;                               // 0x0000 (0x0004) [0x0000000000800001] [0x00010000] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bEnvironmental : 1;                            // 0x0000 (0x0004) [0x0000000000800001] [0x00020000] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bRanged : 1;                                   // 0x0000 (0x0004) [0x0000000000800001] [0x00040000] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bMelee : 1;                                    // 0x0000 (0x0004) [0x0000000000800001] [0x00080000] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bAoE : 1;                                      // 0x0000 (0x0004) [0x0000000000800001] [0x00100000] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bPassiveAbility : 1;                           // 0x0000 (0x0004) [0x0000000000800001] [0x00200000] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bPerksAndArtifacts : 1;                        // 0x0000 (0x0004) [0x0000000000800001] [0x00400000] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bDismantleMinions : 1;                         // 0x0000 (0x0004) [0x0000000000800001] [0x00800000] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bWorldInteraction : 1;                         // 0x0000 (0x0004) [0x0000000000800001] [0x01000000] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bDirectionalHardFlinch : 1;                    // 0x0000 (0x0004) [0x0000000000800001] [0x02000000] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bMeleeQuickstrike : 1;                         // 0x0000 (0x0004) [0x0000000000800001] [0x04000000] (CPF_Edit | CPF_NoExport)
	uint32_t                                           bReflectedDamage : 1;                          // 0x0000 (0x0004) [0x0000000000800001] [0x08000000] (CPF_Edit | CPF_NoExport)
};

// ScriptStruct PoplarGame.PoplarTypes.BehaviorLineTraceFlags
// 0x0004
struct FBehaviorLineTraceFlags
{
	uint32_t                                           bComplexCollision : 1;                         // 0x0000 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	uint32_t                                           bStopAtAnyHit : 1;                             // 0x0000 (0x0004) [0x0000000000000003] [0x00000002] (CPF_Edit | CPF_Const)
	uint32_t                                           bPawns : 1;                                    // 0x0000 (0x0004) [0x0000000000000003] [0x00000004] (CPF_Edit | CPF_Const)
	uint32_t                                           bMovers : 1;                                   // 0x0000 (0x0004) [0x0000000000000003] [0x00000008] (CPF_Edit | CPF_Const)
	uint32_t                                           bLevel : 1;                                    // 0x0000 (0x0004) [0x0000000000000003] [0x00000010] (CPF_Edit | CPF_Const)
	uint32_t                                           bVolumes : 1;                                  // 0x0000 (0x0004) [0x0000000000000003] [0x00000020] (CPF_Edit | CPF_Const)
	uint32_t                                           bOnlyProjActor : 1;                            // 0x0000 (0x0004) [0x0000000000000003] [0x00000040] (CPF_Edit | CPF_Const)
	uint32_t                                           bBlocking : 1;                                 // 0x0000 (0x0004) [0x0000000000000003] [0x00000080] (CPF_Edit | CPF_Const)
	uint32_t                                           bLevelGeometry : 1;                            // 0x0000 (0x0004) [0x0000000000000003] [0x00000100] (CPF_Edit | CPF_Const)
	uint32_t                                           bTerrain : 1;                                  // 0x0000 (0x0004) [0x0000000000000003] [0x00000200] (CPF_Edit | CPF_Const)
	uint32_t                                           bPhysicsVolumes : 1;                           // 0x0000 (0x0004) [0x0000000000000003] [0x00000400] (CPF_Edit | CPF_Const)
	uint32_t                                           bBlockingMesh : 1;                             // 0x0000 (0x0004) [0x0000000000000003] [0x00000800] (CPF_Edit | CPF_Const)
	uint32_t                                           bWater : 1;                                    // 0x0000 (0x0004) [0x0000000000000003] [0x00001000] (CPF_Edit | CPF_Const)
	uint32_t                                           bProjectiles : 1;                              // 0x0000 (0x0004) [0x0000000000000003] [0x00002000] (CPF_Edit | CPF_Const)
	uint32_t                                           bFieldVolumes : 1;                             // 0x0000 (0x0004) [0x0000000000000003] [0x00004000] (CPF_Edit | CPF_Const)
	uint32_t                                           bIgnoreRigidBody : 1;                          // 0x0000 (0x0004) [0x0000000000000003] [0x00008000] (CPF_Edit | CPF_Const)
	uint32_t                                           bActorsGroup : 1;                              // 0x0000 (0x0004) [0x0000000000000003] [0x00010000] (CPF_Edit | CPF_Const)
	uint32_t                                           bWorldGroup : 1;                               // 0x0000 (0x0004) [0x0000000000000003] [0x00020000] (CPF_Edit | CPF_Const)
	uint32_t                                           bAllCollidingGroup : 1;                        // 0x0000 (0x0004) [0x0000000000000003] [0x00040000] (CPF_Edit | CPF_Const)
	uint32_t                                           bProjTargetsGroup : 1;                         // 0x0000 (0x0004) [0x0000000000000003] [0x00080000] (CPF_Edit | CPF_Const)
	uint32_t                                           bAllBlockingGroup : 1;                         // 0x0000 (0x0004) [0x0000000000000003] [0x00100000] (CPF_Edit | CPF_Const)
};

// ScriptStruct PoplarGame.PoplarDamagePipeline.ConditionalDamageModifier
// 0x0050
struct FConditionalDamageModifier
{
	uint8_t                                            Context;                                       // 0x0000 (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class UExpressionEvaluator*                        Condition;                                     // 0x0008 (0x0008) [0x0000000004000003] (CPF_Edit | CPF_Const | CPF_EditInline)
	uint8_t                                            DamageTagsTest;                                // 0x0010 (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FDamageTags                                 DamageTags;                                    // 0x0014 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           bCriticalHit : 1;                              // 0x0018 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                DamageModifier;                                // 0x0020 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class FString                                      ReferenceName;                                 // 0x0040 (0x0010) [0x0000000000500003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
};

// ScriptStruct PoplarGame.PoplarStatReplicationInfo.MaxStatsExceededMessage
// 0x0010
struct FMaxStatsExceededMessage
{
	int32_t                                            ExceededMaxStatsCount;                         // 0x0000 (0x0004) [0x0000000000000000]               
	class UStatDefinition*                             LastExceededStatDef;                           // 0x0008 (0x0008) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.KillModifiersDefinition.KillModAwardData
// 0x0018
struct FKillModAwardData
{
	class APoplarPlayerReplicationInfo*                PPRI;                                          // 0x0000 (0x0008) [0x0000000000000000]               
	float                                              XPModifierToAward;                             // 0x0008 (0x0004) [0x0000000000000000]               
	float                                              ScoreToAward;                                  // 0x000C (0x0004) [0x0000000000000000]               
	float                                              KillStatXPModifierToAward;                     // 0x0010 (0x0004) [0x0000000000000000]               
	float                                              KillStatScoreModifierToAward;                  // 0x0014 (0x0004) [0x0000000000000000]               
};

// ScriptStruct PoplarGame.KillModifiersDefinition.KillStreakTier
// 0x0004
struct FKillStreakTier
{
	int32_t                                            Threshold;                                     // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct PoplarGame.KillModifiersDefinition.KillModifier
// 0x00D8
struct FKillModifier
{
	uint8_t                                            Type;                                          // 0x0000 (0x0001) [0x0000000000000001] (CPF_Edit)    
	struct FAttributeInitializationData                XPModifier;                                    // 0x0008 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                ScoreAwarded;                                  // 0x0028 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                KillStatScoreModifier;                         // 0x0048 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                KillStatXPModifier;                            // 0x0068 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class FString                                      Title;                                         // 0x0088 (0x0010) [0x0000000000408003] (CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink)
	class FString                                      Description;                                   // 0x0098 (0x0010) [0x0000000000408003] (CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink)
	class FString                                      FlashFrameName;                                // 0x00A8 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	int32_t                                            Priority;                                      // 0x00B8 (0x0004) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
	int32_t                                            KillModifiersArrayIndex;                       // 0x00BC (0x0004) [0x0000000000000000]               
	uint32_t                                           bTrackForPostMatchAwards : 1;                  // 0x00C0 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	class UStatDefinition*                             KillModifierStat;                              // 0x00C8 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class USwfMovie*                                   DisplayIcon;                                   // 0x00D0 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct PoplarGame.KillModifiersDefinition.KillCombo
// 0x00D4
struct FKillCombo
{
	class TArray<class UPlayerClassDefinition*>        Killer;                                        // 0x0000 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<class UCharacterClassDefinition*>     Victim;                                        // 0x0010 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<uint8_t>                              KillModifiers;                                 // 0x0020 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	struct FAttributeInitializationData                XPModifier;                                    // 0x0030 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                ScoreAwarded;                                  // 0x0050 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                KillStatScoreModifier;                         // 0x0070 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                KillStatXPModifier;                            // 0x0090 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class FString                                      Title;                                         // 0x00B0 (0x0010) [0x0000000000408003] (CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink)
	class TArray<class FString>                        IconFrameNames;                                // 0x00C0 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
