/*
#############################################################################################
# BattleBorn (1.0.0.0) SDK
# Generated with the CodeRedGenerator v1.0.3
# ========================================================================================= #
# File: WillowGame_parameters.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

/*
# ========================================================================================= #
# Parameters
# ========================================================================================= #
*/

// Function WillowGame.Action_MoveToInstanceData.SetMoveNode
// [0x12020000] 
struct UAction_MoveToInstanceData_execSetMoveNode_Params
{
	class AGearboxAIMoveNode*                          NewNode;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.Action_MoveToInstanceData.GetMoveNode
// [0x12020000] 
struct UAction_MoveToInstanceData_execGetMoveNode_Params
{
	class AGearboxAIMoveNode*                          ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.Action_MoveToInstanceData.SetMoveFacingPolicy
// [0x12020000] 
struct UAction_MoveToInstanceData_execSetMoveFacingPolicy_Params
{
};

// Function WillowGame.Action_MoveToInstanceData.CheckStateTransition
// [0x12020002] 
struct UAction_MoveToInstanceData_execCheckStateTransition_Params
{
};

// Function WillowGame.Action_MoveToInstanceData.GetInstanceDataActor
// [0x12020000] 
struct UAction_MoveToInstanceData_execGetInstanceDataActor_Params
{
	class AActor*                                      ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.Action_MoveToInstanceData.Start
// [0x12020800] 
struct UAction_MoveToInstanceData_eventStart_Params
{
};

// Function WillowGame.Action_MoveToInstanceData.CanRun
// [0x12020800] 
struct UAction_MoveToInstanceData_eventCanRun_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.Action_MoveToInstanceData.Init
// [0x12020800] 
struct UAction_MoveToInstanceData_eventInit_Params
{
};

// Function WillowGame.Action_WillowPatrol.GetPatrolWaitTime
// [0x12020000] 
struct UAction_WillowPatrol_execGetPatrolWaitTime_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.Action_WillowPatrol.CheckFullyBlocked
// [0x12020002] 
struct UAction_WillowPatrol_execCheckFullyBlocked_Params
{
};

// Function WillowGame.Action_WillowPatrol.GetRandomHomeLocation
// [0x12020000] 
struct UAction_WillowPatrol_execGetRandomHomeLocation_Params
{
	struct FVector                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.Action_WillowPatrol.IsTooFarFromHome
// [0x12020000] 
struct UAction_WillowPatrol_execIsTooFarFromHome_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.Action_WillowPatrol.CheckStateTransition
// [0x12020002] 
struct UAction_WillowPatrol_execCheckStateTransition_Params
{
};

// Function WillowGame.Action_WillowPatrol.GetPatrolState
// [0x12020000] 
struct UAction_WillowPatrol_execGetPatrolState_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.Action_WillowPatrol.ActivateEvent
// [0x16020800] 
struct UAction_WillowPatrol_eventActivateEvent_Params
{
	struct FName                                       EventName;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.Action_WillowPatrol.Start
// [0x12020800] 
struct UAction_WillowPatrol_eventStart_Params
{
};

// Function WillowGame.Action_WillowPatrol.Init
// [0x12020800] 
struct UAction_WillowPatrol_eventInit_Params
{
};

// Function WillowGame.Action_WillowScripted.ReachedFormation
// [0x12020000] 
struct UAction_WillowScripted_execReachedFormation_Params
{
	struct FVector                                     TestLoc;                                          		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.Action_WillowScripted.LocationInFollowRange
// [0x12020000] 
struct UAction_WillowScripted_execLocationInFollowRange_Params
{
	struct FVector                                     TestLoc;                                          		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.Action_WillowScripted.ScriptedActionEnded
// [0x16020000] 
struct UAction_WillowScripted_execScriptedActionEnded_Params
{
};

// Function WillowGame.Action_WillowScripted.ScriptedActionStarted
// [0x16020000] 
struct UAction_WillowScripted_execScriptedActionStarted_Params
{
};

// Function WillowGame.Action_WillowScripted.GetDesiredStateName
// [0x12020000] 
struct UAction_WillowScripted_execGetDesiredStateName_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.Action_WillowScripted.ShouldLookAtPlayer
// [0x12020000] 
struct UAction_WillowScripted_execShouldLookAtPlayer_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.Action_WillowScripted.ActivateEvent
// [0x16020800] 
struct UAction_WillowScripted_eventActivateEvent_Params
{
	struct FName                                       EventName;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.Action_WillowScripted.Start
// [0x12020800] 
struct UAction_WillowScripted_eventStart_Params
{
};

// Function WillowGame.Action_WillowScripted.Init
// [0x12020800] 
struct UAction_WillowScripted_eventInit_Params
{
};

// Function WillowGame.Action_ScriptedNPC.SetupLoadBalancePathing
// [0x12020000] 
struct UAction_ScriptedNPC_execSetupLoadBalancePathing_Params
{
};

// Function WillowGame.Action_ScriptedNPC.SetupLoadBalanceDefaults
// [0x12020000] 
struct UAction_ScriptedNPC_execSetupLoadBalanceDefaults_Params
{
};

// Function WillowGame.Action_ScriptedNPC.GetDesiredStateName
// [0x12020000] 
struct UAction_ScriptedNPC_execGetDesiredStateName_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.Action_ScriptedNPC.CheckStateTransition
// [0x12020002] 
struct UAction_ScriptedNPC_execCheckStateTransition_Params
{
};

// Function WillowGame.Action_ScriptedNPC.CanRun
// [0x12020800] 
struct UAction_ScriptedNPC_eventCanRun_Params
{
	struct FName                                       ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.ShouldResetOnInterruptedGrenadeThrow
// [0x12020000] 
struct AActionSkill_execShouldResetOnInterruptedGrenadeThrow_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.CanResetActionSkill
// [0x12020800] 
struct AActionSkill_eventCanResetActionSkill_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.OverrideCrosshairVisibility
// [0x12020900] 
struct AActionSkill_eventOverrideCrosshairVisibility_Params
{
	uint32_t                                           bVisible : 1;                                     		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           bForScope : 1;                                    		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.GetDeferredActionSkillTime
// [0x12020800] 
struct AActionSkill_eventGetDeferredActionSkillTime_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.TickActionSkillHUD
// [0x12020800] 
struct AActionSkill_eventTickActionSkillHUD_Params
{
	class UWillowHUDGFxMovie*                          HUDMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              ActionSkillTime;                                  		// 0x0008 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              DeltaTime;                                        		// 0x000C (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.DisableActionSkillHUD
// [0x12020800] 
struct AActionSkill_eventDisableActionSkillHUD_Params
{
	class UWillowHUDGFxMovie*                          HUDMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.EnableActionSkillHUD
// [0x12020800] 
struct AActionSkill_eventEnableActionSkillHUD_Params
{
	class UWillowHUDGFxMovie*                          HUDMovie;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.GetBehaviorConsumerHandle
// [0x00020400]  (iNative[34051])
struct AActionSkill_execGetBehaviorConsumerHandle_Params
{
	struct FBehaviorConsumerHandle                     ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.GetActionSkillEventContextObject
// [0x00020400]  (iNative[42195])
struct AActionSkill_execGetActionSkillEventContextObject_Params
{
	class UObject*                                     ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.RunCustomEvent
// [0x12024900] 
struct AActionSkill_eventRunCustomEvent_Params
{
	struct FName                                       EventName;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     EventInstigator;                                  		// 0x0008 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	class UObject*                                     OtherEventParticipantObject;                      		// 0x0010 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
	struct FBehaviorParameters                         EventData;                                        		// 0x0018 (0x0010) [0x0000000000400090] (CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink)
};

// Function WillowGame.ActionSkill.HandleTimerEvent
// [0x12024900] 
struct AActionSkill_eventHandleTimerEvent_Params
{
	uint8_t                                            EventType;                                        		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	struct FBehaviorParameters                         EventData;                                        		// 0x0008 (0x0010) [0x0000000000400090] (CPF_OptionalParm | CPF_Parm | CPF_NeedCtorLink)
};

// Function WillowGame.ActionSkill.SetTimerState
// [0x12020000] 
struct AActionSkill_execSetTimerState_Params
{
	uint8_t                                            TimerId;                                          		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	struct FBehaviorTimerState                         TimerState;                                       		// 0x0004 (0x000C) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.GetTimerState
// [0x12420000] 
struct AActionSkill_execGetTimerState_Params
{
	uint8_t                                            TimerId;                                          		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	struct FBehaviorTimerState                         TimerState;                                       		// 0x0004 (0x000C) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.GetTimeSeconds
// [0x12020000] 
struct AActionSkill_execGetTimeSeconds_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.GetInstanceDataState
// [0x12420100] 
struct AActionSkill_execGetInstanceDataState_Params
{
	struct FInstanceData2                              OutInstanceDataState;                             		// 0x0000 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.RemoveInstanceData
// [0x12020900] 
struct AActionSkill_eventRemoveInstanceData_Params
{
	struct FName                                       DataName;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.GetInstanceData
// [0x12420900] 
struct AActionSkill_eventGetInstanceData_Params
{
	struct FName                                       DataName;                                         		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class TArray<struct FInstanceDataItem2>            InstanceData;                                     		// 0x0008 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0018 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.SetInstanceData
// [0x12024900] 
struct AActionSkill_eventSetInstanceData_Params
{
	struct FInstanceDataItem2                          InstanceData;                                     		// 0x0000 (0x0060) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	uint32_t                                           bAllowDuplicateNames : 1;                         		// 0x0060 (0x0004) [0x0000000000000090] [0x00000001] (CPF_OptionalParm | CPF_Parm)
	uint32_t                                           ReturnValue : 1;                                  		// 0x0064 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.EnableDebug
// [0x12020900] 
struct AActionSkill_eventEnableDebug_Params
{
	uint32_t                                           DebugEnabled : 1;                                 		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function WillowGame.ActionSkill.NotifyActionSkillActiveAbility
// [0x12024100] 
struct AActionSkill_execNotifyActionSkillActiveAbility_Params
{
	class AWillowPawn*                                 TheWillowPawn;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UISkillInstigator*                           SkillInstigator;                                  		// 0x0008 (0x0010) [0x0000000000000080] (CPF_Parm)    
	float                                              ActionSkillDuration;                              		// 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ActiveTimeRemaining;                              		// 0x001C (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      TheTarget;                                        		// 0x0020 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function WillowGame.ActionSkill.StartActionSkillActiveAbility
// [0x12024900] 
struct AActionSkill_eventStartActionSkillActiveAbility_Params
{
	class AWillowPawn*                                 TheWillowPawn;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UISkillInstigator*                           SkillInstigator;                                  		// 0x0008 (0x0010) [0x0000000000000080] (CPF_Parm)    
	float                                              ActionSkillDuration;                              		// 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ActiveTimeRemaining;                              		// 0x001C (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      TheTarget;                                        		// 0x0020 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function WillowGame.ActionSkill.ClientStartActionSkillActiveAbility
// [0xFFFF0000130249C0] 
struct AActionSkill_eventClientStartActionSkillActiveAbility_Params
{
	class AWillowPawn*                                 TheWillowPawn;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UISkillInstigator*                           SkillInstigator;                                  		// 0x0008 (0x0010) [0x0000000000000080] (CPF_Parm)    
	float                                              ActionSkillDuration;                              		// 0x0018 (0x0004) [0x0000000000000080] (CPF_Parm)    
	float                                              ActiveTimeRemaining;                              		// 0x001C (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      TheTarget;                                        		// 0x0020 (0x0008) [0x0000000000000090] (CPF_OptionalParm | CPF_Parm)
};

// Function WillowGame.ActionSkill.AllowNewActiveAbilityActivation
// [0x12020900] 
struct AActionSkill_eventAllowNewActiveAbilityActivation_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.AllowAutomaticActiveAbilityActivation
// [0x12020900] 
struct AActionSkill_eventAllowAutomaticActiveAbilityActivation_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.AllowNewCooldownAbilityActivation
// [0x12020900] 
struct AActionSkill_eventAllowNewCooldownAbilityActivation_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.AllowAutomaticCooldownAbilityActivation
// [0x12020900] 
struct AActionSkill_eventAllowAutomaticCooldownAbilityActivation_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.OnActionSkillTick
// [0x12020900] 
struct AActionSkill_eventOnActionSkillTick_Params
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OverridesStandardMelee
// [0x12020100] 
struct AActionSkill_execOverridesStandardMelee_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.ReadyToInterceptMelee
// [0x12020100] 
struct AActionSkill_execReadyToInterceptMelee_Params
{
	class AActor*                                      AutoAimTarget;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.OnActionSkillOwnerMelee
// [0x12020100] 
struct AActionSkill_execOnActionSkillOwnerMelee_Params
{
	class AActor*                                      TargetIfAvailable;                                		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OnActionSkillWeaponsRestricted
// [0x12020100] 
struct AActionSkill_execOnActionSkillWeaponsRestricted_Params
{
	uint32_t                                           bWeaponsRestricted : 1;                           		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function WillowGame.ActionSkill.OnActionSkillKilledEnemy
// [0x12020100] 
struct AActionSkill_execOnActionSkillKilledEnemy_Params
{
	class AWillowPawn*                                 KilledPawn;                                       		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OnActionSkillFakePause
// [0x12020100] 
struct AActionSkill_execOnActionSkillFakePause_Params
{
	uint32_t                                           bPaused : 1;                                      		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function WillowGame.ActionSkill.OnActionSkillOwnerTouchedActor
// [0x12020100] 
struct AActionSkill_execOnActionSkillOwnerTouchedActor_Params
{
	class AActor*                                      Other;                                            		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UPrimitiveComponent*                         OtherComp;                                        		// 0x0008 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
	struct FVector                                     HitLocation;                                      		// 0x0010 (0x000C) [0x0000000000000080] (CPF_Parm)    
	struct FVector                                     HitNormal;                                        		// 0x001C (0x000C) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OnActionSkillOwnerHitWall
// [0x12020100] 
struct AActionSkill_execOnActionSkillOwnerHitWall_Params
{
	struct FVector                                     HitNormal;                                        		// 0x0000 (0x000C) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      Wall;                                             		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UPrimitiveComponent*                         WallComp;                                         		// 0x0018 (0x0008) [0x0000000004000080] (CPF_Parm | CPF_EditInline)
};

// Function WillowGame.ActionSkill.OnActionSkillOwnerStoppedWalking
// [0x12020100] 
struct AActionSkill_execOnActionSkillOwnerStoppedWalking_Params
{
};

// Function WillowGame.ActionSkill.OnActionSkillOwnerBeganWalking
// [0x12020100] 
struct AActionSkill_execOnActionSkillOwnerBeganWalking_Params
{
	uint8_t                                            PreviousPhysics;                                  		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OnActionSkillOwnerBeganFalling
// [0x12020100] 
struct AActionSkill_execOnActionSkillOwnerBeganFalling_Params
{
	uint8_t                                            PreviousPhysics;                                  		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OnActionSkillOwnerAllieganceChanged
// [0x12020900] 
struct AActionSkill_eventOnActionSkillOwnerAllieganceChanged_Params
{
	class UPawnAllegiance*                             NewAllegiance;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OnActionSkillOwnerWeaponSwitched
// [0x12020100] 
struct AActionSkill_execOnActionSkillOwnerWeaponSwitched_Params
{
	class AWeapon*                                     OldWeapon;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AWeapon*                                     NewWeapon;                                        		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OnActionSkillOwnerDied
// [0x12020100] 
struct AActionSkill_execOnActionSkillOwnerDied_Params
{
};

// Function WillowGame.ActionSkill.OwnerLostAutoAimTarget
// [0x12020900] 
struct AActionSkill_eventOwnerLostAutoAimTarget_Params
{
	class UITargetable*                                OldTargetable;                                    		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OwnerAcquiredAutoAimTarget
// [0x12020900] 
struct AActionSkill_eventOwnerAcquiredAutoAimTarget_Params
{
	class UITargetable*                                NewTargetable;                                    		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.UnregisterNotificationDelegates
// [0x12020100] 
struct AActionSkill_execUnregisterNotificationDelegates_Params
{
};

// Function WillowGame.ActionSkill.RegisterNotificationDelegates
// [0x12020100] 
struct AActionSkill_execRegisterNotificationDelegates_Params
{
};

// Function WillowGame.ActionSkill.TornOff
// [0x12020900] 
struct AActionSkill_eventTornOff_Params
{
};

// Function WillowGame.ActionSkill.TearOff
// [0x12020800] 
struct AActionSkill_eventTearOff_Params
{
};

// Function WillowGame.ActionSkill.OnActionSkillEnded
// [0x12020100] 
struct AActionSkill_execOnActionSkillEnded_Params
{
};

// Function WillowGame.ActionSkill.IsDeactivateBlocked
// [0x12020801] 
struct AActionSkill_eventIsDeactivateBlocked_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.ActionSkill.ClientActionSkillWantsToDeactivate
// [0xFFFF0000130201C0] 
struct AActionSkill_execClientActionSkillWantsToDeactivate_Params
{
};

// Function WillowGame.ActionSkill.OnActionSkillWantsToDeactivate
// [0x12020800] 
struct AActionSkill_eventOnActionSkillWantsToDeactivate_Params
{
};

// Function WillowGame.ActionSkill.OnActionSkillStarted
// [0x12020900] 
struct AActionSkill_eventOnActionSkillStarted_Params
{
	class UISkillInstigator*                           TheSkillInstigator;                               		// 0x0000 (0x0010) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.SetTarget
// [0x00020500]  (iNative[28994])
struct AActionSkill_execSetTarget_Params
{
	class AActor*                                      TheTarget;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.ReplicatedEvent
// [0x12020900] 
struct AActionSkill_eventReplicatedEvent_Params
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OnActionSkillOwnerShowBackMenu
// [0x80420401]  (iNative[2585])
struct AActionSkill_execOnActionSkillOwnerShowBackMenu_Params
{
	struct FBehaviorConsumerHandle                     TheConsumerHandle;                                		// 0x0000 (0x0004) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	class APawn*                                       SkillInstigator;                                  		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bOpened : 1;                                      		// 0x0010 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
};

// Function WillowGame.ActionSkill.OnTimerEvent
// [0x80420401]  (iNative[2522])
struct AActionSkill_execOnTimerEvent_Params
{
	struct FBehaviorConsumerHandle                     TheConsumerHandle;                                		// 0x0000 (0x0004) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	struct FName                                       SpecializedEventName;                             		// 0x0004 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OnActionSkillNearingCompletion
// [0x80420401]  (iNative[2586])
struct AActionSkill_execOnActionSkillNearingCompletion_Params
{
	struct FBehaviorConsumerHandle                     TheConsumerHandle;                                		// 0x0000 (0x0004) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	class APawn*                                       SkillInstigator;                                  		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      SkillTargetIfAvailable;                           		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OnActionSkillOwnerMeleeOverridden
// [0x80420401]  (iNative[2587])
struct AActionSkill_execOnActionSkillOwnerMeleeOverridden_Params
{
	struct FBehaviorConsumerHandle                     TheConsumerHandle;                                		// 0x0000 (0x0004) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	class APawn*                                       SkillInstigator;                                  		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      SkillTargetIfAvailable;                           		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OnOwnerLostAutoAimTarget
// [0x80420401]  (iNative[2588])
struct AActionSkill_execOnOwnerLostAutoAimTarget_Params
{
	struct FBehaviorConsumerHandle                     TheConsumerHandle;                                		// 0x0000 (0x0004) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	class APawn*                                       SkillOwner;                                       		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      OldTargetIfAvailable;                             		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OnOwnerAcquiredAutoAimTarget
// [0x80420401]  (iNative[2589])
struct AActionSkill_execOnOwnerAcquiredAutoAimTarget_Params
{
	struct FBehaviorConsumerHandle                     TheConsumerHandle;                                		// 0x0000 (0x0004) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	class APawn*                                       SkillOwner;                                       		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      NewTargetIfAvailable;                             		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OnActionSkillDeactivated
// [0x80420401]  (iNative[2590])
struct AActionSkill_execOnActionSkillDeactivated_Params
{
	struct FBehaviorConsumerHandle                     TheConsumerHandle;                                		// 0x0000 (0x0004) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	class APawn*                                       SkillInstigator;                                  		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OnActionSkillActivated
// [0x80420401]  (iNative[2591])
struct AActionSkill_execOnActionSkillActivated_Params
{
	struct FBehaviorConsumerHandle                     TheConsumerHandle;                                		// 0x0000 (0x0004) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	class APawn*                                       SkillInstigator;                                  		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      SkillTargetIfAvailable;                           		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OnActionSkillActiveAbilityNotified
// [0x80420401]  (iNative[2592])
struct AActionSkill_execOnActionSkillActiveAbilityNotified_Params
{
	struct FBehaviorConsumerHandle                     TheConsumerHandle;                                		// 0x0000 (0x0004) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	class APawn*                                       SkillInstigator;                                  		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              ActiveTimeRemaining;                              		// 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      SkillTargetIfAvailable;                           		// 0x0018 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkill.OnActionSkillActiveAbilityActivated
// [0x80420401]  (iNative[2593])
struct AActionSkill_execOnActionSkillActiveAbilityActivated_Params
{
	struct FBehaviorConsumerHandle                     TheConsumerHandle;                                		// 0x0000 (0x0004) [0x0000000000000182] (CPF_Const | CPF_Parm | CPF_OutParm)
	class APawn*                                       SkillInstigator;                                  		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              ActiveTimeRemaining;                              		// 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class AActor*                                      SkillTargetIfAvailable;                           		// 0x0018 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.ActionSkillStateExpressionEvaluator.Evaluate
// [0x00020400]  (iNative[22809])
struct UActionSkillStateExpressionEvaluator_execEvaluate_Params
{
	class UObject*                                     ContextSource;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AIDebugDummyBase.SetSkeletalMesh
// [0x12020800] 
struct AAIDebugDummyBase_eventSetSkeletalMesh_Params
{
	class USkeletalMesh*                               NewMesh;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.AIDebugDummyBase.PostBeginPlay
// [0x12020100] 
struct AAIDebugDummyBase_execPostBeginPlay_Params
{
};

// Function WillowGame.AIPawnBalanceDefinition.GetTransformedKillStat
// [0x00020400]  (iNative[42546])
struct UAIPawnBalanceDefinition_execGetTransformedKillStat_Params
{
	uint8_t                                            Transform;                                        		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	struct FName                                       ReturnValue;                                      		// 0x0004 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AIPawnBalanceDefinition.GetTransformedDisplayName
// [0x00020400]  (iNative[42545])
struct UAIPawnBalanceDefinition_execGetTransformedDisplayName_Params
{
	uint8_t                                            Transform;                                        		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	class FString                                      ReturnValue;                                      		// 0x0008 (0x0010) [0x0000000000400580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink)
};

// Function WillowGame.AIPawnBalanceDefinition.SetupPawnItemPoolList
// [0x00020400]  (iNative[46370])
struct UAIPawnBalanceDefinition_execSetupPawnItemPoolList_Params
{
	class AWillowPawn*                                 SpawnedPawn;                                      		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AIPawnBalanceDefinition.GetPawnArchetype
// [0x00020400]  (iNative[42448])
struct UAIPawnBalanceDefinition_execGetPawnArchetype_Params
{
	class AWillowPawn*                                 ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AIPawnBalanceDefinition.GetPlayThroughIndex
// [0x00020400]  (iNative[42465])
struct UAIPawnBalanceDefinition_execGetPlayThroughIndex_Params
{
	int32_t                                            ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AmmoPanelGFxObject.__SetHighlight
// [0x12020000] 
struct UAmmoPanelGFxObject_exec__SetHighlight_Params
{
	class FString                                      HighlightFrame;                                   		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function WillowGame.AmmoPanelGFxObject.SetHighlight
// [0x12020000] 
struct UAmmoPanelGFxObject_execSetHighlight_Params
{
	class AWillowInventory*                            WInv;                                             		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.AmmoPanelGFxObject.SetAmmoLabels
// [0x12020000] 
struct UAmmoPanelGFxObject_execSetAmmoLabels_Params
{
	class FString                                      LabelNameBase;                                    		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	int32_t                                            HasAmount;                                        		// 0x0010 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            MaxAmount;                                        		// 0x0014 (0x0004) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.AmmoPanelGFxObject.SetAmmoCount
// [0x12420000] 
struct UAmmoPanelGFxObject_execSetAmmoCount_Params
{
	class FString                                      FlashString;                                      		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
	class UResourceDefinition*                         ResourceDef;                                      		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AWillowPlayerController*                     WPCOwner;                                         		// 0x0018 (0x0008) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            CachedAmount;                                     		// 0x0020 (0x0004) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
};

// Function WillowGame.AmmoPanelGFxObject.SetAllAmmoCounts
// [0x12020000] 
struct UAmmoPanelGFxObject_execSetAllAmmoCounts_Params
{
};

// Function WillowGame.AmmoPanelGFxObject.RefreshTransientData
// [0x12020000] 
struct UAmmoPanelGFxObject_execRefreshTransientData_Params
{
};

// Function WillowGame.AmmoPanelGFxObject.SetTitle
// [0x12020000] 
struct UAmmoPanelGFxObject_execSetTitle_Params
{
	class FString                                      Title;                                            		// 0x0000 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function WillowGame.AmmoPanelGFxObject.Init
// [0x12020000] 
struct UAmmoPanelGFxObject_execInit_Params
{
};

// Function WillowGame.AmmoResourcePool.GetDebugText
// [0x12420000] 
struct UAmmoResourcePool_execGetDebugText_Params
{
	class TArray<class FString>                        DebugText;                                        		// 0x0000 (0x0010) [0x0000000000400180] (CPF_Parm | CPF_OutParm | CPF_NeedCtorLink)
};

// Function WillowGame.AmmoResourcePool.GetExtraAmmoRegen
// [0x00020401]  (iNative[42316])
struct UAmmoResourcePool_execGetExtraAmmoRegen_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AnimNodeStateExpressionEvaluator.Evaluate
// [0x00020400]  (iNative[22809])
struct UAnimNodeStateExpressionEvaluator_execEvaluate_Params
{
	class UObject*                                     ContextSource;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AnimNotify_UseBehavior.PreTestNotify
// [0x12020000] 
struct UAnimNotify_UseBehavior_execPreTestNotify_Params
{
	class AWillowPawn*                                 anOwner;                                          		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationDefinition.IncludePrefixInTranslation
// [0x00020401]  (iNative[43023])
struct UAttributePresentationDefinition_execIncludePrefixInTranslation_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationDefinition.IncludeSuffixInTranslation
// [0x00020401]  (iNative[43024])
struct UAttributePresentationDefinition_execIncludeSuffixInTranslation_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationDefinition.IsTextColorEnabled
// [0x00020401]  (iNative[43500])
struct UAttributePresentationDefinition_execIsTextColorEnabled_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationDefinition.GetTextColor
// [0x00020401]  (iNative[42531])
struct UAttributePresentationDefinition_execGetTextColor_Params
{
	struct FColor                                      ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationDefinition.GetSignStyle
// [0x00020401]  (iNative[42501])
struct UAttributePresentationDefinition_execGetSignStyle_Params
{
	EAttributeValueSignStyle                           ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationDefinition.GetEffectiveRoundingMode
// [0x00020401]  (iNative[42308])
struct UAttributePresentationDefinition_execGetEffectiveRoundingMode_Params
{
	uint8_t                                            Style;                                            		// 0x0000 (0x0001) [0x0000000000000080] (CPF_Parm)    
	EAttributeInitializationRounding                   ReturnValue;                                      		// 0x0001 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationDefinition.GetRoundingMode
// [0x00020401]  (iNative[42491])
struct UAttributePresentationDefinition_execGetRoundingMode_Params
{
	EAttributeInitializationRounding                   ReturnValue;                                      		// 0x0000 (0x0001) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationDefinition.ShouldUseCustomNumberPlacement
// [0x00020401]  (iNative[46561])
struct UAttributePresentationDefinition_execShouldUseCustomNumberPlacement_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationDefinition.ShouldDisplayPlusSign
// [0x00020401]  (iNative[46548])
struct UAttributePresentationDefinition_execShouldDisplayPlusSign_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationDefinition.ShouldDisplayNumberInTranslation
// [0x00020401]  (iNative[46547])
struct UAttributePresentationDefinition_execShouldDisplayNumberInTranslation_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationDefinition.ShouldDisplayAsInverse
// [0x00020401]  (iNative[46545])
struct UAttributePresentationDefinition_execShouldDisplayAsInverse_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationDefinition.ShouldDisplayAsPercentage
// [0x00020401]  (iNative[46546])
struct UAttributePresentationDefinition_execShouldDisplayAsPercentage_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationDefinition.IsBiggerBetter
// [0x00020401]  (iNative[43424])
struct UAttributePresentationDefinition_execIsBiggerBetter_Params
{
	uint32_t                                           ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationDefinition.GetBasePriority
// [0x00020401]  (iNative[42237])
struct UAttributePresentationDefinition_execGetBasePriority_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationDefinition.RemapValue
// [0x00020401]  (iNative[45850])
struct UAttributePresentationDefinition_execRemapValue_Params
{
	float                                              InputValue;                                       		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     ContextSourceOverride;                            		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0010 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationDefinition.RoundValue
// [0x00022401]  (iNative[46003])
struct UAttributePresentationDefinition_execRoundValue_Params
{
	float                                              InputValue;                                       		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	int32_t                                            PrecisionAferDecimalPoint;                        		// 0x0004 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            EffectiveRoundingMode;                            		// 0x0008 (0x0001) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationDefinition.ApplyPresentationRulesToValue
// [0x00020401]  (iNative[37665])
struct UAttributePresentationDefinition_execApplyPresentationRulesToValue_Params
{
	float                                              ModifierValue;                                    		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint8_t                                            Style;                                            		// 0x0004 (0x0001) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bAllowZero : 1;                                   		// 0x0008 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	class UObject*                                     ContextSourceOverride;                            		// 0x0010 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0018 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.AttributePresentationListDefinition.FindAttributePresentation
// [0x00020401]  (iNative[41846])
struct UAttributePresentationListDefinition_execFindAttributePresentation_Params
{
	class UAttributeDefinition*                        Attribute;                                        		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UAttributePresentationDefinition*            ReturnValue;                                      		// 0x0008 (0x0008) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.BalanceModifierDefinition.GetAmplifiedDamageMultiplier
// [0x00020401]  (iNative[42218])
struct UBalanceModifierDefinition_execGetAmplifiedDamageMultiplier_Params
{
	float                                              ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.BalanceModifierDefinition.GetAdditionalEnemyDamageMultiplier
// [0x00020401]  (iNative[42201])
struct UBalanceModifierDefinition_execGetAdditionalEnemyDamageMultiplier_Params
{
	int32_t                                            EnemyGameStage;                                   		// 0x0000 (0x0004) [0x0000000000000080] (CPF_Parm)    
	uint32_t                                           bIsChampion : 1;                                  		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] (CPF_Parm)
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.BalanceModifierDefinition.UpdateSpawnedAIPawn
// [0x00020401]  (iNative[47738])
struct UBalanceModifierDefinition_execUpdateSpawnedAIPawn_Params
{
	class AWillowPawn*                                 SpawnedAIPawn;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class AWillowMind*                                 WMind;                                            		// 0x0008 (0x0008) [0x0000000000000080] (CPF_Parm)    
};

// Function WillowGame.BalanceModifierDefinition.GetXPGainedFromQuestsMultiplier
// [0x00020401]  (iNative[42582])
struct UBalanceModifierDefinition_execGetXPGainedFromQuestsMultiplier_Params
{
	class AWillowPlayerController*                     PlayerGettingXP;                                  		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.BalanceModifierDefinition.GetXPGainedFromCombatMultiplier
// [0x00020401]  (iNative[42581])
struct UBalanceModifierDefinition_execGetXPGainedFromCombatMultiplier_Params
{
	class AWillowPlayerController*                     PlayerGettingXP;                                  		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580] (CPF_Parm | CPF_OutParm | CPF_ReturnParm)
};

// Function WillowGame.Behavior_ActivateListenerSkill.ApplyBehaviorToContext
// [0x12480000] 
struct UBehavior_ActivateListenerSkill_execApplyBehaviorToContext_Params
{
	class UObject*                                     ContextObject;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FBehaviorKernelInfo                         KernelInfo;                                       		// 0x0008 (0x0020) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	class UObject*                                     SelfObject;                                       		// 0x0028 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     MyInstigatorObject;                               		// 0x0030 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     OtherEventParticipantObject;                      		// 0x0038 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FBehaviorParameters                         EventData;                                        		// 0x0040 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function WillowGame.Behavior_ActivateSkill.ApplyBehaviorToContext
// [0x12480000] 
struct UBehavior_ActivateSkill_execApplyBehaviorToContext_Params
{
	class UObject*                                     ContextObject;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FBehaviorKernelInfo                         KernelInfo;                                       		// 0x0008 (0x0020) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	class UObject*                                     SelfObject;                                       		// 0x0028 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     MyInstigatorObject;                               		// 0x0030 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     OtherEventParticipantObject;                      		// 0x0038 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FBehaviorParameters                         EventData;                                        		// 0x0040 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function WillowGame.Behavior_AddInstanceData.ApplyBehaviorToContext
// [0x12480000] 
struct UBehavior_AddInstanceData_execApplyBehaviorToContext_Params
{
	class UObject*                                     ContextObject;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FBehaviorKernelInfo                         KernelInfo;                                       		// 0x0008 (0x0020) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	class UObject*                                     SelfObject;                                       		// 0x0028 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     MyInstigatorObject;                               		// 0x0030 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     OtherEventParticipantObject;                      		// 0x0038 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FBehaviorParameters                         EventData;                                        		// 0x0040 (0x0010) [0x0000000000400080] (CPF_Parm | CPF_NeedCtorLink)
};

// Function WillowGame.Behavior_AddInstanceDataFromBehaviorContext.ApplyBehaviorToContext
// [0x12480000] 
struct UBehavior_AddInstanceDataFromBehaviorContext_execApplyBehaviorToContext_Params
{
	class UObject*                                     ContextObject;                                    		// 0x0000 (0x0008) [0x0000000000000080] (CPF_Parm)    
	struct FBehaviorKernelInfo                         KernelInfo;                                       		// 0x0008 (0x0020) [0x0000000000000180] (CPF_Parm | CPF_OutParm)
	class UObject*                                     SelfObject;                                       		// 0x0028 (0x0008) [0x0000000000000080] (CPF_Parm)    
	class UObject*                                     MyInstigatorObject;                               		// 0x0030 (0x0008) [0x0000000000000080] (CPF_Parm)    
