/*
#############################################################################################
# BattleBorn (1.0.0.0) SDK
# Generated with the CodeRedGenerator v1.0.3
# ========================================================================================= #
# File: WillowGame_structs.hpp
# ========================================================================================= #
# Credits: TheFeckless, ItsBranK
# Links: www.github.com/CodeRedModding/CodeRed-Generator, www.twitter.com/ItsBranK
#############################################################################################
*/
#pragma once

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

/*
# ========================================================================================= #
# Structs
# ========================================================================================= #
*/

// ScriptStruct WillowGame.Action_SwoopAttack.SwoopAttackData
// 0x0008
struct FSwoopAttackData
{
	uint32_t                                           bTriggered : 1;                                // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bCacheTargetLocation : 1;                      // 0x0000 (0x0004) [0x0000000000000003] [0x00000002] (CPF_Edit | CPF_Const)
	float                                              Distance;                                      // 0x0004 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct WillowGame.ActionSkill.ActionSkillCustomEventReplicationData
// 0x000C
struct FActionSkillCustomEventReplicationData
{
	uint8_t                                            EventCountForReplication;                      // 0x0000 (0x0001) [0x0000000000000000]               
	struct FName                                       EventName;                                     // 0x0004 (0x0008) [0x0000000000000000]               
};

// ScriptStruct WillowGame.ActionSkill.CachedWeaponInfo
// 0x0028
struct FCachedWeaponInfo
{
	int32_t                                            CachedClipSize;                                // 0x0000 (0x0004) [0x0000000000002000] (CPF_Transient)
	int32_t                                            CachedAmmoInClip;                              // 0x0004 (0x0004) [0x0000000000002000] (CPF_Transient)
	int32_t                                            CachedAmmoNotInClip;                           // 0x0008 (0x0004) [0x0000000000002000] (CPF_Transient)
	uint32_t                                           CachedWeaponIsReloading : 1;                   // 0x000C (0x0004) [0x0000000000002000] [0x00000001] (CPF_Transient)
	class UWeaponTypeDefinition*                       CachedWeaponTypeDef;                           // 0x0010 (0x0008) [0x0000000000002000] (CPF_Transient)
	class USwfMovie*                                   CachedWeaponTypeDLCClip;                       // 0x0018 (0x0008) [0x0000000000002000] (CPF_Transient)
	int32_t                                            IsReloadIconDisplayed;                         // 0x0020 (0x0004) [0x0000000000002000] (CPF_Transient)
	int32_t                                            IsInteractionIconDisplayed;                    // 0x0024 (0x0004) [0x0000000000002000] (CPF_Transient)
};

// ScriptStruct WillowGame.WillowCharacterClassDefinition.AttributeCategory
// 0x0020
struct FAttributeCategory
{
	class FString                                      Category;                                      // 0x0000 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<struct FAttributeBaseValueData>       Attributes;                                    // 0x0010 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct WillowGame.InteractionIconDefinition.InteractionIconWithOverrides
// 0x001C
struct FInteractionIconWithOverrides
{
	class UInteractionIconDefinition*                  IconDef;                                       // 0x0000 (0x0008) [0x0000000000000000]               
	class UInteractionIconDefinition*                  OverrideIconDef;                               // 0x0008 (0x0008) [0x0000000000000000]               
	uint32_t                                           bOverrideIcon : 1;                             // 0x0010 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bOverrideAction : 1;                           // 0x0010 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bOverrideText : 1;                             // 0x0010 (0x0004) [0x0000000000000000] [0x00000004] 
	uint8_t                                            bCostsToUse;                                   // 0x0014 (0x0001) [0x0000000000000000]               
	uint8_t                                            CostsCurrencyType;                             // 0x0015 (0x0001) [0x0000000000000000]               
	int32_t                                            CostsAmount;                                   // 0x0018 (0x0004) [0x0000000000000000]               
};

// ScriptStruct WillowGame.IUsable.UseActionData
// 0x0098
struct FUseActionData
{
	struct FAttributeInitializationData                Duration;                                      // 0x0000 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                UseRate;                                       // 0x0020 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                DecayRate;                                     // 0x0040 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                MultiUserUseScale;                             // 0x0060 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           bHoldToUse : 1;                                // 0x0080 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	uint32_t                                           bResetProgressWhenInterrupted : 1;             // 0x0080 (0x0004) [0x0000000000000003] [0x00000002] (CPF_Edit | CPF_Const)
	uint32_t                                           bInterruptWhenDamaged : 1;                     // 0x0080 (0x0004) [0x0000000000000003] [0x00000004] (CPF_Edit | CPF_Const)
	uint32_t                                           bDisplayProgressBar : 1;                       // 0x0080 (0x0004) [0x0000000000000003] [0x00000008] (CPF_Edit | CPF_Const)
	uint32_t                                           bAllowMultipleUsers : 1;                       // 0x0080 (0x0004) [0x0000000000000003] [0x00000010] (CPF_Edit | CPF_Const)
	uint32_t                                           bCostsToUse : 1;                               // 0x0080 (0x0004) [0x0000000000000003] [0x00000020] (CPF_Edit | CPF_Const)
	float                                              CancelUseRadius;                               // 0x0084 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              CancelUseAngle;                                // 0x0088 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class UExpressionEvaluator*                        CancelExpression;                              // 0x0090 (0x0008) [0x0000000004000003] (CPF_Edit | CPF_Const | CPF_EditInline)
};

// ScriptStruct WillowGame.IUsable.UseActionState
// 0x00A8
struct FUseActionState
{
	struct FUseActionData                              Data;                                          // 0x0000 (0x0098) [0x0000000000000000]               
	uint32_t                                           bManagedByUsable : 1;                          // 0x0098 (0x0004) [0x0000000000000000] [0x00000001] 
	float                                              StartTime;                                     // 0x009C (0x0004) [0x0000000000000000]               
	float                                              UsedTime;                                      // 0x00A0 (0x0004) [0x0000000000000000]               
	float                                              ResourceConsumedRemainder;                     // 0x00A4 (0x0004) [0x0000000000000000]               
};

// ScriptStruct WillowGame.IUsable.ClientUseActionState
// 0x0010
struct FClientUseActionState
{
	float                                              Duration;                                      // 0x0000 (0x0004) [0x0000000000000000]               
	float                                              Rate;                                          // 0x0004 (0x0004) [0x0000000000000000]               
	float                                              StartOffset;                                   // 0x0008 (0x0004) [0x0000000000000000]               
	int32_t                                            UsedPct;                                       // 0x000C (0x0004) [0x0000000000000000]               
};

// ScriptStruct WillowGame.AIPawnBalanceDefinition.AIPawnPlaythroughData
// 0x0070
struct FAIPawnPlaythroughData
{
	int32_t                                            PlayThrough;                                   // 0x0000 (0x0004) [0x0000000000020003] (CPF_Edit | CPF_Const | CPF_EditConst)
	class FString                                      DisplayName;                                   // 0x0008 (0x0010) [0x0000000000408003] (CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink)
	class TArray<struct FAITransformedName>            TransformedNames;                              // 0x0018 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<class UBehaviorBase*>                 OnSpawnCustomizations;                         // 0x0028 (0x0010) [0x0000000004400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink | CPF_EditInline)
	class TArray<struct FAttributeBaseValueData>       AttributeStartingValues;                       // 0x0038 (0x0010) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class TArray<class UItemPoolListDefinition*>       CustomItemPoolIncludedLists;                   // 0x0048 (0x0010) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class TArray<struct FItemPoolInfo>                 CustomItemPoolList;                            // 0x0058 (0x0010) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class UMaterialInstance*                           MeshMaterial;                                  // 0x0068 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct WillowGame.AIPawnBalanceDefinition.AITransformedName
// 0x0020
struct FAITransformedName
{
	uint8_t                                            Type;                                          // 0x0000 (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class FString                                      TransformedName;                               // 0x0008 (0x0010) [0x0000000000408003] (CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink)
	struct FName                                       TransformedKillStat;                           // 0x0018 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct WillowGame.ItemPool.ItemPoolInfo
// 0x0028
struct FItemPoolInfo
{
	class UItemPoolDefinition*                         ItemPool;                                      // 0x0000 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                PoolProbability;                               // 0x0008 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct WillowGame.AIPawnBalanceDefinition.AIPawnGradeModifierData
// 0x0070
struct FAIPawnGradeModifierData
{
	class AWillowPawn* CustomAIPawnArchetype;                         // 0x0000 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class FString                                      DisplayName;                                   // 0x0008 (0x0010) [0x0000000000408003] (CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink)
	int32_t                                            ExpLevel;                                      // 0x0018 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class TArray<class UBehaviorBase*>                 OnSpawnCustomizations;                         // 0x0020 (0x0010) [0x0000000004400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink | CPF_EditInline)
	class TArray<struct FAttributeBaseValueData>       AttributeStartingValues;                       // 0x0030 (0x0010) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class TArray<class UItemPoolListDefinition*>       CustomItemPoolIncludedLists;                   // 0x0040 (0x0010) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class TArray<struct FItemPoolInfo>                 CustomItemPoolList;                            // 0x0050 (0x0010) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	class TArray<struct FAITransformedName>            TransformedNames;                              // 0x0060 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct WillowGame.AIPawnBalanceDefinition.AIPawnGameStageGradeWeightData
// 0x0070 (0x0048 - 0x00B8)
struct FAIPawnGameStageGradeWeightData : FGameStageGradeWeightData
{
	struct FAIPawnGradeModifierData                    GradeModifiers;                                // 0x0048 (0x0070) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
};

// ScriptStruct WillowGame.AttributePresentationDefinition.AttributePresentationValueRemappingData
// 0x0088
struct FAttributePresentationValueRemappingData
{
	uint32_t                                           bUseContextOverride : 1;                       // 0x0000 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                InputValueMn;                                  // 0x0008 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                InputValueMx;                                  // 0x0028 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                OutputValueMn;                                 // 0x0048 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FAttributeInitializationData                OutputValueMx;                                 // 0x0068 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct WillowGame.AttributePresentationDefinition.ModifierValuePresentationData
// 0x0018
struct FModifierValuePresentationData
{
	class UAttributePresentationDefinition*            AttributePresentation;                         // 0x0000 (0x0008) [0x0000000000100000]               
	class UAttributePresentationDefinition*            OptionalConstraintPresentation;                // 0x0008 (0x0008) [0x0000000000100000]               
	float                                              ModifierValue;                                 // 0x0010 (0x0004) [0x0000000000100000]               
	uint32_t                                           bShouldDisplay : 1;                            // 0x0014 (0x0004) [0x0000000000100000] [0x00000001] 
};

// ScriptStruct WillowGame.BalanceModifierDefinition.BalanceModification
// 0x002C
struct FBalanceModification
{
	uint8_t                                            MinEffectiveLevel;                             // 0x0000 (0x0001) [0x0000000000000001] (CPF_Edit)    
	float                                              EnemyHealthMultiplier;                         // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              BadassEnemyHealthMultiplier;                   // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              EnemyShieldStrengthMultiplier;                 // 0x000C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              BadassEnemyShieldStrengthMultiplier;           // 0x0010 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              EnemyDamageMultiplier;                         // 0x0014 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              BadassEnemyDamageMultiplier;                   // 0x0018 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              XPGainedFromCombatMultiplier;                  // 0x001C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              XPGainedFromQuestsMultiplier;                  // 0x0020 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              BadassRankGainMultiplier;                      // 0x0024 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              AmplifiedDamageMultiplier;                     // 0x0028 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct WillowGame.Behavior_AIThrowProjectileAtTarget.AIThrowProjectileBehaviorSequenceStateData
// 0x000C
struct FAIThrowProjectileBehaviorSequenceStateData
{
	uint8_t                                            Action;                                        // 0x0000 (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FName                                       SequenceName;                                  // 0x0004 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct WillowGame.Behavior_Conditional.BehaviorCondition
// 0x0020
struct FBehaviorCondition
{
	int32_t                                            ConditionId;                                   // 0x0000 (0x0004) [0x0000000000000002] (CPF_Const)   
	class UExpressionEvaluator*                        Condition;                                     // 0x0008 (0x0008) [0x0000000004000003] (CPF_Edit | CPF_Const | CPF_EditInline)
	class TArray<class UBehaviorBase*>                 Behaviors;                                     // 0x0010 (0x0010) [0x0000000004400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink | CPF_EditInline)
};

// ScriptStruct WillowGame.Behavior_DropProjectile.DropProjectileBehaviorSequenceStateData
// 0x000C
struct FDropProjectileBehaviorSequenceStateData
{
	uint8_t                                            Action;                                        // 0x0000 (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FName                                       SequenceName;                                  // 0x0004 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct WillowGame.WillowLightProjectileManager.BeamLocationData
// 0x0030
struct FBeamLocationData
{
	class AActor*                                      Actor;                                         // 0x0000 (0x0008) [0x0000000000000000]               
	struct FName                                       Socket;                                        // 0x0008 (0x0008) [0x0000000000000000]               
	struct FVector                                     Offset;                                        // 0x0010 (0x000C) [0x0000000000000000]               
	class UIWorldBody*                                 WorldBody_Object;                              // 0x0020 (0x0010) [0x0000000000000000] 
	class UIWorldBody*                                 WorldBody_Interface;                           // 0x0020 (0x0010) [0x0000000000000000]               
};

// ScriptStruct WillowGame.WillowLightProjectileManager.LightProjectile
// 0x00A8
struct FLightProjectile
{
	uint32_t                                           bEnabled : 1;                                  // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bPendingAdd : 1;                               // 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bNeedsConstantTrace : 1;                       // 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bStartParticleTracerAtWeapon : 1;              // 0x0000 (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bActorReflected : 1;                           // 0x0000 (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           bEnemyPenetrating : 1;                         // 0x0000 (0x0004) [0x0000000000000000] [0x00000020] 
	uint32_t                                           bOvercharged : 1;                              // 0x0000 (0x0004) [0x0000000000000000] [0x00000040] 
	uint32_t                                           bRicochetTowardsEnemy : 1;                     // 0x0000 (0x0004) [0x0000000000000000] [0x00000080] 
	uint32_t                                           bPenetrateUsingOriginalTraceDirection : 1;     // 0x0000 (0x0004) [0x0000000000000000] [0x00000100] 
	struct FVector                                     Location;                                      // 0x0004 (0x000C) [0x0000000000000000]               
	struct FVector                                     PartLocation;                                  // 0x0010 (0x000C) [0x0000000000000000]               
	struct FVector                                     Velocity;                                      // 0x001C (0x000C) [0x0000000000000000]               
	class UParticleSystemComponent*                    PartRef;                                       // 0x0028 (0x0008) [0x0000000004080008] (CPF_ExportObject | CPF_Component | CPF_EditInline)
	struct FAkPlayingInfo                              AudioRef;                                      // 0x0030 (0x0010) [0x0000000000080000] (CPF_Component)
	class UFiringModeDefinition*                       FireDef;                                       // 0x0040 (0x0008) [0x0000000000000000]               
	float                                              StartTime;                                     // 0x0048 (0x0004) [0x0000000000000000]               
	int32_t                                            NumRicochets;                                  // 0x004C (0x0004) [0x0000000000000000]               
	float                                              LastTraceTime;                                 // 0x0050 (0x0004) [0x0000000000000000]               
	struct FVector                                     LastSafeTraceStartLocation;                    // 0x0054 (0x000C) [0x0000000000000000]               
	class AActor*                                      LastHitActor;                                  // 0x0060 (0x0008) [0x0000000000000000]               
	class APawn*                                       Instigator;                                    // 0x0068 (0x0008) [0x0000000000000000]               
	float                                              Damage;                                        // 0x0070 (0x0004) [0x0000000000000000]               
	int32_t                                            FiringPatternIdx;                              // 0x0074 (0x0004) [0x0000000000000000]               
	uint8_t                                            BulletFromClipType;                            // 0x0078 (0x0001) [0x0000000000000000]               
	uint8_t                                            bHitWater;                                     // 0x0079 (0x0001) [0x0000000000000000]               
	uint8_t                                            PenetrationCount;                              // 0x007A (0x0001) [0x0000000000000000]               
	uint8_t                                            Id;                                            // 0x007B (0x0001) [0x0000000000000000]               
	uint8_t                                            StatId;                                        // 0x007C (0x0001) [0x0000000000000000]               
	struct FVector                                     StartTrace;                                    // 0x0080 (0x000C) [0x0000000000000000]               
	struct FVector                                     EndTrace;                                      // 0x008C (0x000C) [0x0000000000000000]               
	struct FVector                                     OriginalStartTrace;                            // 0x0098 (0x000C) [0x0000000000000000]               
	float                                              DistanceTraveled;                              // 0x00A4 (0x0004) [0x0000000000000000]               
};

// ScriptStruct WillowGame.WillowLightProjectileManager.ReplicatedLightProjectile
// 0x0044
struct FReplicatedLightProjectile
{
	uint32_t                                           bEnabled : 1;                                  // 0x0000 (0x0004) [0x0000000000000000] [0x00000001] 
	uint32_t                                           bStartParticleTracerAtWeapon : 1;              // 0x0000 (0x0004) [0x0000000000000000] [0x00000002] 
	uint32_t                                           bActorReflected : 1;                           // 0x0000 (0x0004) [0x0000000000000000] [0x00000004] 
	uint32_t                                           bEnemyPenetrating : 1;                         // 0x0000 (0x0004) [0x0000000000000000] [0x00000008] 
	uint32_t                                           bOvercharged : 1;                              // 0x0000 (0x0004) [0x0000000000000000] [0x00000010] 
	uint32_t                                           bRicochetTowardsEnemy : 1;                     // 0x0000 (0x0004) [0x0000000000000000] [0x00000020] 
	uint8_t                                            Id;                                            // 0x0004 (0x0001) [0x0000000000000000]               
	struct FVector                                     StartTrace;                                    // 0x0008 (0x000C) [0x0000000000000000]               
	struct FVector                                     EndTrace;                                      // 0x0014 (0x000C) [0x0000000000000000]               
	float                                              ReflectSpeed;                                  // 0x0020 (0x0004) [0x0000000000000000]               
	class UFiringModeDefinition*                       FireDef;                                       // 0x0028 (0x0008) [0x0000000000000000]               
	int32_t                                            FiringPatternIdx;                              // 0x0030 (0x0004) [0x0000000000000000]               
	class APawn*                                       Instigator;                                    // 0x0038 (0x0008) [0x0000000000000000]               
	float                                              StartTime;                                     // 0x0040 (0x0004) [0x1000000000000000]               
};

// ScriptStruct WillowGame.WillowLightProjectileManager.BeamDamageData
// 0x003C
struct FBeamDamageData
{
	float                                              Momentum;                                      // 0x0000 (0x0004) [0x0000000000000000]               
	float                                              Amount;                                        // 0x0004 (0x0004) [0x0000000000000000]               
	float                                              Radius;                                        // 0x0008 (0x0004) [0x0000000000000000]               
	class UClass*                                      Source;                                        // 0x0010 (0x0008) [0x0000000000000000]               
	class UDamageTypeDefinition*                       TypeDefinition;                                // 0x0018 (0x0008) [0x0000000000000000]               
	float                                              BarrelSourceTime;                              // 0x0020 (0x0004) [0x0000000000000000]               
	float                                              PlantSourceTime;                               // 0x0024 (0x0004) [0x0000000000000000]               
	class UIDamageCauser*                              DamageCauser_Object;                           // 0x0028 (0x0010) [0x0000000000000000] 
	class UIDamageCauser*                              DamageCauser_Interface;                        // 0x0028 (0x0010) [0x0000000000000000]               
	uint32_t                                           bCanDamageFriendlies : 1;                      // 0x0038 (0x0004) [0x0000000000000000] [0x00000001] 
};

// ScriptStruct WillowGame.IUpdatePostProcessOverride.DOFEffectModifierData
// 0x000C
struct FDOFEffectModifierData
{
	uint32_t                                           AutoRelcalculateFocusDistance : 1;             // 0x0000 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	float                                              RecalculateFocusDistanceRate;                  // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              FocusDistanceLerpRate;                         // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct WillowGame.IUpdatePostProcessOverride.AttributeDefinitionDefault
// 0x000C
struct FAttributeDefinitionDefault
{
	class UAttributeDefinition*                        Attribute;                                     // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              DefaultValue;                                  // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct WillowGame.IUpdatePostProcessOverride.PostProcessOverlay
// 0x013C
struct FPostProcessOverlay
{
	struct FName                                       OverlayName;                                   // 0x0000 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FPostProcessSettings                        DestPostProcessOverlay;                        // 0x0008 (0x0118) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	float                                              MinTransitionInDuration;                       // 0x0120 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              MinTransitionHoldDuration;                     // 0x0124 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              MinTransitionOutDuration;                      // 0x0128 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              MaxTransitionInDuration;                       // 0x012C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              MaxTransitionHoldDuration;                     // 0x0130 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              MaxTransitionOutDuration;                      // 0x0134 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           ClearOverlayQueueAfterTransition : 1;          // 0x0138 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
};

// ScriptStruct WillowGame.IUpdatePostProcessOverride.AttributeScalarParam
// 0x0068
struct FAttributeScalarParam
{
	struct FName                                       ParamName;                                     // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bVectorParam : 1;                              // 0x0008 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bClampInput : 1;                               // 0x0008 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	struct FAttributeDefinitionDefault                 Input;                                         // 0x0010 (0x0010) [0x0000000000000001] (CPF_Edit)    
	struct FAttributeDefinitionDefault                 MinInput;                                      // 0x0020 (0x0010) [0x0000000000000001] (CPF_Edit)    
	struct FAttributeDefinitionDefault                 MaxInput;                                      // 0x0030 (0x0010) [0x0000000000000001] (CPF_Edit)    
	struct FAttributeDefinitionDefault                 MinOutput;                                     // 0x0040 (0x0010) [0x0000000000000001] (CPF_Edit)    
	struct FAttributeDefinitionDefault                 MaxOutput;                                     // 0x0050 (0x0010) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                            ScalarParamOperand;                            // 0x0060 (0x0001) [0x0000000000000001] (CPF_Edit)    
	float                                              CurrentValue;                                  // 0x0064 (0x0004) [0x0000000000000000]               
};

// ScriptStruct WillowGame.IUpdatePostProcessOverride.MaterialEffectModifier
// 0x0028
struct FMaterialEffectModifier
{
	struct FName                                       EffectName;                                    // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class TArray<struct FAttributeScalarParam>         ScalarParams;                                  // 0x0008 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	float                                              CachedValue;                                   // 0x0018 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class UMaterialInstance*                           MaterialInstance;                              // 0x0020 (0x0008) [0x0000000000000000]               
};

// ScriptStruct WillowGame.IUpdatePostProcessOverride.DOFEffectData
// 0x002C
struct FDOFEffectData
{
	float                                              FalloffExponent;                               // 0x0000 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              BlurKernelSize;                                // 0x0004 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxNearBlurAmount;                             // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              MaxFarBlurAmount;                              // 0x000C (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FColor                                      ModulateBlurColor;                             // 0x0010 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                            FocusType;                                     // 0x0014 (0x0001) [0x0000000000000001] (CPF_Edit)    
	float                                              FocusInnerRadius;                              // 0x0018 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              FocusDistance;                                 // 0x001C (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     FocusPosition;                                 // 0x0020 (0x000C) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct WillowGame.Behavior_RandomlySelectBehaviors.BehaviorsSelectionData
// 0x0030
struct FBehaviorsSelectionData
{
	struct FAttributeInitializationData                Weight;                                        // 0x0000 (0x0020) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class TArray<class UBehaviorBase*>                 Behaviors;                                     // 0x0020 (0x0010) [0x0000000004400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink | CPF_EditInline)
};

// ScriptStruct WillowGame.Behavior_RemoveInstanceData.RemoveObject
// 0x0008
struct FRemoveObject
{
	struct FName                                       Name;                                          // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct WillowGame.IScreenParticle.ScreenParticleScalarParamOverTime
// 0x0018
struct FScreenParticleScalarParamOverTime
{
	struct FName                                       ParameterName;                                 // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              TotalTime;                                     // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              StartValue;                                    // 0x000C (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              EndValue;                                      // 0x0010 (0x0004) [0x0000000000000001] (CPF_Edit)    
	float                                              LastValue;                                     // 0x0014 (0x0004) [0x0000000000002000] (CPF_Transient)
};

// ScriptStruct WillowGame.IScreenParticle.ScreenParticleVectorParamOverTime
// 0x0030
struct FScreenParticleVectorParamOverTime
{
	struct FName                                       ParameterName;                                 // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              TotalTime;                                     // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     VectorStartValue;                              // 0x000C (0x000C) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     VectorEndValue;                                // 0x0018 (0x000C) [0x0000000000000001] (CPF_Edit)    
	struct FVector                                     LastValue;                                     // 0x0024 (0x000C) [0x0000000000002000] (CPF_Transient)
};

// ScriptStruct WillowGame.IScreenParticle.ScreenParticleParamOverTime
// 0x0020
struct FScreenParticleParamOverTime
{
	class TArray<struct FScreenParticleScalarParamOverTime> ScalarParams;                                  // 0x0000 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<struct FScreenParticleVectorParamOverTime> VectorParams;                                  // 0x0010 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct WillowGame.IScreenParticle.ScreenParticleModifier
// 0x0014
struct FScreenParticleModifier
{
	class TArray<struct FAttributeScalarParam>         ScalarParams;                                  // 0x0000 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	float                                              CachedValue;                                   // 0x0010 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct WillowGame.IScreenParticle.ScreenParticleInitParams
// 0x0074
struct FScreenParticleInitParams
{
	class UParticleSystem*                             Template;                                      // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class TArray<struct FScreenParticleModifier>       ScreenParticleModifiers;                       // 0x0008 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class UMaterialInterface*                          TemplateScreenParticleMaterial;                // 0x0018 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FName                                       MatParamName;                                  // 0x0020 (0x0008) [0x0000000000000001] (CPF_Edit)    
	uint32_t                                           bHideWhenFinished : 1;                         // 0x0028 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	struct FName                                       ParticleTag;                                   // 0x002C (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FVector2D                                   ContentDims;                                   // 0x0034 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              ParticleDepth;                                 // 0x003C (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                            ScalingMode;                                   // 0x0040 (0x0001) [0x0000000000000001] (CPF_Edit)    
	struct FScreenParticleParamOverTime                StopParamsOT;                                  // 0x0048 (0x0020) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	uint32_t                                           bOnlyOwnerSee : 1;                             // 0x0068 (0x0004) [0x0000000000000000] [0x00000001] 
	uint8_t                                            EffectDepthPriorityGroup;                      // 0x006C (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           bAlwaysVisible : 1;                            // 0x0070 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bUseDesignerAttributeParameters : 1;           // 0x0070 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
};

// ScriptStruct WillowGame.IScreenParticle.ScreenParticleRecord
// 0x0068
struct FScreenParticleRecord
{
	struct FName                                       Tag;                                           // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UParticleSystem*                             Template;                                      // 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
	struct FName                                       MatParamName;                                  // 0x0010 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UParticleSystemComponent*                    Component;                                     // 0x0018 (0x0008) [0x0000000004080009] (CPF_Edit | CPF_ExportObject | CPF_Component | CPF_EditInline)
	class TArray<struct FScreenParticleModifier>       AppliedModifiers;                              // 0x0020 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	struct FVector2D                                   ContentDims;                                   // 0x0030 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              ParticleDepth;                                 // 0x0038 (0x0004) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                            ScalingMode;                                   // 0x003C (0x0001) [0x0000000000000001] (CPF_Edit)    
	struct FScreenParticleParamOverTime                StopParamsOT;                                  // 0x0040 (0x0020) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	uint32_t                                           bUseDesignerAttributeParameters : 1;           // 0x0060 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bAlwaysVisible : 1;                            // 0x0060 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	float                                              StopTime;                                      // 0x0064 (0x0004) [0x0000000000002000] (CPF_Transient)
};

// ScriptStruct WillowGame.WillowWeaponTypes.ExtraMuzzleEffect
// 0x0010
struct FExtraMuzzleEffect
{
	class UParticleSystem*                             Particles;                                     // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UAkEvent*                                    Sound;                                         // 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct WillowGame.WillowWeaponTypes.WeaponBoneControllerData
// 0x0018
struct FWeaponBoneControllerData
{
	struct FName                                       BoneName;                                      // 0x0000 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint8_t                                            ControlType;                                   // 0x0008 (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           bUseInFirstPerson : 1;                         // 0x000C (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	uint32_t                                           bUseInThirdPerson : 1;                         // 0x000C (0x0004) [0x0000000000000003] [0x00000002] (CPF_Edit | CPF_Const)
	class USkelControlBase*                            ControlTemplate;                               // 0x0010 (0x0008) [0x0000000004400009] (CPF_Edit | CPF_ExportObject | CPF_NeedCtorLink | CPF_EditInline)
};

// ScriptStruct WillowGame.WillowWeaponTypes.WeaponDefinitionData
// 0x0008
struct FWeaponDefinitionData
{
	class UWeaponTypeDefinition*                       WeaponTypeDefinition;                          // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct WillowGame.WillowWeaponTypes.WeaponAccessorySetup
// 0x0028
struct FWeaponAccessorySetup
{
	struct FName                                       WeaponArchetypeName;                           // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UGestaltSkeletalMeshDefinition*              AccessoryDefinition;                           // 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UGestaltPartMatrices*                        AccessoryTransforms;                           // 0x0010 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class TArray<struct FGestaltPartPermutation>       AccessoryParts;                                // 0x0018 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
};

// ScriptStruct WillowGame.WillowEmitter.SpawnAttachmentInfo
// 0x000C
struct FSpawnAttachmentInfo
{
	uint8_t                                            SpawnType;                                     // 0x0000 (0x0001) [0x0000000000000000]               
	struct FName                                       AttachmentName;                                // 0x0004 (0x0008) [0x0000000000000000]               
};

// ScriptStruct WillowGame.Behavior_SpawnProjectile.ProjectileBehaviorSequenceStateData
// 0x000C
struct FProjectileBehaviorSequenceStateData
{
	uint8_t                                            Action;                                        // 0x0000 (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FName                                       SequenceName;                                  // 0x0004 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct WillowGame.BehaviorAliasLookupDefinition.BehaviorAliasReference
// 0x0018
struct FBehaviorAliasReference
{
	class UBehaviorAliasDefinition*                    BehaviorAlias;                                 // 0x0000 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class TArray<class UBehaviorBase*>                 BehaviorList;                                  // 0x0008 (0x0010) [0x0000000004400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink | CPF_EditInline)
};

// ScriptStruct WillowGame.BodyHitRegionDefinition.GoreTriggerData
// 0x0018
struct FGoreTriggerData
{
	class UDamageTypeDefinition*                       DamageTypeTrigger;                             // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class UClass*                                      DamageSourceTrigger;                           // 0x0008 (0x0008) [0x0000000000000001] (CPF_Edit)    
	uint8_t                                            CoreDamageTypeTrigger;                         // 0x0010 (0x0001) [0x0000000000000001] (CPF_Edit)    
	float                                              HealthPctDamageThreshold;                      // 0x0014 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct WillowGame.WillowPhysicalMaterialProperty.ImpactResponseParameters
// 0x0074
struct FImpactResponseParameters
{
	class TArray<struct FParticleSysParam>             ParticleParameters;                            // 0x0000 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<struct FFontParameterValue>           FontParameterValues;                           // 0x0010 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<struct FScalarParameterValue>         ScalarParameterValues;                         // 0x0020 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<struct FTextureParameterValue>        TextureParameterValues;                        // 0x0030 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<struct FVectorParameterValue>         VectorParameterValues;                         // 0x0040 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	class TArray<struct FRtpcParameterValue>           RtpcParameterValues;                           // 0x0050 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	uint32_t                                           bNoSound : 1;                                  // 0x0060 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	struct FVector                                     ReferenceLocation;                             // 0x0064 (0x000C) [0x0000000000000000]               
	float                                              GenericScale;                                  // 0x0070 (0x0004) [0x0000000000000000]               
};

// ScriptStruct WillowGame.WillowPhysicalMaterialProperty.ImpactResponseEffect
// 0x0158
struct FImpactResponseEffect
{
	uint32_t                                           bCensorThisEffect : 1;                         // 0x0000 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	class UWillowImpactDefinition*                     CensoredEffectAlternative;                     // 0x0008 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              DamageModifierPercent;                         // 0x0010 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class UAkEvent*                                    ImpactEvent;                                   // 0x0018 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              AINoiseLevel;                                  // 0x0020 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class UParticleSystem*                             ParticleTemplate;                              // 0x0028 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           bAttachParticleToHitActor : 1;                 // 0x0030 (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	uint32_t                                           bHideEffectFromHitActor : 1;                   // 0x0030 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	float                                              MaxEffectDistance;                             // 0x0034 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class TArray<class UMaterialInterface*>            DecalMaterials;                                // 0x0038 (0x0010) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	float                                              DecalWidth;                                    // 0x0048 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              DecalHeight;                                   // 0x004C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              DecalMinScale;                                 // 0x0050 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              DecalMaxScale;                                 // 0x0054 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              DecalDepth;                                    // 0x0058 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint32_t                                           DecalRandomRotation : 1;                       // 0x005C (0x0004) [0x0000000000000003] [0x00000001] (CPF_Edit | CPF_Const)
	uint32_t                                           DecalCreateNewMaterialInstanceConstant : 1;    // 0x005C (0x0004) [0x0000000000000003] [0x00000002] (CPF_Edit | CPF_Const)
	class UClass*                                      ImpactFlashLightClass;                         // 0x0060 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FScreenParticleInitParams                   ScreenParticle;                                // 0x0068 (0x0078) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	struct FImpactResponseParameters                   EffectParameters;                              // 0x00E0 (0x0078) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
};

// ScriptStruct WillowGame.WillowPhysicalMaterialProperty.RtpcParameterValue
// 0x000C
struct FRtpcParameterValue
{
	class UAkRtpc*                                     AkRtpc;                                        // 0x0000 (0x0008) [0x0000000000000001] (CPF_Edit)    
	float                                              Value;                                         // 0x0008 (0x0004) [0x0000000000000001] (CPF_Edit)    
};

// ScriptStruct WillowGame.WillowPhysicalMaterialProperty.ImpactResponseData
// 0x0160
struct FImpactResponseData
{
	class UWillowImpactDefinition*                     ImpactType;                                    // 0x0000 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	struct FImpactResponseEffect                       ResponseEffect;                                // 0x0008 (0x0158) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
};

// ScriptStruct WillowGame.WillowPhysicalMaterialProperty.WheelSlipModifierData
// 0x0008
struct FWheelSlipModifierData
{
	float                                              LongSlipFactor;                                // 0x0000 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              LatSlipFactor;                                 // 0x0004 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct WillowGame.BodyHitRegionDefinition.HitReactionData
// 0x0020
struct FHitReactionData
{
	float                                              HoldTime;                                      // 0x0000 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              BlendInTime;                                   // 0x0004 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              BlendOutTime;                                  // 0x0008 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint8_t                                            BlendInType;                                   // 0x000C (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	uint8_t                                            BlendOutType;                                  // 0x000D (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              LinearSpringStrength;                          // 0x0010 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              AngularSpringStrength;                         // 0x0014 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              ForceScale;                                    // 0x0018 (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
	float                                              MaxForce;                                      // 0x001C (0x0004) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct WillowGame.BodyHitRegionDefinition.DamageReactionData
// 0x0044 (0x0008 - 0x004C)
struct FDamageReactionData : FSpecializedBehaviorEvent
{
	class TArray<struct FGoreTriggerData>              DamageTriggers;                                // 0x0008 (0x0010) [0x0000000000400001] (CPF_Edit | CPF_NeedCtorLink)
	float                                              PercentOfHealthTrigger;                        // 0x0018 (0x0004) [0x0000000000000001] (CPF_Edit)    
	class USpecialMoveDefinition*                      DamageSpecialMove;                             // 0x0020 (0x0008) [0x0000000000000001] (CPF_Edit)    
	class TArray<class UBehaviorBase*>                 ReactionBehaviors;                             // 0x0028 (0x0010) [0x0000000000420003] (CPF_Edit | CPF_Const | CPF_EditConst | CPF_NeedCtorLink)
	class TArray<struct FName>                         PrerequisiteDamageTriggeredReactions;          // 0x0038 (0x0010) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	uint32_t                                           bDamageThreshold : 1;                          // 0x0048 (0x0004) [0x0000000000000001] [0x00000001] (CPF_Edit)
	uint32_t                                           bRepeatableEvent : 1;                          // 0x0048 (0x0004) [0x0000000000000001] [0x00000002] (CPF_Edit)
	uint32_t                                           bCensored : 1;                                 // 0x0048 (0x0004) [0x0000000000000001] [0x00000004] (CPF_Edit)
	uint32_t                                           bOnlyTriggeredOnOwnerDeath : 1;                // 0x0048 (0x0004) [0x0000000000000001] [0x00000008] (CPF_Edit)
};

// ScriptStruct WillowGame.BodyHitRegionDefinition.BodyHitRegionModifierData
// 0x0018
struct FBodyHitRegionModifierData
{
	struct FName                                       ModifierName;                                  // 0x0000 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class UPhysicalMaterial*                           PhysicalMaterial;                              // 0x0008 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class UPhysicalMaterial*                           ShieldedPhysicalMaterial;                      // 0x0010 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct WillowGame.BodyClassDeathDefinition.TechDeathData
// 0x0020 (0x0008 - 0x0028)
struct FTechDeathData : FSpecializedBehaviorEvent
{
	class TArray<class UDamageTypeDefinition*>         DamageTypeTriggers;                            // 0x0008 (0x0010) [0x0000000000400003] (CPF_Edit | CPF_Const | CPF_NeedCtorLink)
	uint8_t                                            CoreDamageTypeTrigger;                         // 0x0018 (0x0001) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class USpecialMoveDefinition*                      DeathAnimation;                                // 0x0020 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct WillowGame.BodyClassDefinition.BreathingLoopInfo
// 0x0018
struct FBreathingLoopInfo
{
	class UExpressionEvaluator*                        Condition;                                     // 0x0000 (0x0008) [0x0000000004000003] (CPF_Edit | CPF_Const | CPF_EditInline)
	class UAkEvent*                                    StartAkEvent;                                  // 0x0008 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class UAkEvent*                                    StopAkEvent;                                   // 0x0010 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct WillowGame.BodyClassDefinition.GenericAnimMapping
// 0x0010
struct FGenericAnimMapping
{
	class USpecialMoveDefinition*                      FromAnim;                                      // 0x0000 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class USpecialMoveDefinition*                      ToAnim;                                        // 0x0008 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct WillowGame.BodyClassDefinition.VehicleCrewMappingStruct
// 0x0010
struct FVehicleCrewMappingStruct
{
	struct FName                                       VehicleArchetypeName;                          // 0x0000 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
	class UAnimSet*                                    AnimSet;                                       // 0x0008 (0x0008) [0x0000000000000003] (CPF_Edit | CPF_Const)
};

// ScriptStruct WillowGame.BodyClassDefinition.ExertionVocalization
// 0x0010
struct FExertionVocalization
{
